{"Title": "Inaugural Address", "Date": "2025-01-20", "Text": "Thank you. Thank you very much, everybody. [Applause] Wow. Thank you very, very much.\nVice President Vance, Speaker Johnson, Senator Thune, Chief Justice Roberts, Justices of the Supreme Court of the United States, President Clinton, President Bush, President Obama, President Biden, Vice President Harris, and my fellow citizens: The golden age of America begins right now.\nFrom this day forward, our country will flourish and be respected again all over the world. We will be the envy of every nation, and we will not allow ourselves to be taken advantage of any longer. During every single day of the Trump administration, I will, very simply, put America first.\nOur sovereignty will be reclaimed. Our safety will be restored. The scales of justice will be rebalanced. The vicious, violent, and unfair weaponization of the Justice Department and our Government will end.\nAnd our top priority will be to create a nation that is proud, prosperous, and free. America will soon be greater, stronger, and far more exceptional than ever before.\nI return to the Presidency confident and optimistic that we are at the start of a thrilling new era of national success. A tide of change is sweeping the country, sunlight is pouring over the entire world, and America has the chance to seize this opportunity like never before.\nBut first, we must be honest about the challenges we face. While they are plentiful, they will be annihilated by this great momentum that the world is now witnessing in the United States of America.\nAs we gather today, our Government confronts a crisis of trust. For many years, a radical and corrupt establishment has extracted power and wealth from our citizens while the pillars of our society lay broken and seemingly in complete disrepair.\nWe now have a Government that cannot manage even a simple crisis at home while, at the same time, stumbling into a continuing catalogue of catastrophic events abroad.\nIt fails to protect our magnificent, law-abiding American citizens, but provides sanctuary and protection for dangerous criminals, many from prisons and mental institutions, that have illegally entered our country from all over the world.\nWe have a Government that has given unlimited funding to the defense of foreign borders, but refuses to defend American borders or, more importantly, its own people.\nOur country can no longer deliver basic services in times of emergency, as recently shown by the wonderful people of North Carolina—who have been treated so badly—and other States who are still suffering from a hurricane that took place many months ago or, more recently, Los Angeles, where we are watching fires still tragically burn from weeks ago without even a token of defense. They're raging through the houses and communities, even affecting some of the wealthiest and most powerful individuals in our country, some of whom are sitting here right now. They don't have a home any longer. That's interesting. But we can't let this happen. Everyone is unable to do anything about it. That's going to change.\nWe have a public health system that does not deliver in times of disaster, yet more money is spent on it than any country anywhere in the world.\nAnd we have an education system that teaches our children to be ashamed of themselves, in many cases, to hate our country despite the love that we try so desperately to provide to them. All of this will change starting today, and it will change very quickly.\nMy recent election is a mandate to completely and totally reverse a horrible betrayal and all of these many betrayals that have taken place and to give the people back their faith, their wealth, their democracy, and indeed, their freedom. From this moment on, America's decline is over.\nOur liberties and our Nation's glorious destiny will no longer be denied. And we will immediately restore the integrity, competency, and loyalty of America's Government.\nOver the past 8 years, I have been tested and challenged more than any President in our 250-year history, and I've learned a lot along the way. The journey to reclaim our Republic has not been an easy one, that I can tell you. Those who wish to stop our cause have tried to take my freedom and, indeed, to take my life.\nJust a few months ago, in a beautiful Pennsylvania field, an assassin's bullet ripped through my ear. But I felt then and believe even more so now that my life was saved for a reason. I was saved by God to make America great again. [Applause] Thank you. Thank you. Thank you very much.\nThat is why each day under our administration of American patriots, we will be working to meet every crisis with dignity and power and strength. We will move with purpose and speed to bring back hope, prosperity, safety, and peace for citizens of every race, religion, color, and creed.\nFor American citizens, January 20, 2025, is liberation day. It is my hope that our recent Presidential election will be remembered as the greatest and most consequential election in the history of our country.\nAs our victory showed, the entire nation is rapidly unifying behind our agenda with dramatic increases in support from virtually every element of our society: young and old, men and women, African Americans, Hispanic Americans, Asian Americans, urban, suburban, rural. And very importantly, we had a powerful win in all seven swing States—[applause]—and the popular vote, we won by millions of people.\nTo the Black and Hispanic communities, I want to thank you for the tremendous outpouring of love and trust that you have shown me with your vote. We set records, and I will not forget it. I've heard your voices in the campaign, and I look forward to working with you in the years to come.\nToday is Martin Luther King Day. And his honor—this will be a great honor. But in his honor, we will strive together to make his dream a reality. We will make his dream come true. [Applause] Thank you. Thank you. Thank you.\nNational unity is now returning to America, and confidence and pride is soaring like never before. In everything we do, my administration will be inspired by a strong pursuit of excellence and unrelenting success. We will not forget our country, we will not forget our Constitution, and we will not forget our God. [Applause] Can't do that.\nToday I will sign a series of historic Executive orders. With these actions, we will begin the complete restoration of America and the revolution of common sense. It's all about common sense.\nFirst, I will declare a national emergency at our southern border. All illegal entry will immediately be halted, and we will begin the process of returning millions and millions of criminal aliens back to the places from which they came. We will reinstate my \"Remain in Mexico\" policy.\nI will end the practice of catch-and-release. And I will send troops to the southern border to repel the disastrous invasion of our country. Under the orders I sign today, we will also be designating the cartels as foreign terrorist organizations.\nAnd by invoking the Alien Enemies Act of 1798, I will direct our Government to use the full and immense power of Federal and State law enforcement to eliminate the presence of all foreign gangs and criminal networks bringing devastating crime to U.S. soil, including our cities and inner cities.\nAs Commander in Chief, I have no higher responsibility than to defend our country from threats and invasions, and that is exactly what I am going to do. We will do it at a level that nobody has ever seen before.\nNext, I will direct all members of my Cabinet to marshal the vast powers at their disposal to defeat what was record inflation and rapidly bring down costs and prices. The inflation crisis was caused by massive overspending and escalating energy prices, and that is why today I will also declare a national energy emergency. We will drill, baby, drill.\nAmerica will be a manufacturing nation once again, and we have something that no other manufacturing nation will ever have, the largest amount of oil and gas of any country on earth, and we are going to use it. We'll use it.\nWe will bring prices down, fill our strategic reserves up again right to the top, and export American energy all over the world. We will be a rich nation again, and it is that liquid gold under our feet that will help to do it.\nWith my actions today, we will end the \"green new deal,\" and we will revoke the electric vehicle mandate, saving our auto industry and keeping my sacred pledge to our great American autoworkers. In other words, you'll be able to buy the car of your choice.\nWe will build automobiles in America again at a rate that nobody could have dreamt possible just a few years ago. And thank you to the autoworkers of our Nation for your inspiring vote of confidence. We did tremendously with their vote.\nI will immediately begin the overhaul of our trade system to protect American workers and families. Instead of taxing our citizens to enrich other countries, we will tariff and tax foreign countries to enrich our citizens.\nFor this purpose, we are establishing the External Revenue Service to collect all tariffs, duties, and revenues. It will be massive amounts of money pouring into our Treasury, coming from foreign sources. The American dream will soon be back and thriving like never before.\nTo restore competence and effectiveness to our Federal Government, my administration will establish the brandnew Department of Government Efficiency.\nAfter years and years of illegal and unconstitutional Federal efforts to restrict free expression, I also will sign an Executive order to immediately stop all Government censorship and bring back free speech to America.\nNever again will the immense power of the state be weaponized to persecute political opponents, something I know something about. [Laughter] We will not allow that to happen. It will not happen again. Under my leadership, we will restore fair, equal, and impartial justice under the constitutional rule of law. And we are going to bring law and order back to our cities.\nThis week, I will also end the Government policy of trying to socially engineer race and gender into every aspect of public and private life. We will forge a society that is colorblind and merit based. As of today, it will henceforth be the official policy of the United States Government that there are only two genders: male and female.\nThis week, I will reinstate any servicemembers who were unjustly expelled from our military for objecting to the COVID vaccine mandate with full backpay.\nAnd I will sign an order to stop our warriors from being subjected to radical political theories and social experiments while on duty. It's going to end immediately. Our Armed Forces will be freed to focus on their sole mission: defeating America's enemies.\nLike in 2017, we will again build the strongest military the world has ever seen. We will measure our success not only by the battles we win, but also by the wars that we end and, perhaps most importantly, the wars we never get into.\nMy proudest legacy will be that of a peacemaker and unifier. That's what I want to be: a peacemaker and a unifier. I'm pleased to say that as of yesterday, 1 day before I assumed office, the hostages in the Middle East are coming back home to their families. [Applause] Thank you.\nAmerica will reclaim its rightful place as the greatest, most powerful, most respected nation on Earth, inspiring the awe and admiration of the entire world.\nA short time from now, we are going to be changing the name of the Gulf of Mexico to the Gulf of America, and we will restore the name of a great President, William McKinley, to Mount McKinley, where it should be and where it belongs.\nPresident McKinley made our country very rich through tariffs and through talent—he was a natural businessman—and gave Teddy Roosevelt the money for many of the great things he did, including the Panama Canal, which has foolishly been given to the country of Panama after the United States—the United States—I mean, think of this—spent more money than ever spent on a project before and lost 38,000 lives in the building of the Panama Canal.\nWe have been treated very badly from this foolish gift that should have never been made, and Panama's promise to us has been broken. The purpose of our deal and the spirit of our treaty has been totally violated. American ships are being severely overcharged and not treated fairly in any way, shape, or form. And that includes the United States Navy.\nAnd above all, China is operating the Panama Canal. And we didn't give it to China. We gave it to Panama, and we're taking it back.\nAbove all, my message to Americans today is that it is time for us to once again act with courage, vigor, and the vitality of history's greatest civilization.\nSo, as we liberate our Nation, we will lead it to new heights of victory and success. We will not be deterred. Together, we will end the chronic disease epidemic and keep our children safe, healthy, and disease-free.\nThe United States will once again consider itself a growing nation, one that increases our wealth, expands our territory, builds our cities, raises our expectations, and carries our flag into new and beautiful horizons.\nAnd we will pursue our manifest destiny into the stars, launching American astronauts to plant the Stars and Stripes on the planet Mars.\nAmbition is the lifeblood of a great nation, and, right now, our Nation is more ambitious than any other. There's no nation like our Nation.\nAmericans are explorers, builders, innovators, entrepreneurs, and pioneers. The spirit of the frontier is written into our hearts. The call of the next great adventure resounds from within our souls.\nOur American ancestors turned a small group of colonies on the edge of a vast continent into a mighty republic of the most extraordinary citizens on Earth. No one comes close.\nAmericans pushed thousands of miles through a rugged land of untamed wilderness. They crossed deserts, scaled mountains, braved untold dangers, won the Wild West, ended slavery, rescued millions from tyranny, lifted billions from poverty, harnessed electricity, split the atom, launched mankind into the heavens, and put the universe of human knowledge into the palm of the human hand. If we work together, there is nothing we cannot do and no dream we cannot achieve.\nMany people thought it was impossible for me to stage such a historic political comeback. But as you see today, here I am. The American people have spoken. I stand before you now as proof that you should never believe that something is impossible to do. In America, the impossible is what we do best.\nFrom New York to Los Angeles, from Philadelphia to Phoenix, from Chicago to Miami, from Houston to right here in Washington, DC, our country was forged and built by the generations of patriots who gave everything they had for our rights and for our freedom.\nThey were farmers and soldiers, cowboys and factory workers, steelworkers and coal miners, police officers and pioneers who pushed onward, marched forward, and let no obstacle defeat their spirit or their pride.\nTogether, they laid down the railroads, raised up the skyscrapers, built great highways, won two world wars, defeated fascism and communism, and triumphed over every single challenge that they faced.\nAfter all we have been through together, we stand on the verge of the 4 greatest years in American history. With your help, we will restore America promise and we will rebuild the nation that we love, and we love it so much.\nWe are one people, one family, and one glorious nation under God. So, to every parent who dreams for their child and every child who dreams for their future, I am with you, I will fight for you, and I will win for you. We're going to win like never before. [Applause] Thank you. Thank you. Thank you. Thank you.\nIn recent years, our Nation has suffered greatly. But we are going to bring it back and make it great again, greater than ever before. We will be a nation like no other, full of compassion, courage, and exceptionalism. Our power will stop all wars and bring a new spirit of unity to a world that has been angry, violent, and totally unpredictable.\nAmerica will be respected again and admired again, including by people of religion, faith, and good will. We will be prosperous, we will be proud, we will be strong, and we will win like never before.\nWe will not be conquered, we will not be intimidated, we will not be broken, and we will not fail. From this day on, the United States of America will be a free, sovereign, and independent nation.\nWe will stand bravely, we will live proudly, we will dream boldly, and nothing will stand in our way because we are Americans. The future is ours, and our golden age has just begun.\nThank you. God bless America. Thank you all. Thank you. Thank you very much. Thank you very much. Thank you.\nThank you.", "Link": "https://www.presidency.ucsb.edu/documents/inaugural-address-54"}
{"Title": "The President's News Conference With Prime Minister Benjamin Netanyahu of Israel", "Date": "2025-02-04", "Text": "President Trump. Thank you very much.\nThat's a lot of press. Congratulations. You bring them out. [Laughter]\nPrime Minister Netanyahu. Thank you.\nPresident Trump. You really bring them out.\nToday, I'm delighted to welcome Israeli Prime Minister Benjamin Netanyahu back to the White House. It's a wonderful feeling and a wonderful event. We had fantastic talks—and thank you very much—with your staff.\nHe's the first foreign head of state to visit during our administration. And, Bibi, I want to say, it's an honor to have you with us. Over the past 4 years, the U.S. and the Israeli alliance has been tested more than any time in history, but the bonds of friendship and affection between the American and Israeli people have endured for generations, and they are absolutely unbreakable. They are unbreakable.\nI'm confident that, under our leadership, the cherished alliance between our two countries will soon be stronger than ever. We had a great relationship. We had great victories together four years ago. Not so many victories over the past four years, however.\nIn my first term, Prime Minister and I forged a tremendously successful partnership that brought peace and stability to the Middle East like it hadn't seen in decades.\nTogether, we defeated ISIS, we ended the disastrous Iran nuclear deal—one of the worst deals ever made, by the way—and imposed the toughest ever sanctions on the Iranian regime. We starved Hamas and Iran's other terrorist proxies, and we starved them like they had never seen before—resources and support disappeared for them.\nI recognized Israel's capital; opened the American Embassy in Jerusalem, and got it built, by the way—built it too, just—not only designated it but got it built at a price that nobody has seen for 40 years. We got it built. It's beautiful, all Jerusalem stone, right from nearby, and it was—it's something that's very special. And recognized Israeli sovereignty over the Golan Heights, something that they talked about for 70 years and they weren't able to get it. And I got it.\nAnd with the historic Abraham Accords—something that was really an achievement that was, I think, going to become more and more important, because we achieved the most significant Middle East peace agreements in half a century—but the Abraham Accords, in particular. And I really believe that many countries will soon be joining this amazing peace and economic development transaction. It really is a big economic development transaction. I think we're going to have a lot of people signing up very quickly.\nUnfortunately, for 4 years, nobody signed up. Nobody did anything for 4 years, except in the negative—unfortunately, the weakness and incompetence of those years, those past 4 years—the grave damage around the globe that was done, including in the Middle East—grave damage all over the globe.\nThe horrors of October 7 would never have happened if I were President. The Ukraine and Russia disaster would never have happened if I were President.\nOver the past 16 months, Israel has endured a sustained, aggressive, and murderous assault on every front, but they've fought back bravely. You see that, and you know that. What we have witnessed is an all-out attack on the very existence of a Jewish state in the Jewish homeland.\nThe Israelis have stood strong and united in the face of an enemy that has kidnapped, tortured, raped, and slaughtered innocent men, women, children, and even little babies. I want to salute the Israeli people for meeting this trial with courage and determination and unflinching resolve. They have been strong.\nIn our meetings today, the Prime Minister and I focused on the future, discussing how we can work together to ensure Hamas is eliminated and ultimately restore peace to a very troubled region. It's been troubled, but what's happened in the last four years has not been good.\nI want to thank Prime Minister Netanyahu for working closely with my transition team; the Special Envoy, Steve Witkoff, who is here somewhere. Steve. Stand up, Steve, please. What a job you have done. What a good job you've done. Proud of you. Done a fantastic job. National Security Adviser Mike Waltz. Thank you, Mike, for working so well with us. Thank you.\nWe have, in addition, Marco Rubio, who is on the phone right now, listening to every single word that we say—[laughter]—and he's going to be great. And, Pete, congratulations. And, Scott, congratulations. I see you're here. And Karoline has been doing a great job. She's, really, probably talked about more than anybody here. [Laughter] She's done a fantastic job. And thank you very much, Karoline. We're proud of you.\nBut we'll only be satisfied when all of these problems are solved. And we have the team to solve them, and that's going to happen, and it's going to happen, I think, very quickly.\nI also strongly believe that the Gaza Strip, which has been a symbol of death and destruction for so many decades and so bad for the people anywhere near it, and especially those who live there—and frankly, who's been really very unlucky—it's been very unlucky; it's been an unlucky place for a long time—being in its presence just has not been good, and it should not go through a process of rebuilding and occupation by the same people that have really stood there and fought for it and lived there and died there and lived a miserable existence there.\nInstead, we should go to other countries of interest with humanitarian hearts—and there are many of them that want to do this—and build various domains that will ultimately be occupied by the 1.8 million Palestinians living in Gaza, ending the death and destruction and, frankly, bad luck.\nThis could be paid for by neighboring countries of great wealth. It could be 1, 2, 3, 4, 5, 7, 8, 12. It could be numerous sites, or it could be one large site. But the people will be able to live in comfort and peace, and we'll get sure—we'll make sure something really spectacular is done. They're going to have peace. They're not going to be shot at and killed and destroyed like this civilization of wonderful people has had to endure.\nThe only reason the Palestinians want to go back to Gaza is, they have no alternative. It's right now a demolition site. This is just a demolition site. Virtually, every building is down. They're living under fallen concrete that's very dangerous and very precarious.\nThey instead can occupy all of a beautiful area with homes and safety, and they can live out their lives in peace and harmony, instead of having to go back and do it again.\nThe U.S. will take over the Gaza Strip, and we will do a job with it too. We'll own it and be responsible for dismantling all of the dangerous unexploded bombs and other weapons on the site, level the site, and get rid of the destroyed buildings. Level it out, create an economic development that will supply unlimited numbers of jobs and housing for the people of the area. Do a real job. Do something different.\nJust can't go back. If you go back, it's going to end up the same way it has for a hundred years. I'm hopeful that this cease-fire could be the beginning of a larger and more enduring peace that will end the bloodshed and killing once and for all.\nWith the same goal in mind, my administration has been moving quickly to restore trust in the alliance and rebuild American strength throughout the region, and we've really done that. We're a respected nation again. A lot has happened in the last couple of weeks. We are actually a—we're very respected nation again.\nI ended the last administration's de facto arms embargo on over $1 billion in military assistance for Israel. And I'm also pleased to announce that this afternoon, the United States withdrew from the anti-Semitic U.N. Human Rights Council and ended all of the support for the U.N. Relief and Works Agency, which funneled money to Hamas and which was very disloyal to humanity.\nToday I also took action to restore a maximum-pressure policy on the Iranian regime. And we will once again enforce the most aggressive possible sanctions, drive Iranian oil exports to zero, and diminish the regime's capacity to fund terror throughout the region and throughout the world.\nWe had no threat when I left office. Iran was not able to sell oil. Nobody was buying oil because I said: \"Don't buy it. If you buy it, you're not doing any business with the United States.\" And Hamas was not being funded. Hizballah was not being funded. Nobody was being funded. There would never have been an October 7.\nTwo weeks ago, I once again designated the Houthis as a terrorist organization. They're trying to destroy world shipping lanes, and that's not going to happen. And over the weekend, I ordered air strikes against senior ISIS leaders hiding in the caves of Somalia and took them out.\nHere in America, we've begun the process of deporting foreign terrorists, jihadists, and Hamas sympathizers from our soil, just as we have people that are extremely evil, and we're sending them out of our country. They came from jails, they came from mental institutions and insane asylums, and they were dumped into our country. They're gang members. We're getting them out at numbers that nobody can actually believe.\nAnd every single country is taking those people back. They said they would never take them back, and they're all taking them back. And they're taking them back very gladly.\nAnd I recently signed an executive order combating the vile wave of anti-Semitism that we've seen in the aftermath of the October 7 attacks.\nTogether, America and Israel will renew the optimism that shined so brightly just four years ago. It was really a bright, beautiful light. We will restore calm and stability to the region and expand prosperity, opportunity, and hope to our nations and for all people of the Middle East, including the Arab and Muslim nations. Very important. We want the Arab and Muslim nations to have peace and have tranquility and have great lives.\nI'd like to now invite Prime Minister Netanyahu to say a few words, and we'll take some questions afterwards.\nThank you very much.\nPrime Minister Netanyahu. Thank you, Mr. President.\nI'm honored that you invited me to be the first foreign leader to visit the White House in your second term. This is a testament to your friendship and support for the Jewish state and the Jewish people.\nI've said this before; I'll say it again: You are the greatest friend Israel has ever had in the White House. And that's why the people of Israel have such enormous respect for you.\nIn your first term, you recognized Jerusalem as Israel's capital. You moved the American Embassy there. You recognized Israel's sovereignty over the Golan Heights.\nYou withdrew from the disastrous Iran nuclear deal. I remember we spoke about it. You said, \"This is the worst deal I've ever seen. I'm elected, I'm walking out of it.\" That's exactly what you did, and I think it speaks loudly for just common sense, just looking at things and seeing them as they are.\nAnd of course, you also brokered the groundbreaking Abraham Accords, in which Israel made peace with four Arab states. You did this in four months. Nothing happened for a quarter of a century, but in four months, we were able—working together, under your leadership—to have four historic peace accords.\nAnd now—now, in the first days of your second term—you picked up right where you left off. Your leadership helped bring our hostages home—among them, American citizens. You freed up munitions that have been withheld from Israel. They had been withheld from Israel in the midst of a seven-front war for our existence, and you just freed it.\nYou ended unjust sanctions against law-abiding Israeli citizens. You boldly confronted the scourge of anti-Semitism. You stopped funding, as you just said, international organizations, like UNRWA, that support and fund terrorists. And today you renewed the maximum pressure campaign against Iran.\nLadies and gentlemen, all this in just 2 weeks. Can we imagine where we'll be in four years? I can. I know you can, Mr. President.\nFor our part, we in Israel have been pretty busy too. Since the horrendous October 7 attack, we've been fighting our common enemies and changing the face of the Middle East.\nOn that infamous day, Hamas monsters savagely murdered 1,200 innocent people, including more than 40 Americans. They beheaded men, they raped women, they burnt babies alive, and they took 251 people hostage to the dungeons of Gaza.\nAnd after this worst attack on Jews since the Holocaust, Iran and its henchmen in the Middle East were absolutely ecstatic. Haniyeh praised the massacre. Sinwar said that Israel was finished. Nasrallah boasted that Israel was—here's what he said—\"is feeble as a spider's web.\"\nWell, Mr. President, Haniyeh is gone. Sinwar is gone. Nasrallah is gone. We've devastated Hamas, we decimated Hizballah, we destroyed Asad's remaining armaments, and we crippled Iran's air defenses.\nAnd in doing this, we've defeated some of America's worst enemies. We took out terrorists who were wanted for decades for shedding rivers of American blood, including the blood of 241 marines murdered in Beirut.\nWe accomplished all this with the indomitable spirit of our people and the boundless courage of our soldiers. The Bible says that the people of Israel shall rise like lions, and, boy, did we rise. Today, the roar of the Lion of Judah is heard loudly throughout the Middle East. Israel has never been stronger, and the Iran terror axis has never been weaker.\nBut as we discussed, Mr. President, to secure our future and bring peace to our region, we have to finish the job.\nIn Gaza, Israel has three goals: destroy Hamas's military and governing capabilities, secure the release of all of our hostages, and ensure that Gaza never again poses a threat to Israel.\nI believe, Mr. President, that your willingness to puncture conventional thinking—thinking that has failed time and time and time again—your willingness to think outside the box with fresh ideas will help us achieve all these goals. And I've seen you do this many times. You cut to the chase. You see things others refuse to see. You say things others refuse to say. You know, and after the jaws drop, people scratch their heads, and they say, \"You know, he's right.\"\nAnd this is the kind of thinking that enabled us to bring the Abraham Accords. This is the kind of thinking that will reshape the Middle East and bring peace.\nWe also see eye to eye on Iran. That's the same Iran that tried to kill us both. They tried to kill you, Mr. President. They tried, through their proxies, to kill me. But we're both committed to rolling back Iran's aggression in the region and ensuring that Iran never develops a nuclear weapon.\nMr. President, ladies and gentlemen, Israel will end the war by winning the war. Israel's victory will be America's victory. We will not only win the war; working together, we will win the peace.\nWith your leadership, Mr. President, and our partnership, I believe that we will forge a brilliant future for our region and bring our great alliance to even greater heights.\nThank you.\nPresident Trump. Thank you very much, Bibi. Very nice. Thank you.\nAnd J.D. Vance, everybody. J.D., please. Vice President, stand up. He's been doing a good job. He's been working very hard on all things, but this in particular.\nWe'll take some questions, please.\n[At this point, several reporters began speaking at once.]\nYes, ma'am. Go ahead, please. Go ahead.\nYes, go ahead.\nSaudi Arabia/Gaza, Palestinian Territories\nQ.Mr. President, can a normalization deal with Saudi Arabia be achieved without the acknowledgment of a Palestinian state? That question for you too, Mr. Prime Minister.\nAnd, Mr. President, given what you've said about Gaza, should the U.S. send troops to help secure the security vacuum?\nPresident Trump. So Saudi Arabia is going to be very helpful, and they have been very helpful. They want peace in the Middle East. It's very simple. We know their leader and their leaders very well. They're wonderful people, and they want peace in the Middle East.\nAs far as Gaza is concerned, we'll do what is necessary. If it's necessary, we'll do that. We're going to take over that piece, and we're going to develop it, create thousands and thousands of jobs, and it will be something that the entire Middle East can be very proud of.\nBut everybody feels that continuing the same process that's gone on forever, over and over again, and then it starts, and then the killing starts, and all of the other problems start, and you end up in the same place, and we don't want to see that happen.\nSo, by the United States, with its stability and strength, owning it—especially the strength that we're developing and developed over the last fairly short period of time—I would say, really since the election—I think we'll be a great keeper of something that is very, very strong, very powerful, and very, very good for the area—not just for Israel, for the entire Middle East—very important.\nAnd we'll, again, have thousands of jobs. And there will be jobs for everyone, not for a specific group of people, but for everybody.\nOkay, please.\nPrime Minister Netanyahu. I think peace between Israel and Saudi Arabia is not only feasible, I think it's going to happen. I think if we had another half a year in your first term, it would have already happened.\nPresident Trump. It's true—many, many more. I agree, many more nations.\nPrime Minister Netanyahu. It would have happened.\nI think you can't prejudge and preguess how we'll achieve it, but I'm committed to achieving it, and I know the President is committed to achieving it, and I think the Saudi leadership is interested to achieve it. So we'll give it a good shot, and I think we'll succeed.\nQ.President Trump?\nPresident Trump. Yes, please, go ahead.\nCease-Fire and Hostage-Release Deal Between Israel and Hamas\nQ.First of all, President Trump, did you hear from Prime Minister Netanyahu in your meeting a guarantee that the cease-fire will hold, including phase two?\nAnd, Prime Minister Netanyahu, a question for you. Why are you refusing to set up a national commission to investigate the failures of October 7? Thank you.\nPresident Trump. Well, I can't tell you whether or not the cease-fire will hold. We've done, I think, a very masterful job. And we weren't helped very much by the Biden administration, I can tell you that.\nBut we've gotten quite a few hostages out. We're going to get more out. But we're dealing with very complex people, and we are going to see whether or not it holds. We certainly want to have more come out. They've come out damaged—in many ways, damaged—very damaged people, but they're going to get better, and they're going to be strong, and they're going to have a good life. And we hope to get as many as possible out.\nWhether or not it holds, I don't know. We hope it holds. We hope it holds.\nPrime Minister Netanyahu. I think that at the appropriate time, which I think will enable us to really investigate what happened, what were the causes of the failures, by an independent commission that will be accepted by the majority of the people. We don't want it accepted by one half of the people and not the other. I think we should have it, and we should find out exactly what happened. I'm insisting on it. And believe me, it will surprise a lot of people when it happens.\n[Several reporters spoke at once.]\nPresident Trump. Kelly [Kelly O'Donnell, NBC News]. Kelly, go ahead, please.\nQ.Mr. President, you are outlining something that is really quite striking tonight. You are talking about—\n[A White House aide offered a microphone to Ms. O'Donnell.]\nWhite House aide. I've got to hold onto it.\nGaza, Palestinian Territories\nQ.Okay.\nThank you, Mr. President and Mr. Prime Minister. You are talking tonight about the United States taking over a sovereign territory. What authority would allow you to do that? Are you talking about a permanent occupation there, redevelopment?\nAnd, Mr. Prime Minister, do you see this idea as a way to expand the boundaries of Israel and to have a longer peace, even though the Israeli people know how important that land is to you and your citizens, just as the space is inherited by the Palestinians as well?\nPresident Trump. I do see a long-term ownership position, and I see it bringing great stability to that part of the Middle East, and maybe the entire Middle East. And everybody I've spoken to—this was not a decision made lightly. Everybody I've spoken to loves the idea of the United States owning that piece of land, developing and creating thousands of jobs with something that will be magnificent in a really magnificent area that nobody would know. Nobody can look because all they see is death and destruction and rubble and demolished buildings falling all over. It's just a terrible sight.\nQ.By—by what mechanism——\nPresident Trump. I've studied it——\nQ. ——on the world stage, Mr. President?\nPresident Trump. I've studied this very closely over a lot of months, and I've seen it from every different angle. And it's a very, very dangerous place to be, and it's only going to get worse.\nAnd I think this is an idea that's gotten tremendous—and I'm talking about from the highest level of leadership—gotten tremendous praise. And if the United States can help to bring stability and peace in the Middle East, we'll do that.\nBibi.\nQ.Mr. Prime Minister, please. Mr. Prime Minister.\nPrime Minister Netanyahu. I mentioned again tonight our three goals, and the third goal is to make sure that Gaza never poses a threat to Israel again.\nPresident Trump is taking it to a much higher level. He sees a different——\nQ.So you support his idea, sir?\nPrime Minister Netanyahu. He sees a different future for that piece of land that has been the focus of so much terrorism, so much—so many attacks against us, so many trials and so many tribulations.\nHe has a different idea, and I think it worth—it's worth paying attention to this. We're talking about it. He's exploring it with his people, with his staff. I think it's something that could change history, and it's worthwhile really pursuing this avenue.\n[Several reporters spoke at once.]\nQ.Mr. President.\nPresident Trump. Yes, please, go ahead. Go ahead.\nQ.Mr. President, a question for you. Can you hear me?\nPresident Trump. Yes.\nGaza, Palestinian Territories/Status of Palestinian Refugees\nQ.So, before rebuilding Gaza again, obviously, you'll take out all the hostages, and one of them is Edan Alexander, an American soldier who is alive. How will you be assured that you will take out all the hostages and then rebuild?\nPresident Trump. We're working very hard to get all the hostages. The word is \"all,\" and we are working very hard. So far, it's been moving along fairly rapidly, pretty much on schedule. It's—I'd love to have them all out at one time, but we're taking them out.\nAnd tomorrow, more are being released, and over the days more, and then we'll go into a phase two. But we'd like to get all of the hostages.\nQ.How much time you think it will—[inaudible]?\nPresident Trump. And if we don't, it will just make us somewhat more violent, I will tell you that, because they would have broken their word.\nMr. Witkoff and his entire group have been working 24 hours, around the clock, and they want them out. And promises have been made to them, and we'll see whether or not those promises will be kept.\nBut we want all the hostages. That's right.\nQ.How much time you think it will take? A month?\n[Several reporters spoke at once.]\nGaza/West Bank\nQ.Do you support—Mr. President, do you support Israeli sovereignty in Judea and Samaria areas, which many believe is the biblical homeland of the Jewish people?\nPresident Trump. Well, we're discussing that with many of your representatives. You're represented very well, and people do like the idea, but we haven't taken a position on it yet, but we will be—we'll be making an announcement probably on that very specific topic over the next 4 weeks.\n[Several reporters spoke at once.]\nGo ahead, please. Please.\nQ.Mr. President—thank you so much, Mr. President. So, you—you just—\n[A White House aide held up a microphone.]\nWhite House aide. I've got to hold onto it, but you can speak into it.\nStatus of Palestinian Refugees/Gaza\nQ.You just said that you think all—all the Palestinians should be relocated to other countries. Does that mean that you do not support a two-state solution?\nPresident Trump. It doesn't mean anything about a two-state or a one-state or any other state. It means that we want to have—we want to give people a chance at life. They have never had a chance at life because the Gaza Strip has been a hellhole for people living there. It's been horrible. The Hamas has made it so bad—so bad, so dangerous, so unfair to people.\nAnd by doing what I'm recommending that we do, it's a recommendation—a very strong recommendation—but it is a strong recommendation—by doing that, we think we're going to bring perhaps great peace to long beyond this area.\nAnd I have to stress, this is not for Israel. This is for everybody in the Middle East—Arabs, Muslims. This is for everybody. This would be where they can partake in terms of jobs and living and all of the other benefits. And I think it's very important.\nIt just doesn't work the other way. You know, you can't keep trying. They just—has been going along for so many decades, you can't even count. You just can't keep doing—you have to learn from history. You can't keep doing the same mistake over and over again.\nGaza is a hellhole right now. It was before the bombing started, frankly, and we're going to give people a chance to live in a beautiful community that's safe and secure. And I think you're going to see tremendous—a tremendous outflowing of support.\nI can tell you, I spoke to other leaders of countries in the Middle East, and they love the idea. They say it would really bring stability, and what we need is stability.\nYes, sir, please.\n[Several reporters spoke at once.]\nGo ahead.\nQ.Thank you. Are you still committed to imposing sanctions on the ICC, despite the move being stalled in the Senate?\nAnd, please, a question for the Prime Minister as well. The President has been very clear about his desire to achieve a deal with Saudi Arabia. How do you settle this if Israel is required to renew the war against Hamas in the future?\nPresident Trump. Go ahead, Bibi.\nPrime Minister Netanyahu. I think everybody understands that, just as the president fought and defeated Al Qaida and ISIS, that we can't leave Hamas there, because Hamas will continue the battle to destroy Israel.\nThey'll do—you know, when—in this temporary cease-fire, one of their leaders comes out. You know what he says? \"We're going to do October 7 again, except we'll do it bigger.\" So, obviously, you can't talk about peace—neither with Hamas or in the Middle East—if this, you know, toxic, murderous organization is left standing any more than you could make peace in Europe after World War II if the Nazi regime was left standing and the Nazi army was left standing.\nYou want a different future? You've got to knock out the people who want to destroy you and destroy peace. That's what we're going to do. I think that will also bring—usher in, actually, the peace with Saudi Arabia and with others. And I think there will be others too.\nPresident Trump. Yes, ma'am. Go ahead.\nAfghanistan\nQ.Mr. President, I'm from Afghanistan. My name is Nazira Karimi [Ariana Television Network]. Afghan—[inaudible]—woman has a high expectation from you. Do you have any plan to change Afghanistan's situation? Are you able to recognize Taliban? Because I'm an Afghan journalist. Afghan—[inaudible]—suffer women. Any comment about Afghanistan? What's your future plan for the Afghan people, especially Afghan woman? Thank you very much.\nPresident Trump. I have a little hard time understanding you. Where are you from?\nQ.Afghanistan.\nQ.Afghanistan.\nQ.I am from Afghanistan.\nPresident Trump. Oh, actually, it's a beautiful voice and a beautiful accent. The only problem is, I can't understand a word you're saying. [Laughter]\nQ.Mr. President——\nQ.Mr. President, I said——\nPresident Trump. But—but I just say this: Good luck. Live in peace.\nQ. ——what's your plan for Afghanistan?\n[Several reporters spoke at once.]\nPresident Trump. Go ahead, please.\nIran/U.S. Sanctions\nQ.Thank you. Thank you, Mr. President——\nPresident Trump. That's okay. Yes, please.\nQ. ——and Prime Minister. You said earlier today that it was tough for you to implement these sanctions on Iran, but you did indicate that you were willing to negotiate with them. What would that look like, and are you in conversations with them?\nPresident Trump. Yes.\nQ.And the same for the Prime Minister, sir.\nPresident Trump. I hated doing it. I want Iran to be peaceful and successful. I hated doing it. I did it once before, and we brought them down to a level where they were unable to give any money. They had to survive themselves, and they had no money. They were essentially broke, and they had no money for, as I said, Hizballah. They had no money for Hamas. They had no money for any form of terror—the 28—if you call it, the 28 sites of terror. They had no money for any of it.\nThey had to do their own and focus on their own well-being. And I hated to do it then, and I hate it—I hate to do it just as much now.\nAnd I say this, and I say this to Iran, who is listening very intently: I would love to be able to make a great deal, a deal where you can get on with your lives, and you'll do wonderfully. You'll do wonderfully.\nIncredible people—industrious, beautiful, just an unbelievable group of people in Iran. And I know them well. I have many friends from Iran and many friends that are Americans from Iran, and they're very proud of Iran.\nBut I hated to do it, just so you understand. And I hope we're going to be able to do something so that it doesn't end up in a very catastrophic situation. I don't want to see that happen. I want to see——\n[Several reporters spoke at once.]\nI really want to see peace, and I hope that we're able to do that.\nThey cannot have a nuclear weapon. It's very simple. I'm not putting restrictions. I'm not—they cannot have—one thing: They cannot have a nuclear weapon.\nAnd if I think that they will have a nuclear weapon, despite what I just said, that—I think that's going to be very unfortunate for them.\nIf, on the other hand, they can convince us that they won't, and I hope they can—it's very easy to do; it's actually very easy to do—I think they're going to have an unbelievable future.\nYes, please. Sir, go ahead.\nUkraine/Russia\nQ.Thank you, Mr. President. You just laid out your plan for Gaza.\nPresident Trump. Yes.\nQ.Can you lay down your plan for Ukraine? And also——\nPresident Trump. For Ukraine?\nQ.For Ukraine, yes. You consider yourself a strong leader. You blamed your predecessor for letting Russia to take over Ukraine. Will you demand from Putin to get out of Ukraine—from sovereign territory of Ukraine?\nPresident Trump. So we're dealing right now on the subject—I don't want to spend a lot of time because we're here for another reason—but we are having very good talks, very constructive talks on Ukraine. And we're talking to the Russians. We're talking to the Ukrainian leadership.\nIt would have never happened. That would have never happened—it should have never happened. I get reports every week: the number of soldiers—mostly soldiers now. The cities have been largely demolished. You talk about a very sad sight to see.\nWe talk Gaza. Well, many of these cities look as bad as Gaza and worse—what's happened to them—and I want to see that end.\nAnd I want to see it end for one simple reason: the life of young people being absolutely obliterated on both sides. You probably have 700,000 Ukrainian soldiers dead, 800,000—maybe more—Russian soldiers dead. It's very flat land, and the only thing that's going to stop a bullet is a human body—in this case, usually soldiers.\nAnd the numbers are staggering, when you hear the real numbers in Ukraine, what the numbers are, and this doesn't include the cities that have been demolished and all of the people that were killed. So I want to see it stopped.\nWe're having very good talks, and I think we're going to get it. I think something will be, hopefully, dramatically—it will—it will rise above everything. You have to. You can't let this continue. You can't—this is an absolute slaughter that's taking place on the beautiful farmlands of Ukraine, and we have to stop it. We can't let this continue.\n[Several reporters spoke at once.]\nIt's a human—it's a human—it is a human tragedy, and we're going to try very hard to stop it.\n[Several reporters spoke at once.]\nYes, please. Go ahead, sir. Go ahead.\nQ.Mr. President——\n[A White House aide held up a microphone.]\nSorry. Thank you very much.\nWhite House aide. [Inaudible]\nIran/Nuclear Weapons Development\nQ.Okay. Mr. President, what's your view about Palestinian leader Abbas role in all the regional changes you want to do?\nAnd a question for the Prime Minister. What's your view on President Trump wanting to reach a deal with Iran and offer a much more active military stance towards them?\nPresident Trump. Go ahead, Bibi. Go ahead.\nPrime Minister Netanyahu. I think the President just said something that I think is the pivot of everything that we're talking about. He said Iran cannot have a nuclear weapon, and we fully agree with that. If this goal can be achieved by a maximum pressure campaign, so be it, but I think the most important thing is to focus on the goal, which the president just did. And I fully agree with him.\n[Several reporters spoke at once.]\nPresident Trump. Well, I said it, and he said it very well. It's a—it's a campaign of pressure to see if we can get something done. He doesn't want to do what some people think will automatically happen, because they're very difficult people to deal with, as you know.\nBut if we could solve this problem without warfare, without all of the things that you've been witnessing over the last number of years, it would be—I think it would be a tremendous thing.\n[Several reporters spoke at once.]\nGo ahead, please.\nThe President's Travel Schedule\nQ.Do you have the plans to visit Israel soon? Do you have any plans to visit Israel soon?\nPresident Trump. To visit where?\nQ.Israel.\nQ.Israel, and Gaza too.\nPresident Trump. Oh, well, I love—I love Israel. I will visit there and I'll visit Gaza and I'll visit Saudi Arabia, and I'll visit other places all over the Middle East. The Middle East is an incredible place—so vibrant, so—it's just one of the really beautiful places and the—with great people.\nAnd I think a lot of bad leadership has taken place in the Middle East that's allowed this to happen. It's just terrible—and that includes on the American side, by the way. We should have never gone in there a long time ago, spent trillions of dollars, and created so much death, so—and that includes Americans.\nBut yes, I'll be visiting a lot of different places in the Middle East. I've been invited everywhere, but I will be visiting some. Yes.\nOkay.\n[Several reporters spoke at once.]\nLet's go.\nQ.Just to follow up——\nQ.Thank you, Mr. President—\nPresident Trump. Kaitlan [Kaitlan Collins, CNN], go ahead. Kaitlan.\nQ.Just to follow up—thank you so much, President Trump.\nQ.Thank you—oh——\nPresident Trump. Kaitlan, go ahead.\nQ.Just to follow up on—on what you were saying there about——\nPresident Trump. Say it? Go ahead, please.\nGaza/Status of Palestinian Refugees/Jordan/Egypt\nQ.Just to follow up on what you were saying about the Gazans leaving Gaza, going to other countries. One, where exactly are you suggesting that they should go? And two, are you saying they should return after it's rebuilt? And if not, who do you envision living there?\nPresident Trump. I envision world people living there—the world's people. I think you'll make that into an international, unbelievable place. I think the potential in the Gaza Strip is unbelievable. And I think the entire world—representatives from all over the world will be there, and they'll——\nQ.But not the Palestinians?\nPresident Trump. ——and they'll live there. Palestinians, also. Palestinians will live there. Many people will live there.\nBut they've tried the other, and they've tried it for decades and decades and decades. It's not going to work. It didn't work. It will never work. And you have to learn from history. History has—you know, you just can't let it keep repeating itself.\nWe have an opportunity to do something that could be phenomenal—and I don't want to be cute, I don't want to be a wise guy—but the Riviera of the Middle East. This could be something that could be so——\nQ.But where would those people go in the meantime, Mr. President?\nPresident Trump. ——this could be so magnificent.\nBut more importantly than that is the people that have been absolutely destroyed—that live there now—can live in peace in a much better situation, because they are living in hell. And those people will now be able to live in peace. We'll make sure that it's done world class. It will be wonderful for the people—Palestinians——\nQ.But they'll want to know where you want them to go in the meantime.\nPresident Trump. ——Palestinians, mostly, we're talking about. And I have a feeling that—despite them saying no, I have a feeling that the King in Jordan and the general, President—but that the general in Egypt will open their hearts and will give us the kind of land that we need to get this done, and people can live in harmony and in peace.\nThank you all very much.\n[Several reporters spoke at once.]\nThank you. Thank you very much. Thank you.", "Link": "https://www.presidency.ucsb.edu/documents/the-presidents-news-conference-with-prime-minister-benjamin-netanyahu-israel-0"}
{"Title": "The President's News Conference With Prime Minister Shigeru Ishiba of Japan", "Date": "2025-02-07", "Text": "President Trump. Thank you very much.\nThank you very much. It's a great honor to be with the Prime Minister. We had a picture taken a little while ago. And it was so nice, I thought I'd present it to you on stage, and here's the picture.\nAudience member.Ahh.\nPresident Trump. I wish I was as handsome as him, but I'm not. [Laughter]\n[At this point, the President gave the Prime Minister a photograph.]\nPrime Minister Ishiba. Thank you.\n[The President gave the Prime Minister a book.]\nOkay, thank you. Beautiful.\nPresident Trump. We remember that day.\nThank you very much, everybody. Appreciate it.\nI'm delighted to welcome Japanese Prime Minister Ishiba Shigeru to the White House for the first time. And, Prime Minister, it's an honor to have you with us, a great honor. Japan is a great country. Thank you very much.\nJapan is strong and proud. It's a nation that is home to one of the great civilizations in the history of the world. For nearly 80 years, the American-Japanese people have enjoyed a friendship like few others—we've had a great friendship—across a vast ocean. And we found ourselves united by bonds of history, commerce, culture, mutual admiration, and great respect.\nAfter our meeting today, I'm confident that the cherished alliances between our two countries—and others, also—will continue to flourish long and into the future.\nThe military cooperation between the United States and Japan is one of our closest security partnerships, and it's one of the closest we have anywhere in the world. Our servicemembers work together every day to defend our common interests.\nJapan has committed to double its defense spending by 2027, compared to my first term. They've invested a lot of money because of my first term. We worked on that very hard with Shinzo—you know, the great Shinzo Abe. And we look forward to seeing even more so. Shinzo and I worked very, very long and hard, and those numbers are very reflective, after my first term. And now they're going up very substantially based on our conversations today.\nIn addition to being vital for our shared security, Japan is one of the top purchasers of U.S. military exports and equipment. And I'm pleased to say that, this week, my administration approved nearly a billion dollars in foreign military sales to Tokyo.\nThe United States is totally committed to the security of Japan. We will extend the full strength of American deterrence capabilities in defense of our friend and ally, hundred percent.\nIn the years to come, the Prime Minister and I will be working closely together to maintain peace and security—and I also say peace through strength—and all over the Indo-Pacific. And to that end, we also remain committed to the effort I began in my first term to ensure safety and stability on the Korean Peninsula.\nPrime Minister Ishiba and I spoke long and hard about a vital economic relationship between our two countries and the continuance of that relationship. The United States and Japan trade over $300 billion in goods and services each year. Japan has invested nearly $800 billion—and that's going to go up very, very substantially in the coming months—more than any other country.\nAnd they're going to have some competition. We have a lot of people coming in and investing in the United States. I think our—the feeling throughout the world has never been stronger about this country.\nAs a result of our victory in 2024, the Presidential election, the Japanese investment and technology giant SoftBank announced plans to invest between $100 and $200 billion. We have many other companies investing that number, higher than that number. Some, a little bit less. But we have trillions of dollars of investment pouring into our country now that you didn't have just a short while ago.\nToday our teams discussed how our two Nations can do even more to stay on the cutting edge of artificial intelligence, along with the quantum computing, semiconductors, and other critical technologies—and they're coming out. The problem with technology, that kind: It's obsolete in about 2 days, so we have to start all over again. Doesn't last long.\nWe agreed to cooperate even more closely to combat the Chinese economic aggression, which is quite aggressive.\nI'm also pleased to announce that Japan will soon begin importing historic new shipments of clean American liquefied natural gas in record numbers. It will be record numbers.\nWith our Secretary of the Interior, we were talking—I think Doug is here. Hello, Doug. Please stand up, Doug. Doug Burgum, everybody.\nWe're talking about the pipeline in Alaska, which is the closest point of major oil and gas to Japan by far, less than half the distance of any other location. We're talking about a joint venture of some type between Japan and us, having to do with Alaska oil and gas, and that's very exciting. They're very excited about it. So are we.\nAs we deepen our economic relationship, I made clear that the United States will be conducting trade with all countries based on the principle of fairness and reciprocity. Chronic trade deficits not only undermine our economy—they really do, and we're going to get rid of the trade—we have a trade deficit with Japan of over $100 billion. But we're going to work that out, and I think very quickly. Frankly, we can do it just on oil and gas. We can work it out. So we intend to do it very quickly. We both understand that.\nAnd as America welcomes new foreign investment, we also want to ensure that companies build their products and factories here in America, not simply by the assets that we have.\nAnd Japan is going to be opening up auto plants. New auto plants are being built, currently as we speak. They've just been started. Toyota is one, and Nissan is going to be doing something very exciting about—about U.S. Steel. They'll be looking at an investment rather than a purchase.\nWe didn't like the idea. U.S. Steel is a very important company to us. It was the greatest company in the world for 15 years many years ago—80 years ago—and we didn't want to see that leave. And it wouldn't actually leave, but the concept—psychologically, not good.\nSo they've agreed to invest heavily in U.S. Steel, as opposed to own it. And that sounds very exciting. And we're going to meet with Nissan next week, the head of Nissan—a very great company—and they'll work out the details. I'll help. I'll be there to mediate and arbitrate.\nAnd I had the privilege of working closely with the great Prime Minister—as you know, and you knew him very well—Shinzo Abe, the longest serving Prime Minister in Japan's history. Likewise, I expect that this Prime Minister is going to be a great one.\nI really believe that. He's going to be a great one. I've gotten to know him for not long, but I can see what they have. He's got—he's got the qualities of greatness. He's going to do a fantastic job for Japan and for the Japanese people.\nAnd I'd like now to invite the Prime Minister to say a few words, and then we'll take some questions.\nMr. Prime Minister, thank you. Thank you very much.\nPrime Minister Ishiba. Mr. President Trump, I would like to sincerely thank you for inviting me to the White House today immediately following your Inauguration. I also thank you for your very warm hospitality.\nI have come to Washington, DC, with the hope of having a face-to-face meeting and deepening our mutual understanding at this early date with President Trump, who is now leading the United States, the most important country for Japan's diplomacy and security, and aligning our perspectives and visions that Japan and the United States should pursue.\nWhat should we do to advance the national interests of both of our countries in synergy and to realize peace and prosperity in the Indo-Pacific? I am convinced that the answer lies in further strengthening the strong and unwavering Japan-U.S. alliance to achieve a free and open Indo-Pacific.\nPresident and I concurred to strengthen the deterrence and response capabilities of the alliance and to work closely in addressing strategic challenges that both countries are facing in this region.\nI conveyed to the President that Japan, as an ally of the United States, is ready to share responsibilities and to play its own role. I also reiterated Japan's unwavering commitment to fundamentally reinforcing its defense capabilities, and we confirmed the unwavering commitment by the United States to the defense of Japan.\nWe reaffirmed that Article V of the Japan-U.S. Treaty of Mutual Cooperation and Security applies to the Senkaku Islands.\nWith half of the world's population and approximately 60 percent of the world's GDP, the Indo-Pacific serves as the engine of growth and vitality for Japan, the United States, and the world.\nPresident and I also concurred that the United States and Japan will make further efforts in a wide range of areas, working hand in hand together to realize a free and open Indo-Pacific.\nIn this context, we also concurred to further advance cooperation of the multi-layered networks of the like-minded countries, including the Quad and trilateral cooperation with the Republic of Korea and the Philippines.\nWe also discussed Japan-United States cooperation to bring about growth and prosperity. Economic cooperation, including on economic security, is important from the perspective of strengthening alliance cooperation.\nJapan is the closest economic partner of the United States and has been the world's largest investor in the United States for 5 consecutive years.\nAlso, with the inauguration of President Trump, the momentum for Japanese companies to invest in the United States is growing even stronger.\nToday I conveyed my willingness to cooperate together to elevate Japan's investment in the United States to an unprecedented amount of $1 trillion.\nPresident Trump and myself also concurred to elevate the Japan-U.S. partnership to an even higher level through improving business environment and increasing bilateral investment in employment; strengthening each other's industries; leading the world in developing advanced technologies, such as AI and leading-edge semiconductors; and strongly promoting efforts to harness the energy of the growing market in the Indo-Pacific region.\nWe also confirmed that we will cooperate to strengthen energy security between the two countries, including increasing exports of United States liquefied natural gas to Japan in a mutually beneficial manner. Regarding foreign exchange, as in the first Trump administration, close discussions will continue between Japanese and the U.S. Finance Ministers, who are experts in this field.\nWe also held candid discussions on challenges the Indo-Pacific region is facing. We confirmed that we are resolved not to allow unilateral attempts to change the status quo by force or coercion, and to oppose such attempts in the East and South China Seas in order to fully defend a free and open Indo-Pacific. We also reiterated the importance of peace and stability across the Taiwan Strait.\nRegarding North Korea, we affirmed the need to address its nuclear and missile program, which poses a serious threat to Japan, the U.S., and beyond, and that Japan and the U.S. will work together toward the complete denuclearization of North Korea.\nAs the abductees and their families continued to age, I conveyed my strong sense of urgency and determination directly to President Trump and gained his renewed strong support for the immediate resolution of the abductions issue.\nWhile this was my first face-to-face meeting with President Trump, we were able to openly and frankly exchange views, and our meeting turned out to be very productive and meaningful.\nAs a result of today's meeting, which marked a new departure for the Japan-U.S. relations, we are issuing a Japan-U.S. joint leaders' statement. This document will serve as a compass for further cooperation between our two countries.\nOn the basis of these deliverables, I look forward to working together with President Trump, who I respect immensely, to usher in a new golden age of Japan-U.S. relations. I look forward to welcoming you to Japan, and I am very excited about that prospect.\nThank you, Mr. President.\nPresident Trump. Thank you very much. Thank you.\nAny questions, please? Peter [Peter Doocy, Fox News].\nWhite House Senior Adviser Elon R. Musk\nQ.President Trump, I have two on DOGE. Elon Musk said today, \"I love Donald Trump as much as a straight man can love another man.\" [Laughter] What does the First Lady think about that?\nPresident Trump. Oh, I think she'll be okay with it somehow. [Laughter]\nGovernment Payment Systems/Department of Education/Efforts To Reduce Government Waste\nQ.So Democratic lawmakers are really upset that DOGE engineers have access to these Treasury payment systems. The Senate intel Dems wrote a letter to Susie Wiles. They're saying that these systems are used to disperse trillions of dollars each year and contain everyday Americans' personal information, like Social Security numbers, home addresses, bank accounts. Why does DOGE need all of that stuff?\nPresident Trump. Well, it doesn't, but they get it very easily. I mean, we don't have very good security in our country, and they get it very easily. And what we're doing, if you look at what has just taken place with respect to some of the investments that have been made on another agency that people have been talking about for years, but nobody did anything about it, it's absolutely obscene—dangerous, bad, very costly.\nI mean, virtually every investment made is a con job. There's nothing of value to anybody, unless there's a kickback scheme going on, which is possible.\nAnd we're going to be doing more and more and more of that. We're going to be looking at Department of Education. We're going to be looking at even our military. We're going to be looking at tremendous amounts of money, Peter, being spent on things that bear no relationship to anything and have no value.\nWe're talking about trillions of dollars. It will be, in the end, trillions of dollars being absolutely wasted and perhaps illegally—I would say, certainly, in many cases, illegally—but perhaps illegally overall.\nAnd I'm very proud of the job that this group of young people—generally, young people, but very smart people—they're doing. They're doing it at my insistence. It would be a lot easier not to do it, but we have to take some of these things apart to find the corruption. And we've found tremendous corruption.\nEducation/School Choice Programs\nQ.You mentioned the Department of Education. What did you think when you saw Democratic lawmakers trying to get into the Department of Education earlier today?\nPresident Trump. Oh, I see the same ones. I see Maxine Waters, a lowlife. I see, you know, all these people. They don't—they don't love our country. They don't love our country. We want great education.\nSo they rank 40 countries in education. We're ranked dead last—dead last. But the good news is we're number one in one category. You know what that is? Cost per pupil. We spend more per pupil than on—any other country in the world. You look at Norway, Denmark, Sweden, various countries all up and down—Finland—China does very well in education—and then you look at us. We spend much more money than they do per pupil—or any other way, but we spend much more money than they do. And yet we're ranked, this year, last—Biden's last year—congratulations, Joe—we're ranked dead last.\nSo what I want to see is education. Number one, I like choice. We all like choice. But beyond choice—long beyond choice, I want to see it go back to the States, where great States that do so well—have no debt, they're operated brilliantly—they'll be as good as Norway or Denmark or Sweden or any of the other highly ranked countries. They'll be—you'll probably have 30—I figure 35 to 38 States will be right at the top, and the rest will come along. They'll have to come along, competitively.\nAnd by the way, we'll be spending a lot less money, and we'll have great education.\nQ.As part of this DOGE cost-cutting effort, one of the DOGE engineers was fired for some inappropriate posts. The Vice President says, \"Bring him back.\" What do you say?\nPresident Trump. Well, I don't know about the particular thing, but if the Vice President said that—did you say that?\nVice President James D. \"J.D.\" Vance. I did say that.\nPresident Trump. I'm with the Vice President. [Laughter]\nThank you, Peter.\n[Several reporters began speaking at once.]\nYes. Go ahead, please. Yes, red dress.\nU.S. Military Readiness/Secretary of Defense Peter B. Hegseth\nQ.Red dress? Thank you so much, President. Thank you. Just how strong do you want Japan's military to be? And do you specifically hope that their increased military spending will deter China and North Korea? What did you talk about that with—today?\nPresident Trump. Well, I want our military to be the strongest. I also don't mind spending so much money on the military, because we build it here. It's made in the U.S.A. All made in the U.S.A.\nWe have—you know, I rebuilt our military during my first term. Did a great job. We left some of it behind in Afghanistan, stupidly. There was no reason for that. But it was still—as much as it was—it was billions and billions of dollars, but it was a small part of it.\nBut we're going to have the strongest military by far. We have great people. I want to congratulate Pete Hegseth for having gone through the gauntlet. He went through a lot, but he got through, and he's going to be a tremendous—I have no doubt he's going to be a tremendous leader. And other of the leaders sitting here, they're—in their own fields, they're going to—we're going to do something very—very great, and we expect great things.\nBut I expect the strongest military, by far, in the world—far stronger than China, far stronger than anybody, and that's the way it is.\nThank you very much.\nQ.Mr. President.\nPresident Trump. Would you like to ask a question? Please. Go ahead.\nQ.Thank you, Mr. President.\nPresident Trump. Thank you.\nQ.This is Hiramoto from Nippon Television. My question—two—let me ask two quick questions.\nPresident Trump. Sure.\nJapan-U.S. Relations/U.S. Trade Policy\nQ.First, this is the first meeting between Mr. President and Mr. Prime Minister Ishiba. So what kind of impression do you have on him?\nAnd, number two, do you have an idea or do you have a plan to impose tariff against Japan so far?\nThank you.\nPresident Trump. I think that he is going to be a great Prime Minister. I think he's a very strong man—very, very strong. I have great respect for him. I've known him for a long time, through a reputation. Shinzo Abe thought the world of him, and I think he's going to do a fantastic job as Prime Minister.\nA very strong person. I wish he wasn't so strong. [Laughter] I wish he was a little bit weaker than that, but that's what I got. [Laughter] I have to get strong guys all the time. He's going to be a great Prime Minister.\nI also—in terms of tariffs, I mean, we're going to have tariffs. Mostly reciprocal tariffs, where we go with—and I'm going to be probably meeting on that Monday or Tuesday—have an announcement, probably a news conference. But probably reciprocal tariffs, where a country pays so much or charges us so much, and we do the same.\nSo very reciprocal, because I think that's the only fair way to do it. That way, nobody is hurt. They charge us. We charge them. It's the same thing. And I seem to be going in that line, as opposed to a flat fee tariff.\nOkay.\nQ.[Inaudible]\nPresident Trump. Yes, go. Please. Please, go ahead. Why don't you go ahead?\nQ.This is Ota from Yomiuri Shimbun newspaper. I have a question for Prime Minister Ishiba. So this is your very first summit meeting. What was your impression of President Trump? Were you able to build a good relationship of trust and confidence?\nIn Northeast Asia, there are many challenges: China, North Korea, and so forth. And with President Trump, what did you appeal to him? And what kind of understanding were you able to obtain?\nOn the economic field, there is the acquisition of U.S. Steel by Nippon Steel. And there are expansion of import of LNG. What were the communication, discussion did you have with President Trump? For the $1 trillion of investment from Japan's investment, what was his reaction? What about your communication on tariff front?\nPrime Minister Ishiba. This is the first time that I met with President Trump in person. So this was the first time meeting face to face. But for many, many years, I have watched him on television. So it was quite exciting—I was so excited to see such a celebrity on television to see in person. On television, he is frightening—[laughter]—and he has the very strong personality.\nBut when I met with him actually, he was very sincere and very powerful and with strong will for the United States as for the whole world. I was able to feel that—this is not the sort of polishing or trying to suck up to him—for the world peace and for the regional stability that both of our countries need to play our role and make our endeavors and responsibility.\nAs for the increase of our defense expenditures, it is not that we are told by the United States to do so. Japan, on our own—on our own decision and on our own responsibility—we need to increase our defense expenditures. But of course, we need to communicate and consult with the United States. But the responsibility is with Japan, and the decision is with Japan.\nNow, on the tariffs—that if it is mutually beneficial, tariffs need to be set. And as for Japan, as Mr. President has introduced to us, an unprecedented investment will be made from Japan to the United States, and so many jobs will be created. So $1 trillion is the target. And this will be to the benefit of the United States, but also to the benefit of Japan as well. Investment is mutually beneficial.\nSo, be it with U.S. Steel, as Mr. President says, it is not acquisition. It is investment. So the Japanese technology will be provided, and the better quality products will be manufactured in the United States. And U.S. Steel will make products which will contribute not only to the United States and Japan, but also to the whole world.\nIt is not one-sided. It will be reciprocal. It will be mutually beneficial. And I believe we were able to share on this, and that is the biggest result that I have seen today.\n[Several reporters spoke at once.]\nPresident Trump. Thank you very much.\nGo ahead, please.\nQ.Me?\nPresident Trump. Yes.\nQ.Thank you. Thank you, Mr. President.\n[A White House aide held up a microphone.]\nOh, sorry.\nU.S. Steel Corporation\nEdward Lawrence from Fox Business. I wanted to ask you about that U.S. Steel deal. So you're saying that—is this a restructuring of the deal that's happening? And then, will you approve——\nPresident Trump. They're doing it as an investment, no longer a purchase.\nQ.Okay.\nPresident Trump. I didn't want it purchased, but investment I love.\nQ.And is that——\nPresident Trump. And they're going to do a big investment, subject to getting the deal done. And they'll be doing a big——\nQ.And that's something you would approve, where the U.S.——\nPresident Trump. I'm okay with that, sure.\nU.S. Trade Policy/Domestic Energy Production\nQ.And for the Prime Minister, what was your argument to the President related to U.S. Steel?\nAnd one more on tariffs, Mr. President, if I could. You said on tariffs that you'd like them to have—be reciprocal, back and forth. What was the reception from the Japanese Prime Minister when you said that or when you talked about it in your meeting?\nPresident Trump. Well, we didn't discuss tariffs too much. We really discussed many other things, including the pipeline in Alaska, which I think is going to be maybe the most exciting thing—with Doug and Chris. We discussed that at length, the pipeline. I mean, it seemed to be of great interest to them.\nIt's—we have potentially more oil and gas than in Saudi Arabia, just in Alaska. We have the most of any country in the world. It's a big asset for the United States, but we haven't used it.\nWe go to Venezuela, we go to other places to take oil and gas, and we have more than anybody. It's an amazing phenomenon that took place over the last 4 years. Nobody understands it, including the people that were in charge of it. They had no clue what they were doing. So it was a big problem.\nThey were surprised, actually, too. They were saying, \"Why? Why didn't they\"—They—they wouldn't sell them LNG. They wouldn't sell. Japan wanted to buy LNG, and Biden wouldn't sell it. And I'm trying to figure that one out. Maybe it was the environment.\nYou might answer that question. He's curious about that himself, I think.\nThank you very much.\nIf you want to answer that, you may—about LNG, that the United States wouldn't sell you LNG.\nPrime Minister Ishiba. That was a really unfortunate thing, but the current administration—I'm sorry, the previous administration was not allowing the LNG to be exported to us.\nI believe that President Trump, on the day of his Inauguration, allowed us to resume this importing. I think this is something that is really wonderful for us. And as the country of Japan, we are interested in importing not just LNG, but also bioethanol, ammonia, and other reasonable—other resources at a stable price, a reasonable price from the United States.\nAnd we also want to improve the trade deficit the U.S. has towards Japan. So, if we are able to buy those at a stable and reasonable price, I think it would be a wonderful situation. And, for that, I am very appreciative to President Trump. And we also look forward to LNG and hope that it's a success.\nPresident Trump. I want to just say that, on the ethanol, Iowa is going to be very happy. All of the—Nebraska, all of our farm States are going to be very happy. They want ethanol, and we'll be able to provide it. So our farmers—who I like, and they like me—I think they're going to be very, very happy.\nWe've opened the sale of LNG immediately. Actually, we did it a few days ago. And China—and right now, not only China, everybody wants to buy it. We have more than anybody, and they're all buying it. But Japan, in particular, we're very happy that they're going to start immediately, and we can supply it to the world, but we're supplying it to Japan, and they're going to always be right up in the front of the line.\nYes, go ahead. Please. Go ahead.\n[Several reporters spoke at once.]\nGovernment Spending Review/Defense Budget\nQ.Thank you so much. Mr. Prime Minister, I have a question for you as well, but, Mr. President, I'll start with you.\nQuickly, to follow up on what Peter was asking, have you directed Elon Musk to review Pentagon spending, given it's the biggest discretionary spending——\nPresident Trump. Yes, I have.\nQ.——in the Federal budget?\nPresident Trump. Pentagon, Education, just about everything. We're going to go through everything, just as it was so bad with what we just went through with this horrible situation we just went through, and I guess 97 percent of the people have been dismissed. It was very, very unfortunate.\nYou're not going to find anything like that, but you're going to find a lot. And I've instructed him to go check out Education, to check out the Pentagon, which is the military. And you know, sadly, you'll find some things that are pretty bad. But I don't think, proportionally, you're going to see anything like we just saw.\nFederal Bureau of Investigation\nQ.And your FBI has turned over a list to the Justice Department of the FBI agents who worked on the January 6 rioters' cases. Are you planning to fire the FBI agents who worked on those investigations?\nPresident Trump. No, but I'll fire some of them because some of them were corrupt. I have no doubt about that. I got to know a lot about that business, that world.\nQ.Which ones do you plan to fire?\nPresident Trump. I got to know a lot about that world, and we had some corrupt agents, and those people are gone, or they will be gone, and it will be done quickly and very surgically.\nQ.Are those the ones who worked on the January 6 investigation?\nPresident Trump. Did you have a question for the Prime Minister?\nQ.Are—just to clarify, are those the ones who worked on the January 6 investigations?\nPresident Trump. Talk up.\nQ.Are those the ones who worked on the January 6th investigations?\nPresident Trump. I don't know. I don't know. I know we have some that are very corrupt, and we don't like it. We're going to bring back the reputation of the FBI. Kash Patel is going to do a great job, and we're going to bring back the reputation of the FBI, which has been hurt very badly. It's been devastated over the last 4 years.\nNorth Korea\nQ.And, Mr. Prime Minister, you have just been meeting for the first time with President Trump. The last administration famously did not have hardly any, if at all, contact with North Korea. President Trump certainly did the last time he was in office. Would you like to see him resume that—that contact, and also that in-person meeting that he had with the North Korean leader, Kim Jong Un?\nPrime Minister Ishiba. That is something that the United States needs to determine on its own, and it's not something that we should request. Having said that, but—for example, in Vietnam or Singapore, the President of the United States, President Trump, was able to meet with Kim Jong Un. I think that's a very positive development.\nSo now that President Trump is in power again, if we are able to move towards resolving issues with the North Korea, I think it would be a great—and of course, for us, that includes not only denuclearization, but also resolving the abductee issue. And so the—not only the victims of the abductees but also their families, too, are aging, and so our time is limited.\nSo, if the President of the United States, if President Trump, is able to resolve this issue—we do understand that it's a Japan issue first and foremost. Having said that, we would love to continue to cooperate with them.\nPresident Trump. It's actually a good question, and we will have relations with North Korea and with Kim Jong Un. I got along with him very well, as you know. I think I stopped a war. I think if I wouldn't have won that particular election, you would have ended up in that——\nQ.Are you planning on speaking with him?\nPresident Trump. ——a very bad—a very bad situation, but I did. And we had a good relationship, and I think it's a very big asset for everybody that I do get along with him. I like—I mean, I get along with him. He gets along with me. And that's a good thing, not a bad thing.\nAnd I can tell you that Japan likes the idea, because their relationship is not very good with him. And if I can have a relationship with not only him but other people throughout the world where there seem to be difficulties, I think that's a tremendous asset for the world, not just the United States.\nQ.Mr. President——\nPresident Trump. Go ahead, Garrett [Garrett Haake, NBC News].\nWhite House Senior Adviser Elon R. Musk\nQ.Thank you. I have a question for you and for the Prime Minister as well. Mr. President, I wonder what you make of the criticism from Democrats that these staff reductions, the cuts that Elon Musk and DOGE are doing are an unlawful power grab? And is there anything you've told Elon Musk he cannot touch?\nPresident Trump. Well, we haven't discussed that much. I'll tell him to go here, go there. He does it. He's got a very capable group of people, very, very, very capable. They know what they're doing. They'll ask questions, and they'll see immediately, as somebody gets tongue tied, that they're either crooked or don't know what they're doing.\nWe have very smart people going in. So I've instructed him, \"Go into Education, go into military, go into other things as we go along.\" And they're finding massive amounts of fraud, abuse, waste, all of these things.\nSo—but I will pick out a target, and I say, \"Go in.\" There could be areas that we won't, but I can—I think everything's fertile. You know, we're a Government. We have to be open, and as an open Government—I don't know, I guess you could say maybe some high intelligence or something. And I'll do that myself, if I have to.\nBut generally speaking, I'll just say, \"Go.\" But he will be looking at Education pretty quickly, and he will be looking at military too.\nEntitlement Programs/Illegal Immigration\nQ.To that end, as you know, the bulk of Federal spending is Social Security, Medicare programs——\nPresident Trump. Sure.\nQ.——like that. Would you like to see him look at those programs as well?\nPresident Trump. Well, they don't really have to be looked at by him. They can be looked at by us. Social Security will not be touched. It will only be strengthened.\nWe have illegal immigrants on Social Security, and we're going to find out who they are and take them out. We have illegal immigrants in other—Medicare. We have—we found a lot of bad people, a lot of people that shouldn't be on that were put on when—through California. They come—a lot of them come out of California. We're not going to stand for that.\nSo we're going to strengthen our Social Security, et cetera. We're not going to touch it, other than to make it stronger. But we have people that shouldn't be on, and those people we have to weed out. Most of them or many of them, so far, have been illegal immigrants. They shouldn't even be in the country.\nDo you have a question for the Prime Minister?\nQ.I do. Mr. Prime Minister, the President's affinity for tariffs is well known. If the U.S. places tariffs on Japanese imports, would Japan retaliate?\nPrime Minister Ishiba. I am unable to respond to a theoretical question. That's the official answer that we have. [Laughter]\nPresident Trump. That's a very good answer. [Laughter] Very good answer. Wow. That's very good. He knows what he's doing.\nThank you very much, everybody. Thank you. Thank you.\n[Several reporters spoke at once.]\nQ.[Inaudible]—on Taiwan?\nQ.Mr. President——\nQ.Can you assure that U.S. troops will not be on the ground?\nPresident Trump.Thank you, everybody.", "Link": "https://www.presidency.ucsb.edu/documents/the-presidents-news-conference-with-prime-minister-shigeru-ishiba-japan"}
{"Title": "The President's News Conference With Prime Minister Narendra Modi of India", "Date": "2025-02-13", "Text": "President Trump.Thank you very much. Thank you very much. Please. Great honor.\nI'm thrilled to welcome the Prime Minister of India, my friend, Narendra Modi back to the White House. We spent a lot of time here and a lot of time in India, and he's a very special man.\nPrime Minister, it is a pleasure to extend to you the same hospitality that you showed Melania and myself when we traveled to your beautiful country 5 years ago. It's hard to believe so long ago, and it seemed like yesterday. It was beautiful. We opened the cricket stadium—129,000 seats, I think the largest stadium in the world, and it was an incredible period of time.\nThere is truly a special bond between the United States and India and the world's oldest democracy and the world's largest democracy and, I believe, the world's largest country, in terms of the numbers of people. And today the Prime Minister and I are announcing a framework to strengthen those ties even further economically, and the U.S.-India compact for the 21st century is a historic initiative that will deepen every aspect of our partnership and our friendship.\nStarting this year, we'll be increasing military sales to India by many billions of dollars. We're also paving the way to ultimately provide India with the F-35 stealth fighters.\nIn 2017, my administration revived and reinvigorated the Quad security partnership. In our meeting today, the Prime Minister and I reaffirmed that strong cooperation among the United States, India, Australia, and Japan, and it's crucial really to maintaining peace and prosperity, tranquility even, in the Indo-Pacific.\nIn addition, the United States and India will be working together like never before to confront the threat of radical Islamic terrorism, a threat all over the world actually.\nToday I'm pleased to announce that my administration has approved the extradition of one of the plotters and one of the very evil people of the world and having to do with the horrific 2008 Mumbai terrorist attack to face justice in India. So he's going to be going back to India to face justice.\nAs we deepen our defense partnership, we'll also strengthen our economic ties and bring greater fairness and reciprocity to our trading relationship.\nAs a signal of good faith, Prime Minister Modi recently announced the reductions to India's unfair, very strong tariffs that limit U.S. access into the Indian market very strongly. And really, it's big problem, I must say. India imposes a 30- to 40- to 60- and even 70-percent tariff on so many of the goods and, in some cases, far more than that.\nAs an example, a 70-percent tariff on U.S. cars going into India, which makes it pretty much impossible to sell those cars.\nToday, the U.S. trade deficit with India is almost $100 billion, and Prime Minister Modi and I have agreed that we'll begin negotiations to address the long-running disparities that should have been taken care of over the last 4 years—but they didn't do that—in the U.S.-India trading relationship, with the goal of a—signing an agreement. And we want—really, we want a certain level playing field, which we really think we're entitled to, and he does also, in fairness, so we're going to work on that very hard. And we can make up the difference very easily with the deficit with the sale of oil and gas and LNG, of which we have more than anybody in the world.\nThe Prime Minister and I also reached an important agreement on energy that will restore the United States as a leading supplier of oil and gas to India. It will be, hopefully, their number-one supplier in the groundbreaking development for U.S. nuclear industry. India is also reforming its laws to welcome U.S. nuclear technology, which is at the highest level, into the Indian market. This will bring safe, clean, and affordable electricity to millions of Indians and tens of billions of dollars to the U.S.-civilian nuclear industry in India.\nAnd under the framework we are announcing today, the United States and India are also joining forces to ensure that artificial intelligence and other advanced technologies are developed by the two of the most—really, two of the most advanced nations, intellectually and otherwise technologically, anywhere in the world. There's nobody very much closer. We have an incredible relationship there. And those are—this is where it seems to be heading.\nAnd artificial intelligence—complex—a very complex subject, but it seems to be where people want to be and they want to go, and we're leading right now by a lot, but other people will try to catch us. I don't know if they're going to be able to. We're going to make it available. We're going to make tremendous amounts of electricity available, and we're going to let the people that are buying the electricity make their own electric plants—electric generation plants, and we've never done this in our country, but we're going to get it done very quickly.\nLee Zeldin and his group are going to get the approvals in very rapid form. And we're calling it a \"national emergency,\" and that's exactly what it is. So we're going to be—we're going to remain at the top of the AI or artificial intelligence, I think, for a long time to come, and we're going to be working very closely with India and other countries on that. But right now we're the leader by quite a bit.\nFinally, we agreed to work together to help build one of the greatest trade routes in all of history. It will run from India to Israel to Italy and onward to the United States, connecting our partners by ports, railways, and undersea cables—many, many undersea cables. It's a big development. It's a lot of money going to be spent, and we've already spent some, but we're going to be spending a lot more in order to stay advanced and stay the leader.\nI'm pleased to report that with today's announcements, the friendship between the United States and India is the strongest I believe it's ever been. I think our relationship is the best it's ever been between two leaders of the two countries, and it's an honor to say that.\nI'd like to now invite the Prime Minister to say a few words, and then we'll take some questions. And we appreciate you all being here. Thank you very much. Thank you very much.\nPrime Minister Modi.Your Excellency President Trump, delegates of both countries, friends from the media:Namashkar.\nI would like to first of all express my heartfelt gratitude to my dear friend President Trump for the grand welcome and hospitality accorded to me. President Trump's leadership has been instrumental in nurturing India-U.S. ties and making them vibrant.\nI could feel today the same enthusiasm, the same enthusiasm, the same energy, the same commitment that we had worked with during our first term.\nOur discussions today highlighted our pride in our accomplishments during his first term, the deep mutual trust that we share, and also the resolve to attain new goals. We also agreed that the partnership and cooperation between India and the U.S. can shape a better world.\nFriends, the people of America are aware of President Trump's motto, \"Make America Great Again,\" or \"MAGA.\" The people are well aware of it. The people of India too are focusing on both heritage and development as they move forward at a fast pace and with a firm resolve to ensure a developed India by 2047. If I were to say this, borrowing an expression from America, our vision for a developed India is to \"Make India Great Again,\" or \"MIGA.\"\nWhen America and India work together, that is when MAGA—when it's MAGA plus MIGA, it becomes mega—a mega partnership for prosperity. And it is this mega spirit that gives new scale and scope to our objectives.\nFriends, today, we have also set ourselves the target of more than doubling our bilateral trade to attain $500 billion by 2030. Our teams will work on concluding very soon a mutually beneficial trade agreement.\nIn order to ensure India's energy security, we will focus on trade in oil and gas. Investment in energy infrastructure will also increase. In the area of nuclear energy, we also discussed increasing cooperation on small modular reactors.\nFriends, America plays an important role in India's defense preparedness. As strategic and trusted partners, we are moving forward actively towards joint development, joint production, and transfer of technology. In the times to come as well, new technologies and equipment will enhance our capacities.\nWe have decided to launch the autonomous systems industry alliance and a defense cooperation framework for the next decade will be prepared. Defense interoperability, logistics, repair, and maintenance will also be its key components.\nFriends, the 21st century is a technology-driven century. Close cooperation in the area of technology between countries that believe in democratic values can give new direction, strength, and opportunities to the entire humanity. India and the U.S. will jointly work in areas of artificial intelligence, semiconductors, quantum, biotechnology, and several other technologies.\nToday we also agreed on TRUST, which stands for Transforming Relationships Utilizing Strategic Technology. Under this, our focus will be on establishing strong supply chains for critical minerals, advanced materials, and pharmaceuticals.\nWe have also decided to launch a recovery and processing initiative for strategic minerals like lithium and rare earths.\nWe have had close cooperation with the U.S. in the area of space. The NISAR satellite developed with mutual cooperation between Israel and NASA will soon be flying into space on an Indian launch vehicle.\nFriends, partnership between India and the U.S. strengthens democracy and strengthens democratic values and systems. We will work together to enhance peace, stability, and prosperity in the Indo-Pacific. The Quad will play a special role in this. During the Quad summit scheduled to be held in India this year, we will expand cooperation in new areas with our partner countries. Under the IMEEC and I2U2, we will work together for the development of economic corridors.\nAnd in the area of connectivity, India and U.S. will stand strongly together in the fight against terrorism. We agree that in order to eliminate cross-border terrorism, we need concrete actions, and I'm very grateful to President Trump that he—in 2008, somebody who carried out genocide in India, that criminal is now going to be handed over to India, and I'm grateful to President Trump for this, and appropriate action will be taken in the courts in India.\nFriends, the Indian community living in the U.S. is an important link in our relations. In order to further deepen our people-to-people ties, India will soon open new consulates in Los Angeles and Boston. These will be new consulates.\nWe have invited American universities and educational institutes to open their offshore campuses in India.\nPresident Trump, I am grateful to you for your friendship and strong commitment towards India. The people of India still fondly remember your visit in 2020 and hope that President Trump will come and visit them again. On behalf of 1.4 billion Indians, I invite you to visit India.\nThank you. Thank you very much.\nPresident Trump.Thank you. Thank you very much. Great job.\nPrime Minister Modi.Thank you. Thank you.\nPresident Trump. Beautiful.\nOkay, thank you very much. That was excellent.\nWe'll do a few questions, please.\nQ.Mr. President——\nPresident Trump.Please, go ahead. Please, go ahead. Yes. Yes, blue shirt.\nQ.Me?\nIndia-U.S. Relations\nQ.Thank you, Mr. President. People in India will naturally welcome your decision to extradite Tahawwur Rana to India back home. And, in that context, I would like to ask you a question about—in last few years, we have seen several groups in the U.S. been raising anti-India voice, calling about separation—terrorism activities in India. Do you think that should continue here in the U.S. as well?\nPresident Trump.You're going to have to go louder.\nQ.Mr. President, people in India would be welcoming your decision to extradite Tahawwur Rana to India——\nPresident Trump.Yes, I can't understand——\nQ.Okay.\nPresident Trump.——a word he's saying. It's not the—it's the accent. It's a little bit tough for me.\nQ.But can I try again?\nPresident Trump.How about—how about you. Please. Go ahead, back there.\nQ.Thank you. Thank you very much.\nQ.Mr. President, thank you. First, I want to ask the Prime Minister a question. You and the President—you both spoke about combating ISIS. You both sounded very exciting about this—excited about this partnership upcoming, and I was curious, how much more confident are you with President Trump leading this country that there will be peace through strength and you will have a—successful partnership with the United States, versus with Biden's incompetence and weakness over the last 4 years? [Laughter]\nPresident Trump.That's your question, but I'll answer it. I agree with you. [Laughter] Yes, gross incompetence.\nWe're going to have a fantastic relationship. And it has been like the whole world has been set back over the last 4 years by the weakness of the United States, the weak leadership of the United States, but I think we've taken care of it in just 3 weeks. It seems to me that even some of the media that we wouldn't prefer has been writing that this is a much different country right now, that the world has a light over it—not only our country, but the whole world.\nThe Prime Minister told me that before too. Even over India, the world has a light. They need the United States to be strong and powerful but good, and I think that's happened. And I think it's happened in a very short period of time.\nBut I will tell you, we're going to have a fantastic relationship, and it will make both countries much stronger.\n[At this point, several reporters began asking questions at once.]\nAll right?\nYes, go ahead, please.\nQ.Geeta Mohan from India Today, sir. I'll just take my colleague Lalit Jha's question forward, because you couldn't understand——\nPresident Trump. Okay. Fine.\nIndia-U.S. Relations\nQ.The question is about the fact that you've decided to extradite Tahawwur Rana. Thank you so much. India has been waiting to have him back in India to bring him to justice.\nBut there are many other elements in the United States of America, particularly Khalistani separatists who've been working against Indian interests. How is the United States of America going to cooperate on that front with India? There are—there have been allegations that have been leveled against Indian agencies by the Biden administration. Are you going to relook that with Tulsi Gabbard as DNI now?\nPresident Trump.Well, I don't think India had a very good relationship with the Biden administration. Biden—they wouldn't sell them oil and gas, which is rather hard to believe, because, you know, it's a good thing to do. And a lot of things happened that weren't very appropriate, I thought, between India and the administration—the Biden administration.\nBut as you said, we're giving a very violent man—it seems to me—I mean, I don't know that he's been convicted yet or will be, but let's assume he's a pretty violent person—we're giving him back to India immediately. And there are more to follow, because we have quite a few requests.\nSo we work with India on crime, and we want to make it good for India, and it's very important. So that kind of a relationship is very important to us.\nOkay?\n[Several reporters spoke at once.]\nGo ahead, please.\nQ.Thank you.\nPresident Trump. Go ahead.\nIndia-U.S. Trade Relations/European Union/China/Tariffs\nQ.Thank you. Mr. President, you've repeatedly called India a big abuser of trade and said it is really difficult to do business in India because of tariffs. You announced reciprocal tariffs today. I am hoping you can speak about what kind of reciprocal tariffs India can expect. Are you willing to make any concessions, and how can India head off these tariffs?\nI also have one for the Prime Minister.\nPresident Trump. Sure.\nWell, India has been, to us, just about the highest tariffed nation anywhere in the world. They've been very strong on tariffs, and I don't blame them, necessarily, but it's a different way of doing business. It's very hard to sell into India because they have trade barriers, very strong tariffs.\nWe are right now a reciprocal nation. We are going to—if it's India or if it's somebody else with low tariffs, we're going to have the same. We're going to have whatever India charges, we're charging them. Whatever another country charges, we're charging them. So it's called reciprocal, which I think is a very fair way. We didn't have that.\nWe—I was going to do that in my other term, and we had the greatest economy ever in the world. We've never—there's never been an economy like we had, and then we got hit with COVID. We had a focus on that, and I wasn't really in the mood to be putting it on Italy and Spain and France and India, frankly, and a lot of other countries, because the world was very troubled until we got rid of that nightmare.\nBut we had the strongest economy anywhere in the world during that fairly long period of time during my first term, as you know, and we didn't do the tariffs. We would have done the reciprocal tariffs, but we decided—and I decided, I think, on a human basis—on a humane basis not to do them because of the fact that there was such suffering all over the world. The last thing we needed to talk about is trade problems.\nBut now we do—we're doing—we see a tremendous future for our country. But we felt that now it's finally time, after 45 or 50 years of abuse, that we will do—and this isn't India, this is among a lot of nations.\nThe European Union is very difficult for us—very, very difficult. They tax our companies at levels that nobody's ever seen before. They take advantage of a lot of things. So we're not happy about that.\nChina, of course, is terrible, and we've never taken in 10 cents until I was President. We've taken in hundreds of billions of dollars from China since I've been President—in first term and now—and we have to do that just as a mechanism of fairness, and that's what I've done.\nAnd so, we are being reciprocal with India. Whatever India charges, we charge them. So, frankly, it no longer matters to us that much what they charge, because whatever they charge—I had discussions with India in the first term about the fact that their tariffs were very high, and I was unable to get a concession. So we're just going to do it the easy way, and we're just going to say, \"Whatever you charge, we charge.\" And I think that's fair for the people of the United States, and I think it's actually fair for India.\nOkay?\nQ.Are you willing to make any concessions, sir? Are you willing to make any concessions, sir? Any concessions?\nQ.Mr. President——\nPresident Trump.Go ahead, please. Ask to the Prime Minister, please.\nQ.A question for the Prime Minister, please.\nPresident Trump.Ask to the Prime Minister, please.\nQ.Yes, sorry. Yoshita Singh with Press Trust of India. Prime Minister—thank you, Mr. President.\nPrime Minister, the U.S. is giving a lot of push to curb illegal immigration, and India has been cooperating on this issue. How does India see this issue in the larger context? Thank you.\nPrime Minister Modi.I don't think this is a question that is about India only, but, even globally, you can talk about this issue. And we are of the opinion that anybody who enters another country illegally, they have absolutely no right to be in that country.\nAnd as far as India and the U.S. is concerned, we have always been of the same opinion, and that is that any verified Indian who is in the U.S. illegally, we are fully prepared to take them back to India. However, it doesn't stop there.\nThese are children of very ordinary families, and they are lured by big dreams and big promises. A lot of them are brought in without them knowing about why they are going to a country. And, in fact, they are connected with a human trafficking system, and we have to make sure that we fight against this system.\nAs far as the U.S. and India is concerned, I think what we should do is make efforts to make sure that we uproot these from within the system so that we can reduce or remove human trafficking. And basically, the young, vulnerable, poor people of India are fooled into coming over as illegal immigrants, and our bigger fight, actually, is against this ecosystem or this system that encourages such gangs to thrive. And I can tell you that India will completely support your endeavor in achieving this.\n[Several reporters spoke at once.]\nPresident Trump. Yes.\nUkraine/Russia\nQ.Thank you. Thank you, Mr. President. A question for Prime Minister Modi first, if I may. I wanted to ask you: Did you discuss any possible business deals with Elon Musk during your—your meetings today, Mr. Prime Minister?\nAnd, Mr. President, I wanted to ask you: Today you spoke about hoping to have three-way talks with President Xi and President Putin. What would you say to European leaders and other allies who may be concerned that you're apparently more keen to speak to America's adversaries than to its allies? Thank you.\nPresident Trump.Well, I—maybe I'll just go and—first on this one. We had some talks, and we told the European Union, we told the NATO people—largely, they overlap—\"You have to pay more money because it's unfair what we're doing. We're doing a tremendous amount more.\" We're probably $200 billion more going into Ukraine, using for Ukraine to fight, and Europe has not really carried its weight in terms of the money. It's not equitable, and we want to see a counterbalance. We want to have them put up more money. They have to do that.\nAt the same time, we had a very good conversation with President Putin the other day—yesterday. And we also had a very good conversation—I did, both—in both cases—with President Zelenskyy. And I think we're going to be able to do something. I think we're going to be able to make a deal, and I hope so, because it's a horrible war. It's a very terrible, bloody war with a million and a half soldiers, at least, already dead on the battlefield, lying all over the fields like—nobody has ever seen anything like it since—certainly since the Second World War.\nAnd so I think we're going to be able to do something. We're working with President Zelenskyy and with President Putin, and my impression is that they—I know that President Zelenskyy wants to make a deal, and I also feel that—I know that President Putin wants to make a deal. I wanted to know that before I began any detailed discussions.\nBut the meeting and the conversation—also, the meeting with Steve Witkoff in Moscow was a very successful one, and my phone call with him was a very successful one.\nPlease.\nPrime Minister Modi.You asked a question regarding Elon Musk. I have known him for a very long time. I was not even Prime Minister at the time when I first met him; I was Chief Minister. And today he came to meet me along with all his family, with his children. And so we had a nice discussion.\nAs far as the EV is concerned—EVs are concerned, the EV—the word \"EV\" has a copyright. And that is one person who has a copyright for the word \"EV,\" and that is Trump.\n[Several reporters spoke at once.]\nPresident Trump.Thank you. That was very nice.\nGo ahead, please.\nQ.Thank you, Mr. President. Can I ask whether you discussed at all today the case of Gautam Adani, who's one of the wealthiest men in Asia and perceived as an ally of Prime Minister Modi?\nPrime Minister Modi, have you asked the President to take action on that case? Thank you.\nPrime Minister Modi.Firstly, India is a democratic country, and our culture and our thought philosophy is Vasudhaiva Kutumbakam, which basically means that the entire world is a family. Every Indian is my own family member. And when it comes to such personal matters, two—leaders of two countries will not get together on that topic and discuss anything on an individual matter.\n[Several reporters spoke at once.]\nPresident Trump.Go ahead. Please. Yes. Please.\nQ.Which one?\nPresident Trump.Sir, go ahead, please.\nRussia/Ukraine\nQ.Yes. Thank you, Mr. President. Thank you, Mr. Prime Minister. I have a question for you as well.\nBut, Mr. President, you have suggested—with regards to the Russia-Ukraine war, you've suggested several things that Ukraine should give up: the idea of NATO membership, territory that was seized back in 2014 by Russia. What should Russia give up?\nPresident Trump.Russia has gotten themselves into something that I think they wish they didn't. If I were President, it would not have happened—absolutely would not have happened, and it didn't happen for 4 years.\nIf you look at what has taken place, under President Bush, they lost a lot. Under President Obama, they lost Crimea. Under Biden, it looks like they could lose the whole thing. Under Trump, they lost nothing—Ukraine lost nothing. They didn't give up anything. And you take a look at the other three Presidents surrounding me, they gave up a lot.\nI think that when you look at Ukraine and when you look at the mess that they're in, it's got to be ended, and it's got to be stopped.\nNow, Russia has taken over a pretty big chunk of territory, and they also have said from day one—long before President Putin, they've said they cannot have Ukraine be in NATO. They said that very strongly.\nI actually think that that was the thing that caused the start of the war. And Biden said it, and Zelenskyy said it, and I think that was one of the reasons—one of the starts of the war.\nBut from long before Putin, they said you cannot have—you cannot have Ukraine going in, in any way, into NATO. And I start from that standpoint. I think everybody knew that.\nNow, if a better deal can be negotiated, if they were able to make a deal where they can do that, that's fine with me. I really don't care. I want that bloodshed to stop. I don't want to see—you know, we have an ocean between us and the site we're talking about—the site of death. We're calling it the fields of death. We have a big ocean in between us. This is more important for Europe. We shouldn't be in—they have to equalize, and they're going to have to do it fast, but they have to equalize.\nBut as far as the negotiation, it's too early to say what's going to happen. Maybe Russia will give up a lot, maybe they won't, and it's all dependent on what is going to happen. The negotiation really hasn't started.\nBut I will say, as far as NATO is concerned, from many years before President Putin, I will tell you that I've heard that Russia would never accept that, and I think Ukraine knew that, because Ukraine wasn't in and never requested to be in until more recently. So that's the way it is, and I think that's the way it's going to have to be.\n[Several reporters spoke at once.]\nQ.But, Mr. President—Mr. President, I——\nPresident Trump.Go ahead, please. All right. Go ahead, please, with the tie.\n[Several reporters spoke at once.]\nWith the tie, yes.\nQ.Mr. President, I have a question for the Prime Minister.\nQ.Mr. President——\nPresident Trump.Yes, go ahead, please.\nIndia-U.S. Trade Relations\nQ.This is Saurabh Shukla from NewsMobile. Mr. President, you spoke about Prime Minister Modi as a tough negotiator. Who was a tougher negotiator today, and who has a better negotiating tactic when it comes to tariffs with——\nPresident Trump.Oh, he's a much tougher negotiator than me, and he's a much better negotiator than me. There's not even a contest. Okay? [Laughter]\n[Several reporters spoke at once.]\nYes, go ahead. Please go ahead. Go ahead.\nQ.Reena Bhardwaj from ANI. How do you see this relationship between the India and the United States to counter China? And what is your vision when it comes to India, you know, brokering peace in the Ukraine and Russia conflict?\nChina/India/Russia/Global Defense Spending\nPresident Trump.Well, I think we are going to have a very good relationship with China. I got along with President Xi very well until COVID. That was a bridge too far. But until then, I got along with President Xi very, very well. We were very close, as leaders go. I don't want to be naive, but as leaders go, I think we were very close.\nAnd I think that China is a very important player in the world. I think they can help us get this war over with Ukraine and Russia.\nAnd I look at India, I do see the skirmishes on the border, which are quite vicious, and I guess they continue to go on. If I could be of help, I'd love to help, because that should be stopped. That's been going on for a long time, and it's quite violent. It's quite violent.\nBut I would hope that China and India and Russia and U.S. and all of us can get along. It's very important.\nYou know, the power of weaponry today is—and not only nuclear, but nuclear, in particular—the power of weaponry is very important. I said before that I had very constructive talks in my first term with President Putin about the denuclearization of the two countries. And then we were going to go to China after we worked some kind of a deal, and we had the confines of a deal. We—we were—I thought we—he really wanted to do it and so did I—denuclearize. And it's so—it's such a beautiful term, when you think about it. In other words, to bring it down, because the power of those weapons is—is too great.\nAnd I did speak to President Xi about that, and I was getting also a very good response. He's building a very strong nuclear power. He's not very close to Russia or the United States right now, but he will be soon. I mean, he'll catch up over the period of 4 or 5 years, they say.\nBut it would be a great thing if we could—on a military basis, we're going to spend this year 900—let's say $915 billion on military. Russia, without the war, was spending close to a hundred, but with the war, I can't tell you what they're spending, but they're spending a lot. And China is spending $400- and $450 billion. We're over $900 billion. And I said, \"You know, it doesn't really make sense.\" I said, \"We're spending the money against each other, and we could spend that money for better purpose if we got along.\" And I'll tell you, I think that something like that will happen.\nFirst, when I left, as you know, 4 years ago, we didn't have Israel and the Middle East. We didn't have October 7—what a disaster—the disaster. Nothing was happening. Iran was not in—going to do anything, because Iran did not have much money at that point. They were broke. They were totally broke. They didn't have money for Hamas or for Hizballah. And you didn't have Russia with Ukraine, and that would never have happened.\nBut now I come back, and I have—the whole world is on fire, so I have to put out the fires. But after I put out the fires, I'm going to meet with China, and I'm going to meet with Russia, and we're going to see if we can de-escalate, if we can bring it down—military—especially as it pertains to nuclear.\nPlease.\n[Several reporters spoke at once.]\nQ.And India's role—India's role in—how do——\nQ.Mr. President, you mentioned about American Islamic terrorism——\n[Several reporters spoke at once.]\nQ.Prime Minister, how do you see India play a role in a—in de-escalating the Ukraine-Russia——\nInterpreter. Mike, please.\n[Prime Minister Modi made remarks; no translation was provided.]\nQ.Prime Minister, how do you see India's role? You have had discussions with President Trump about de-escalating the conflict in Russia and Ukraine.\nPrime Minister Modi.As you know, I have been in constant contact with both Russia and Ukraine. I have also visited both countries. And many peoples are mistaken and they feel that India is neutral. I would like to clarify: India is not neutral. We have taken a side, and we have taken the side of peace.\nAnd it is based on this principle of ours that, in the presence of President Putin, I clearly said in front of the media that this is not the era of war. And even today, it is my conviction that solutions cannot be found on the battlefield. Ultimately, you have to come to the negotiating table, and India has constantly made efforts that there are talks that take place where both parties are present. It is only then that we will find a solution.\nThe efforts being made by President Trump—I support them, I welcome them, and I would like that President Trump is successful as soon as possible so that the world is on the path to peace once again.\n[Several reporters spoke at once.]\nPresident Trump.Everybody, thank you very much. Thank you very much.\n[Several reporters spoke at once.]\nAnd I very much appreciate the Prime Minister visiting our great country, and I do really appreciate it. We have so much in common, and all we want to do is have peace, and we want to have strength, and we want to have lots of different things together, but the relationship with India and with the Prime Minister has never been better.\nThank you very much.\nPrime Minister Modi.Thank you. Thank you.\nPresident Trump.Thank you very much.\nPrime Minister Modi. Thank you.\nPresident Trump.A great honor. Thank you.", "Link": "https://www.presidency.ucsb.edu/documents/the-presidents-news-conference-with-prime-minister-narendra-modi-india-0"}
{"Title": "Interview With Sean Hannity of the Fox News Channel's \"Sean Hannity Show\"", "Date": "2025-02-14", "Text": "Mr. Hannity.Mr. President, great to see you again.\nThe President.Thank you very much. Thank you.\nMr. Hannity.How are you?\nThe President.Thank you.\nMr. Hannity.Elon Musk.\nWhite House Senior Adviser Elon R. Musk. Hi.\nMr. Hannity.Great to see you.\nSenior Adviser Musk.Thanks. Thanks for having me.\nThe President's Relationship With White House Senior Adviser Elon R. Musk\nMr. Hannity.I've been reading a lot about you. I've got to start with this. So he's working for free with DOGE. He's—he's kind of put a lot of his life on hold, and you sued Twitter a number of years ago. You just made him pay you $10 million?\nThe President.That's right. That's right.\nMr. Hannity.That's—that's right. [Laughter]\nThe President.Well, I sued—I sued from long before he had it.\nSenior Adviser Musk.Yes. Yes. [Inaudible]\nThe President.And, I mean, they really did a number on me, you know. And I sued, and they had to pay. You know, they paid $10 million settlement.\nMr. Hannity.You're okay with that?\nSenior Adviser Musk.I mean, I left it up to the lawyers and, you know, the team running Twitter. So I said, \"You guys do what you think is the right—makes sense.\"\nMr. Hannity.I think it's funny.\nThe President.I think——\nMr. Hannity.Because——\nThe President.——it's a very low—I was looking to get much more money than that.\nMr. Hannity.So you gave him a discount in the lawsuit?\nThe President.He got—oh, he got a big discount. I don't think he even knows about it.\nMr. Hannity.He's become one of your—if you read and believe the media—he's become one of your best friends. He's working for free for you. He's——\nSenior Adviser Musk.Well, I love the President. I just want to be clear about that.\nMr. Hannity.You don't care about that?\nSenior Adviser Musk.I—no, I love the—I——\nMr. Hannity.You love the President?\nSenior Adviser Musk.I think—I think President Trump is a good man, and—and he's, you know—I——\nThe President.That's the way he said that. You know, there's something nice about. [Laughter]\nSenior Adviser Musk.No, it is. I, you know——\nThe President.It is.\nSenior Adviser Musk.Because, I mean, the President has been so—so unfairly attacked in the media. It's truly outrageous. And I've spent—at this point, spent a lot of time with the President, and not once have I seen him do something that was mean or cruel or wrong. Not once.\nMr. Hannity.You know, I've known him for 30 years.\nSenior Adviser Musk.Yes.\nMr. Hannity.And I've never seen anybody take as much as he's taken.\nSenior Adviser Musk.Yes.\nMr. Hannity.And we've discussed this. And I'm like, \"How do you deal with it?\"\nThe President.Did I have a choice? [Laughter]\nMr. Hannity.Well, you would say that to me.\nThe President.I didn't have a choice.\nMr. Hannity.I'm like, \"What—what am I going to do? Worry about it?\"\nThe President.That's the only thing I can say.\nMr. Hannity.And you know—and then culminating in two assassination attempts, which resulted in your endorsement.\nSenior Adviser Musk.Well, I was going to do it anyway, but that was——\nMr. Hannity.That was it?\nSenior Adviser Musk.——a precipitating event, yes.\nThe President.That speeded it up a little bit?\nSenior Adviser Musk.Yes. Yes.\n2024 Assassination Attempt in Butler, Pennsylvania\nMr. Hannity.The day of the assassination?\nThe President.Nice. I didn't know that.\nSenior Adviser Musk.Yes, it just—it sped it up, but I was going to do it anyway.\nMr. Hannity.Mr. President, with your indulgence, I'm convinced that people only know a little bit about Elon. I don't think they know everything about Elon, because as I studied for and prepared for this interview, I learned a lot about you that I didn't know. I think people will think about Tesla. Democrats are demonizing you and trying to make the country hate you.\nI just want people to understand you a little bit better, and the person that you've gotten to know and have now put a lot of trust in.\nThe President.Sure.\nMr. Hannity.And you know, just—let's go over a little bit of your bio, starting——\nSenior Adviser Musk.Ah, okay.\nMr. Hannity. ——with PayPal and how you became involved in Tesla and SpaceX and Neuralink—and all these——\nSenior Adviser Musk.This could take a while.\nI mean, you know, I think the way you think of me is, like, I'm a technologist and I try to make technologies that improve the world and make life better.\nMr. Hannity.You can show them your shirt.\nSenior Adviser Musk.Yes, and that's why, like, my t-shirt says \"Tech Support\"—[laughter]—because I'm here to provide the President with technology support.\nAnd now, that—that may seem, like, well, is that a silly thing? But actually, it's a very important thing, because the President will make these Executive orders, which are very sensible and good for the country, but then they don't get implemented, you know?\nSo, if you take the—for example, all the funding for the migrant hotels, the President issued an Executive order: Hey, we need to stop taking taxpayer money and paying for luxury hotels for illegal immigrants——\nMr. Hannity.It's crazy.\nSenior Adviser Musk.——which makes no sense. Like, obviously, people do not want their tax dollars going to fund high-end hotels for illegals. And yet, they were still doing that, even as late as last week.\nAnd so, you know, we went in there, and we were like: \"This is in violation of the Presidential Executive order. It needs to stop.\"\nSo what we're—what we're doing here is—one of the biggest functions of the DOGE team is just making sure that the Presidential Executive orders are actually carried out. And this is—I just want to point out, this is a very important thing, because the President is the elected representative of the people, so he's representing the will of the people. And if the bureaucracy is fighting the will of the people and preventing the President from implementing what the people want, then what we live in is a bureaucracy and not a democracy.\nMr. Hannity.Yes. You're both aware—you have to be keenly aware that the media and—and the punditry class—not that—you know, I think you've proven they have no power anymore, because they threw everything they had at you, and they didn't win. And that was, you know, the New York Times, Washington Post, three networks, every late-night comedy show, two cable channels—they just threw—they threw everything—lawfare, weaponization.\nThe President.It's true.\nNews Media\nMr. Hannity.And now I see they want you two to start—they want a divorce. They want you two to start hating each other. And they try—\"Oh, President Elon Musk,\" for example. You do know that they're doing that to you?\nThe President.Oh, I see it all the time. They tried it, then they stopped. That wasn't—they have many different things of hatred. Actually, Elon called me. He said, \"You know they're trying to drive us apart.\" I said, \"Absolutely.\"\nYou know, they said: \"We have breaking news: Donald Trump has ceded control of the Presidency to Elon Musk. President Musk will be attending a Cabinet meeting tonight at 8 o'clock.\" [Laughter] And I say—it's just so obvious. They're so bad at it.\nI used to think they were good at it. They're actually bad at it, because if they were good at it, I'd never be President because I think nobody in history has ever gotten more bad publicity than me.\nSenior Adviser Musk.Yes, yes. Right.\nThe President.I could do the greatest things; I get 98-percent bad publicity. I could do—outside of you and a few of your very good friends. It's, like, the craziest thing.\nBut you know what I have learned, Elon? The people are smart. They get it.\nSenior Adviser Musk.Yes. They do, actually. Yes.\nThe President.They get it. They really see what's happening.\nSenior Adviser Musk.Yes.\nWhite House Senior Adviser Elon R. Musk/Implementation of the President's Executive Actions\nMr. Hannity.And at the end of this interview, I—what I would like is, I—I want people to know the relationship and know more about you.\nWhat is the relationship, Mr. President?\nThe President.Well, I respect him. I've always respected him. I never knew that he was right on certain things, and I'm usually pretty good at this stuff. He did Starlink. He did things that were so advanced, and nobody knew what the hell they were.\nI can tell you, in North Carolina, they had no communication. They were wiped out. Those people were—you know, they had rivers in between—land that never saw water, all of a sudden, there was a river and a vicious—like, rapids. People were dying all over. They had no communication.\nThey said, \"Do you know Elon Musk?\" And they didn't really know I knew him. I said, \"Yeah.\" They said, \"Could you get Starlink?\" It's, like, the first time I ever heard of it. I said, \"What's Starlink?\" \"A communication system that's unbelievable.\"\nMr. Hannity.I have it.\nThe President.And he—yes. And he said—I called him, and I said, \"Listen, they really need it.\" And he got, like, thousands of units of this communication, and it saved a lot of lives. He got it immediately. And you can't get it. I mean, you have to wait a long time to get it. But he got it to him immediately.\nAnd I said, \"That's pretty amazing.\" And I didn't even know he had it.\nWe watch the rocket ships, and we watch Tesla. I think, you know, something that had an effect on me was when I saw the rocket ship come back and get grabbed like you grab a beautiful little baby. You grab your baby. It just——\nSenior Adviser Musk.Just hug the rocket.\nThe President.I'd never seen——\nSenior Adviser Musk.Everyone—right. Everyone needs—[inaudible]——\nMr. Hannity.You hug the rocket. You hug the rocket.\nSenior Adviser Musk.——rockets.\nThe President.Yes. No, but—and he said: \"You know, you can't really have a rocket program if you're going to dump a billion dollars into the ocean every time you fly. You have to save it.\" And he saved it. First time——\nMr. Hannity.That's ever been done.\nThe President.——I've ever seen that done. Now nobody else can do it.\nIf you look at the U.S., Russia, or China, they can't do it, and they won't be able to do it for a long time. He has the technology. So you learn—I wanted somebody really smart to work with me, in terms of the country—a very important aspect. Because, I mean, he doesn't talk about it. He's actually a very good businessman. And when he talks about the Executive orders—and this is probably true for all Presidents: You write an Executive order and you think it's done, you send it out; it doesn't get done. It doesn't get implemented. They don't implement it.\nThey—maybe they're from the last administration—and they are, in some cases. You try and get them out as fast as you can. But I could—as soon as he said that, I said, \"You know, that's interesting.\" You write a beautiful Executive—and you sign it and you assume it's going to be done, but it's not. What he does is he takes it, and with his hundred geniuses—he's got some very brilliant young people working for him that dress much worse than him, actually——\nSenior Adviser Musk.Yes, they do.\nThe President.——they dress in just t-shirts. [Laughter] You wouldn't know they have 180 IQ.\nMr. Hannity.Wait. Wait. So what, he's your tech support?\nSenior Adviser Musk.I——\nThe President.No, no. He is——\nSenior Adviser Musk.I actually virtually am tech support.\nThe President.He's much more than that.\nSenior Adviser Musk.I actually am tech support, though. But that's——\nThe President.But he gets it done. He's a leader. He really is a—he gets it done. You get a lot of tech people, and you have people, they're good with tech, but they—he gets it done.\nYou know, I said, in real estate, you had guys that would draw beautiful renderings of a building, and they'd draw the rendering, it would be great, and you'd say: \"Great. When are you starting?\" But they were never able to get it built. They couldn't get the financing. They couldn't get the approvals. It would never get done. And then you have other guys that are able to get it done. You know, they could just get it done.\nI was in real estate. Same thing in this. He gets it done.\nSo, when he said that—he said, \"You know, when you sign these Executive orders, a lot of them don't get done, and maybe the most important ones,\" and he would take that Executive order that I'd signed, and he would have those people go to whatever agency it was—\"When are you doing it? Get it done. Get it done.\" And some guy that maybe didn't want to do it, all of a sudden, he's signing—he just doesn't want to bother.\nThe President's Executive Actions/Border Security\nMr. Hannity.Does—do a lot of those Executive orders have to be codified into law to—do you need the Republican Congress to follow up?\nThe President.Yes, and they will. A lot of them will be. Yes.\nMr. Hannity.They will?\nThe President.Look, in the meantime, we have 4 years. The beauty is, we have 4 years. That's why I like doing it right at the beginning. Because an Executive order is great. I mean, the one problem—it's both good and bad, because when they did all these Executive orders, I've canceled most of them. They were terrible. I mean, we were going to go radical left, Communist, okay? It was crazy. Their——\nSenior Adviser Musk.Really crazy.\nThe President.——Executive orders were so bad, if they ever got them codified, you'd never be able to break them. So the damage that Biden has done to this country—and it's not even Biden; it's the people that circled him in the Oval Office, okay?—but the damage they did to this country, in terms of, let's say, open borders—you know, there's so many things, but open borders, where millions of people poured into our country, and hundreds of thousands of those people are criminals. They're murderers. They're drug dealers. They're gang members. They're people from prisons from all over the world.\nAnd we have a great guy, Tom Homan, and he is doing so incredibly. You saw the numbers. They're down like 96 percent.\nMr. Hannity.Ninety-five percent.\nThe President.He is a phenomenal guy. And Kristi Noem is doing an unbelievable job. And he wanted her. He said, \"She's so tough.\" And I said: \"I don't think of her as that way. You know, she's very nice.\" He said, \"No, she's so tough.\" And she is. I see her with the horses. She's riding the horse. Let's—[laughter]—she's great.\nBut the team we have is really unbelievable.\nBut those Executive orders, I sign them, and now they get passed on to him and his group and other people, and they're all getting done. We're getting them done.\nMr. Hannity.Let me go back a little bit to your background, because——\nSenior Adviser Musk.Sure.\nMr. Hannity. ——it's beyond impressive. You were the chief engineer, for example—you were an early believer in Tesla. You became the CEO and then the chief engineer, which was phenomenal. SpaceX, same thing, which is unbelievable.\nI mean, you were the first company—private company to send astronauts successfully into—into space, first private company to send astronauts into orbit.\nSenior Adviser Musk.Yes.\nMr. Hannity.That's pretty deep.\nThe President.He's going to go into orbit soon.\nMr. Hannity.Okay.\nSenior Adviser Musk.[Laughter] Yes.\nThe President.No, he's going to go to Mars. He's going to fly on his——\nMr. Hannity.Starlink.\nSenior Adviser Musk.At some point, yes.\nMr. Hannity.As in—[inaudible]——\nSenior Adviser Musk.But they say—they always ask me, like, \"Do you want to die on Mars?\" And I say, \"Well, yes, but not on impact.\" [Laughter]\nMr. Hannity.Starlink is in 100 countries.\nThis is going to be hard. I feel like I'm interviewing two brothers here.\nSenior Adviser Musk.You go ahead.\nMr. Hannity.Starshield, which could be used for national defense.\nSenior Adviser Musk.Yes, it is already being used for national defense.\nMr. Hannity.Then you have a—what is it called? Optimus, a part of Tesla.\nSenior Adviser Musk.They're a robot, yes.\nMr. Hannity.A robotic arm. Then you have an AI arm. And then you have something that really fascinated me, and it's called Neuralink.\nSenior Adviser Musk.Yes.\nMr. Hannity.You might help the blind to see and people with spinal cord injuries that they—that they can recover, where in the past—how close is that to becoming a success?\nSenior Adviser Musk.Yes. At Neuralink we're—we've implanted Neuralink in three patients so far, who are quadriplegics, and it allows them to directly control their phone and computer just using their mind, just by thinking. It's like—so, we call this product Telepathy, so you control your computer and phone just by thinking, and it's possible to actually control the computer and phone faster than someone who has working hands.\nThen the next step would be to add a second Neuralink implant past the point where these—the neurons are damaged, so that somebody can walk again and so the—they can have full-body functionality restored. And——\nThe President.And you like Bobby, right?\nSenior Adviser Musk.I like Bobby, actually. Yes. I supported Bobby Kennedy. I think he—you know, he's unfairly maligned as someone who is anti-science. But I think he—he isn't. He just wants to question the science, which is the essence of the science—the scientific method, fundamentally, is about always questioning the science.\nMr. Hannity.Well, they didn't tell us the truth about COVID.\nSenior Adviser Musk.Correct.\nMr. Hannity.That's for sure.\nSenior Adviser Musk.Yes.\nMr. Hannity.And we learned a lot with the Twitter files. And that just, then, raises a question. You're the richest man in the world. You may not like that part.\nThe President.Yes.\nMr. Hannity.You're pretty competitive.\nSenior Adviser Musk.I mean, it's neither here nor there.\nMr. Hannity.I've known you a long time.\nSenior Adviser Musk.I don't think it matters.\nMr. Hannity.But——\nThe President.That's why I became President.\nMr. Hannity. ——he's on your team.\nThe President.[Inaudible]\nMr. Hannity.Well, that's true. He can't top that.\nThe President.He's good. You know, I wanted to find somebody smarter than him. I searched all over. I just couldn't do it. I couldn't. I couldn't.\nMr. Hannity.You really tried hard.\nThe President.I couldn't find anyone smarter, right? So we had to—we had to, for the country.\nMr. Hannity.But this is the thing——\nThe President.So we settled on—we settled on this guy.\nSenior Adviser Musk.Well, thanks for having me.\nThe President.[Laughter] Yes.\nMr. Hannity.So——\nSenior Adviser Musk.I'm just trying to be useful here.\nMr. Hannity.But this is the interesting—but this is where we are as a society. And I hate to do this to you, but I'm going to do it anyway. You're doing all of these things. At DOGE, nobody at DOGE gets paid a penny, correct?\nSenior Adviser Musk.Well, actually, some people are Federal employees, so they do.\nMr. Hannity.Oh, okay.\nSenior Adviser Musk.Yes. They're. But it's fair to say that the software engineers at DOGE could be earning millions of dollars a year and instead of earning a small fraction of that as Federal employees.\nMr. Hannity.Okay. So just——\nThe President.And they're very committed people.\nSenior Adviser Musk.Yes.\nMr. Hannity.So you're committed to helping the blind see, people with spinal cord injuries recover.\nSenior Adviser Musk.Yes.\nMr. Hannity.You're committed to getting to Mars. You're committed to rescue—you're going to help rescue, next month, two astronauts that I think were abandoned. They dispute that in an interview.\nThe President.When are you—when are you getting them?\nSenior Adviser Musk.At the President's request, we—or instruction, we are accelerating the return of the astronauts, which was postponed, kind of, to a ridiculous degree.\nThe President.They got left in space.\nMr. Hannity.They've been there. They were supposed to be there 8 days. They're there almost 300.\nThe President.Biden.\nSenior Adviser Musk.They were put——\nMr. Hannity.Yes.\nSenior Adviser Musk.Yes, they were left up there for political reasons, which is not good.\nMr. Hannity.Okay, it's not good. Now, if I had the weight and pressure of doing that successfully on my shoulders, I think I'd be, you know—but you—when we spoke before we did this interview, you were very confident. You think this will be a successful mission.\nSenior Adviser Musk.Well, we don't want to be complacent, but we have brought astronauts back from the space station many times before, and always with success. So, as long as we're not complacent——\nSpaceX Rocket Launch\nThe President.When are they—when are you going to launch?\nSenior Adviser Musk.I think it's about—about 4 weeks to bring them back.\nMr. Hannity.About 4 weeks?\nSenior Adviser Musk.Yes.\nThe President.And you have the go-ahead.\nSenior Adviser Musk.We're being extremely cautious.\nMr. Hannity.Yes.\nThe President.You now have the go-ahead.\nSenior Adviser Musk.Yes. Well, thanks to you——\nThe President.They didn't have the go-ahead with Biden.\nMr. Hannity.What's that?\nThe President.He was going to leave him in space. I think he was going to leave them in space.\nMr. Hannity.Well, it's like the—[inaudible]——\nThe President.He considered it a——\nMr. Hannity. ——growing up, lost in space.\nThe President.Yes, he didn't want the publicity. Can you believe it?\nMr. Hannity.Unbelievable. And so——\nSenior Adviser Musk.Yes.\nMr. Hannity. ——I want to echo something that the President said and then ask an overarching question. So people in—get hit with Hurricane Helene, they have no communication with the outside world. You come to the rescue. You donated that, I believe?\nSenior Adviser Musk.Yes. Yes.\nMr. Hannity.You donated to the people of——\nThe President.He saved a lot of lives. In North Carolina, he saved a lot of lives.\nMr. Hannity.And California, after the wildfires?\nThe President.California. But, I mean, in North Carolina, where they were really in trouble, they had no communication, people were dying.\nMr. Hannity.Nothing.\nThe President.They were dying of starvation. He saved a lot of lives in North Carolina.\nMr. Hannity.Okay. Now you're going to rescue astronauts. And now—again, you do—you do all of this—I would think liberals would love the fact that you have the biggest electric vehicle company in the world.\nSenior Adviser Musk.Yes. I mean, I used to be adored by the left, you know.\nMr. Hannity.Not anymore.\nSenior Adviser Musk.Less so these days.\nMr. Hannity.He killed that, huh?\nSenior Adviser Musk.I mean, less——\nThe President.I really did a number——\nSenior Adviser Musk.Well, I mean, this whole sort of, like, you know—it was—they call it, like, \"Trump derangement syndrome.\" And I didn't—you know, you don't realize how real this is until, like, it's—you can't reason with people.\nSo, like, I was at a friend's birthday party in L.A., just a birthday dinner, and it was, like, a nice, quiet dinner, and everything was—everyone was behaving normally. And then I happened to mention—this was before the election, like a month or 2 before—I happened to mention the President's name, and it was like they got shot with a dart in the jugular that contained, like, the methamphetamine and rabies. Okay? [Laughter]\nAnd they're like, \"Why?\" And I'm, like, \"What is wrong—like, guys, like\"—you just can't have, like, a normal conversation. And it's like they become completely irrational.\nMr. Hannity.He has no idea, if you're friends with him——\nSenior Adviser Musk.Yes.\nMr. Hannity. ——you pay a price. You know, it's like, I walk into a restaurant in New York, and it's like half the room gets daggers and they want to——\nSenior Adviser Musk.The eye-daggers—eye-daggers level is insane. [Laughter]\nI mean, there was, like—I had, like, some—some invitation because—so I got invited to, like, so basically, a big, sort of, Dem event, like, that was—but I'd received the invitation, like, the beginning of last year and then—and I still attended, even after I'd endorsed President Trump, and I didn't realize how profoundly that would affect, you know, how I was received. [Laughter]\nI mean, I walk into the room and I'm getting just the dirty looks from everyone. Like, if looks could kill, I would have been dead several times over.\nMr. Hannity.But that was not—[laughter]—before Trump\nSenior Adviser Musk.[Inaudible]\nMr. Hannity.Before Trump: \"BC\"——\nSenior Adviser Musk.——ashes on the floor. [Laughter]\nMr. Hannity. ——or \"BT.\" Before Trump, that never happened. Right?\nSenior Adviser Musk.No.\nMr. Hannity.No. So——\nSenior Adviser Musk.I—I just—doesn't seem strange? Like, what—what is up with this total, like, madness?\nMr. Hannity.You're smarter than me. Can you—I actually think that there's a level of irrationality. It's almost like a trigger and——\nSenior Adviser Musk.It totally triggers.\nMr. Hannity.And it's like—look, I've been on TV—this is my 29th year. I've been on radio 35 years. I will—I've gone hard in the paint to—for candidates that lost.\nSenior Adviser Musk.Yes.\nMr. Hannity.And guess what? I get over it.\nSenior Adviser Musk.Sure. Yes, yes.\nMr. Hannity.And I just keep doing my show, and I just—you know, I come back to fight another day.\nSo here's the big—then this is the million dollar or billion dollar—I'm among billionaires—question. So you have all this going on and you stop, in a way—you're still doing it—and you partner with him. And this is what you get for it from the Democrats. You get, \"nobody voted for Elon.\" Well, nobody voted for any of your Cabinet nominees. Okay? \"People are dying because of DOGE cuts.\" I'll give you a chance to respond to all that. \"What DOGE is doing is illegal.\" \"Elon Musk is\"—more street vernacular for a male body part. \"It's a constitutional crisis.\"\nSenior Adviser Musk.How come—why are they reacting like this?\nMr. Hannity.Well, first of all, do you give a flying rip? Number one. And——\nSenior Adviser Musk.Well, I guess we must be—if we're the target, we're doing something right. You know, if—like, they wouldn't be complaining so much if they—we weren't doing something useful, I think.\nWhat—all we're really trying to do here is restore the will of the people through the President. And what we're finding is there's an unelected bureaucracy. Speaking of unelected, there's a vast Federal bureaucracy that is implacably opposed to the—the President and the Cabinet.\nAnd you look at, say, DC voting. It's 92-percent Kamala. Okay, so we're in 92-percent Kamala. That's a lot.\nMr. Hannity.Yes. They don't like me here either.\nSenior Adviser Musk.I think about that number a lot. I'm like, 92 percent. That's, basically, almost everyone. And so—but if—but how can you—if the will of the President is not implemented, and the President is representative of the people, that means the will of the people is not being implemented, and that means we don't live in a democracy, we live in a bureaucracy.\nAnd so I think what we're seeing here is the—sort of, the thrashing of the bureaucracy as we try to restore democracy and the will of the people.\nMr. Hannity.You——\nSenior Adviser Musk.Is this making sense? I mean—sorry.\nThe President's Administration/Cabinet and Senior Staff/Government Contracting/Regulations\nMr. Hannity.You—no, of course it does. I mean, to me, if you look at our framers and our founders—and you've really become a student of history, Mr. President, and we've talked—we've had conversations both on air and off air—and if we talk about constitutional order or transformational change, nobody can argue that what's happening here is going at the speed of light.\nBut however, what were the principles of our Framers and our Founders? They wanted limited government, greater freedom for the people—and we'll get to the specific cutting of waste, fraud, and abuse. That is your goal, is it not?\nThe President.Yes. And my goal was to get great people. And when you look at what this man has done, I mean, it was something—I knew him a little bit through the White House. Originally, I'd see him around a little bit. I didn't know him before that, and I respected what he did. And he fought hard. You know, he was a—he was maybe questioned for a while. He was having some difficulties. It was not easy doing what he did.\nI mean, how many people have started a car company and made it really successful and made a better car where it's, you know, beating these big companies that that's all they do is cars? I mean, it's really amazing the things that he's done.\nBut I didn't know it as much then as now. I mean, the fruits have sort of taken hold.\nBut I wanted great people, and he's a great person. He's an amazing person. He's also a caring person. You know, he uses the word \"care.\"\nSo they sign a contract in a Government agency, and it has 3 months. And the guy leaves that signed the contract, and nobody else is there, and they pay the contract for 10 years.\nSo the guy is getting checks for years and years and years, and he's telling his family, obviously—maybe he was crooked, maybe he paid to get the contract, or maybe he paid that they didn't terminate him. But, you know, we have contracts that go forever, and they've been going for years, and they're supposed to end in 3 months or 5 months or 2 years or something, and they go forever. So the guy is either crooked—you know, where he knew this was going to happen—or he's crooked because he's getting payments that he knows he shouldn't be getting.\nSenior Adviser Musk.Yes.\nThe President.But they're finding things like that. They're finding things far worse than that. And they're finding billions—and it will be hundreds of billions of dollars' worth of fraud. I say waste and abuse, but fraud, waste, and abuse. And he's doing an amazing job.\nAnd he attracts a young, very smart type of person. I call them high-IQ individuals, and they are. They're very high Q and—high IQ. And when they go in to see the people and talk to these people—you know, the people think they're going to pull it over. They don't. These guys are smart, and they love the country. You know, there's a certain something.\nBut he uses the word \"care.\" So people have to care. Like, when I bought Air Force One——\nSenior Adviser Musk.Exactly.\nThe President.——I negotiated the price. It was $5.7 billion, and I got it—I got them down $1.7 billion. Now they're not building the plane fast enough. I mean, they're actually in default—Boeing. They're supposed to——\nMr. Hannity.When is it——\nThe President.They've been building this thing forever. I don't know——\nMr. Hannity.This is the new Air Force One?\nThe President.——what's going on.\nSenior Adviser Musk.Yes.\nThe President.We don't build the way we used to build. You know, we used to build like a ship a day, and now to build a ship is, like, a big deal, and we're going to get this country back on track. We could do it, but so many things—it takes so long to get things built and get things done.\nAnd a lot of it could be something we've been discussing. The regulators go in and they make it impossible to build. They make it very difficult to build anything, whether it's a ship, a plane, or a building or anything. And some of them do it because they want to show how important they are. Some of them do it maybe because they think they're right. They use the environment to stop progress and to stop things. It's always the environment. \"It's an environmental problem.\" It's not an environmental problem at all. But they do a lot of things.\nAnd by the way, speaking of that, Lee Zeldin is going to be fantastic in the position. So important. He could take 10 years to approve or disapprove something, or he could do it in a month. You know, just as good.\nMr. Hannity.Sure.\nThe President.And I think you're going to see some fantastic—a fantastic job done by him. He's a tremendous guy.\nMr. Hannity.Newt—you echoed something when I had just met you, and it was very similar to what Newt has been saying, that we're—he brought this country to the dance. This is the opportunity to be transformational, and to have, I would argue, a—the most consequential Presidency if we—if we'd really dig down and do something that had never been done before, and that is get rid of this bureaucracy. And I'm going——\nSenior Adviser Musk.Yes.\nMr. Hannity. ——to get to specifics. You say the same thing. It's not done yet.\nSenior Adviser Musk.Absolutely.\nNews Media\nMr. Hannity.And what did you mean by that?\nSenior Adviser Musk.Well, I mean the—winning the election is really the opportunity to fix the system. It is not fixing the system itself. So it's an opportunity to fix the system and to restore the power of democracy.\nAnd you know, people—like, it's funny how—how often it—you—when these attacks occur, the thing that they're accusing the administration of is what they are guilty of. They're saying that things are being done are unconstitutional, but what they are doing is unconstitutional. They are guilty of the crime of which they accuse us.\nThe President.That's always the first thing they do.\nSenior Adviser Musk.Yes.\nThe President.\"He's in violation of the Constitution.\" They don't even know what they're talking—well, they know.\nSenior Adviser Musk.It's absurd.\nThe President.It's just a con job. It's a big con job. And they're so bad for the country, so dangerous and so bad.\nAnd the media is so bad. When I watch MSNBC, which I don't watch much, but you have to watch the enemy on occasion, the level of arrogance and cheating and—they're just horrible people. These are horrible people.\nMr. Hannity.They lie.\nThe President.These are horrible people.\nMr. Hannity.They tell conspiracy theories.\nThe President.They lie, and they start up with the Constitution. They couldn't care less about the Constitution.\nCNN, likewise. I mean, I watched them asking questions with, you know, the hatred with the—why—I said: \"What are you asking the question with such anger? You're asking me a normal question.\" But you see the bias. The bias is so incredible. Those two are bad.\nPBS is bad. AP is bad. CBS is terrible.\nI mean, CBS now—they changed an answer in Kamala. They asked her some questions. She answered them like, you know, a low-IQ person. The opposite of him—the absolute opposite. But she gave a horrible answer. They took the entire answer out, and they put another answer that she gave 20 minutes later into the—in—as the answer.\nMr. Hannity.It was part of her word salad.\nThe President.I've never even heard of that before—I thought I heard of it all.\nSenior Adviser Musk.Right.\nMr. Hannity.That—\"60 Minutes\" once—one—wanted to do an interview with me, and I said, \"Live to tape.\"\nSenior Adviser Musk.Yes, exactly.\nMr. Hannity.They said, \"No.\" And I said, \"No\"——\nSenior Adviser Musk.Right.\nMr. Hannity.\"No deal.\"\nSenior Adviser Musk.Exactly. They can——\nMr. Hannity.Like, this interview will——\nThe President.I've never even heard—you know, I've seen where they take a sentence off or something and they'll do—but they——\nMr. Hannity.Sometimes you cut for time——\nThe President.No, no. They took the entire—this long, terrible statement that she made and put another.\nNobody's ever seen what's happening. And you know, the people that do all this complaining, they're very dishonest people.\nSenior Adviser Musk.Yes.\nMr. Hannity.Yes. I'm going to, just for the sake of saving time——\nThe President.Yes.\nThe President's Style of Negotiation\nMr. Hannity. ——because I could spend—and I've done this on radio and TV, I—I can spend an hour finding the outrageous amounts of money being spent abroad, like USAID.\nSenior Adviser Musk.Sure.\nMr. Hannity.And I do want to mention a couple, but I'm going to——\nSenior Adviser Musk.Yes.\nMr. Hannity. ——scroll it and——\nSenior Adviser Musk.Well, I guess, at a high level, I think it's what the President mentioned earlier, which is that in order to save taxpayer money, it comes down to two things: competence and caring. And——\nThe President.That's right.\nSenior Adviser Musk.——and when—when President was shown the outrageous bill for the new Air Force One and—and then negotiated it down, if he had—if the President had not applied competence and caring, the price would have been 50 percent higher—literally, 50 percent higher. The President cared. The President was competent. The price was not 50 percent higher as the result.\nAnd so, when you add more competence and caring, you get a better deal for the American people.\nThe President.But we could take—we were talking about this yesterday. I could take—give me thousands of bills—any—I could pick any one of them, and I could——\nSenior Adviser Musk.Yes, exactly.\nThe President.——take all thousand. And let's say it's a bill for $5,000—just $5,000, and it's done by some bureaucrat. And if he would say, \"I'll give you three. I don't want to pay you five. It's too high. I'll give you three.\" But they don't do that. If a guy sends in a bill for $5,000, they pay $5,000. They expect to be cut. Everybody expects to be cut. When you send in a bill, you expect to be cut. They send in the bill higher, for the most part. This is true with lawyers, legal fees. When they send in legal fees, you—I can cut—I wish I had the time, I would save so—but I could cut these bills in half—much better than half.\nBut you offer people a much lower number because you know they—they actually put fat—I'm not even saying it's—it's like a way of business. They put more on because they expect to be negotiated. When you send in a bill to the Government, there's nobody to negotiate.\nSenior Adviser Musk.Yes.\nThe President.You send it a bill for $10,000, and they send you a check back for $10,000. If you would call them and said, \"We'll give you five.\" \"No, no, no. I need more than five.\" \"We'll give you a five.\" \"I'm not going to pay any more than five.\" \"Make it six.\" \"No, I'm not going to make it six.\" And you'll settle for $5,500. You've just cut the bill almost in half, and it took, like, 2 minutes. When did that stop? But——\nMr. Hannity.[Inaudible]—the art of the deal?\nThe President.——that's caring. No, it's not even the art of the deal. It's caring. He uses the word—\nSenior Adviser Musk.It's competence and caring.\nThe President.——it's caring.\nMr. Hannity.Yes.\nThe President.It's a certain competence, but I think it's more caring.\nSenior Adviser Musk.I—if you——\nThe President.[Inaudible]\nSenior Adviser Musk.Actually, if you add either ingredient—either competence or caring—you'll get a better outcome. But it stands to reason——\nMr. Hannity.Right. People don't want to do this—[inaudible].\nSenior Adviser Musk.——that's the reason that if you don't have competency and you don't have caring, you're going to get a terrible deal. And the problem is that the American taxpayer has been—been getting a terrible deal, because—look at the last administration. Can you—can anyone—can any reasonable person say that last administration was either competent or caring?\nMr. Hannity.But they lied to us and said that Joe didn't have a cognitive decline.\nSenior Adviser Musk.They fully lied.\nMr. Hannity.They said the borders were closed. They said that the borders were secure. They said that——\nSenior Adviser Musk.Right.\nMr. Hannity.You know, they said Obamacare would save——\nSenior Adviser Musk.They flat out lied.\nMr. Hannity.They flat out lied——\nSenior Adviser Musk.It was insane.\nMr. Hannity. ——on many occasions.\nSenior Adviser Musk.Yes.\nMr. Hannity.I tell my audience all the time: Don't trust government.\nSenior Adviser Musk.Yes.\nMr. Hannity.So the—I want—as I scroll this information, and it's—I'll scroll a lot more than I'll mention to both of you, and this is the cost savings. I want you—I want people at home to understand this part: The average American makes $66,000 a year.\nSenior Adviser Musk.Yes.\nFederal Deficit and National Debt\nMr. Hannity.Okay? We have $37 trillion in National debt.\nSenior Adviser Musk.Yes.\nMr. Hannity.Now, all the money I'm about to mention and what we're going to scroll on our screen—and all of this is going to foreign countries. It is not being spent here in America——\nSenior Adviser Musk.Yes.\nMr. Hannity. ——for better schools, law and order.\nSenior Adviser Musk.I think the average taxpaying American should be mad as hell because their tax money is being poorly spent.\nMr. Hannity.I'm mad. It's stealing from——\nSenior Adviser Musk.It's a—it's an outrage——\nMr. Hannity. ——our kids and grandkids.\nSenior Adviser Musk.Yes, and the—and people——\nThe President.And a lot of fraud, Sean. A lot of fraud.\nMr. Hannity.Yes.\nThe President.And a lot of kickbacks.\nThey're sending money out. They're not that stupid. These people aren't that stupid. They're sending for transgender—something having to do with the opera, and they're sending out $7 million—\nSenior Adviser Musk.[Laughter] Literally.\nThe President.——$7 million. [Inaudible]\nMr. Hannity.You just stole my next line. I can't believe that.\nThe President.No, it's incredible.\nMr. Hannity.I was going to mention that.\nThe President.No, but it's incredible: $7 million.\nNow, you know they—they're not so stupid. They're sending all this money. They expect to get a lot of it back. And that's what happens.\nMr. Hannity.Okay. So let's go through it.\nSenior Adviser Musk.Yes, they're—a bunch of——\nMr. Hannity.So, for the average person at home——\nSenior Adviser Musk.——this stuff is round-tripping. To the President's point, they'll make it sound like it's going to help some people in a foreign country, but then they get kickbacks.\nMr. Hannity.All right. Let me go to the next—to the first——\nSenior Adviser Musk.Yes.\nMr. Hannity. ——to the second question first. I want to know, because people like Joni Ernst, and—and House——\nSenior Adviser Musk.Yes, Joni—Joni Ernst has been——\nMr. Hannity.They tried to get—\nSenior Adviser Musk.——has tried for a long time, and she's actually got a lot of good data. Senator Ernst has been really helpful, actually.\nMr. Hannity.Okay, but they actually hide what the real purpose of the spending is.\nSenior Adviser Musk.That's true.\nMr. Hannity.In other words, they—and this is a question: How did you decipher? It will say, \"Humanitarian blah, blah, blah in Serbia or Afghanistan.\" We've been giving money to China for crying out loud, which I think is nuts.\nSenior Adviser Musk.Well, we're giving money to the Taliban.\nMr. Hannity.Money to the Taliban?\nSenior Adviser Musk.Like a lot.\nMr. Hannity.All right. So——\nSenior Adviser Musk.[Laughter] I'm like, for what?\nMr. Hannity.But they——\nSenior Adviser Musk.I—I want to see pictures of what they did.\nMr. Hannity.But they try to obscure it, and—and—but then you got to the bottom line, which is what I'm now scrolling on the screen——\nSenior Adviser Musk.Yes.\nMr. Hannity. ——and that is: $20 million on a Sesame Street show in Iraq; $56 million to boost tourism in Tunisia and Egypt; $40 million to build schools in Jordan; $11 million to tell the Vietnamese to stop burning trash; $45 million for DEI scholarships in Burma; $520 million for consultant-driven ESG investments in Africa; DEI programs in Serbia; the President's favorite—I'm sure you—you love that taxpayer money was spent on a DEI musical in Ireland or a transgender opera in Colombia or a——\nSenior Adviser Musk.If I could, like, it sounds like——\nMr. Hannity. ——transgender comic book in Peru.\nSenior Adviser Musk.It sounds like—it sounds like how can these things be real? But this is actually what was done.\nMr. Hannity.Okay. The—I——\nSenior Adviser Musk.It—it sounds like a comedy sketch or something. It's like——\nMr. Hannity.I have 20 pages of this.\nSenior Adviser Musk.Right. It's not—the list is a mile long.\nThe President.The one thing you didn't mention, the media. The media is getting millions of dollars.\nSenior Adviser Musk.Yes.\nThe President.Now, they say Politico, which is a radical left——\nMr. Hannity.Subscriptions.\nThe President.——you know, garbage magazine or program. I guess they have magazine, and they have some—some media of all types. $8 million.\nI hear the New York Times got a lot. I hear they get subscriptions—where they have subscriptions but maybe the paper is not sent. I have no idea if that's true or not, but it's—they call it subscriptions. Lots of subscription—to different media, not just the Times—maybe the Times, and maybe not the Times.\nMr. Hannity.A million dollars in subscriptions is a lot.\nThe President.Well—but millions of dollars going to media that's radical-left, crooked, dishonest media.\nSenior Adviser Musk.Well, Reuters—this is actually really wild: Reuters got like—something like $10 million for something that was literally titled \"mass disinformation campaign.\"\nMr. Hannity.Well——\nSenior Adviser Musk.That was on the purchase order. Well, I thought that was a little bold. [Laughter]\nMr. Hannity.I will tell you what was bold is when you released——\nSenior Adviser Musk.I'm like——\nMr. Hannity. ——the Twitter files.\nSenior Adviser Musk.——shouldn't you at least try to call it something else? [Laughter]\nMr. Hannity.The Twitter files—how they targeted him; how Twitter, at the time, worked closely with the FBI, the CIA; and, even before the release of Hunter's very real laptop, they were feeding them disinformation. That——\nSenior Adviser Musk.Absolutely.\nMr. Hannity. ——you found all that out.\nSenior Adviser Musk.Well, I think——\nFederal Bureau of Investigation\nMr. Hannity.That's called transparency, right?\nThe President.The FBI has to be rehabbed. The FBI——\nSenior Adviser Musk.Yes.\nThe President.What's happened with the FBI and the DOJ is just—their stock has gone way down. I mean, their reputation is shot.\nMr. Hannity.And intelligence.\nThe President.And I think Pam is going to do great. I think Kash is going to do great. I think they have to do great or we have a problem.\nBut when you look at what they did, the raid of Mar-a-Lago—the raid of Mar-a-Lago—you look at what they did, their reputation is shot.\nMr. Hannity.It is.\nWhat—you were going to say, Elon?\nSenior Adviser Musk.Well, no, I was going to say that I think probably a—like, a lot of people still——\nMr. Hannity.How did you find—[inaudible]?\nSenior Adviser Musk. ——still believe, like, the Russia hoax, even though you've done a lot to combat that. The—you know, the Steele dossier was an—a massive scam that was concocted by Hillary Clinton and her campaign.\nMr. Hannity.She bought and paid it—for it——\nSenior Adviser Musk.Right.\nMr. Hannity. ——Russian disinformation.\nSenior Adviser Musk.There was—it was—the—people still think the Russia hoax is real. Like a lot of people—because they never—they never heard the counterpoint. I mean—I mean, a bunch of people should be in prison for that. That was a—that was outrageous election interference, creating a fake Russia hoax.\nMr. Hannity.How much—if you had to put a number on it, how much do you think you've identified waste, fraud, abuse, corruption at this point? And again, we've been—we're going to be scrolling this throughout the program.\nSenior Adviser Musk.Well, the overall goal is to try to get a trillion dollars out of the deficit. And if we—if the deficit is not brought under control, America will go bankrupt. This is a very important thing for people to understand. A country is no different from an individual, in that if an individual overspends, an individual can go bankrupt, and so can a country.\nAnd the out—the massive waste, fraud, and abuse that has been going on, which is leading to a $2-trillion-a-year deficit, that—that's what the President was handed on Jan. 20, a $2 trillion deficit. It's insane.\nGovernment Spending Reductions\nMr. Hannity.For this fiscal year?\nThe President.Two trillion—yes. We inherited it.\nSenior Adviser Musk.Two——\nThe President.Yes. And inflation is back. I'm only here for 2½ weeks.\nMr. Hannity.That was January——\nThe President.Inflating is back——\nMr. Hannity. ——you were there for a week.\nThe President.No, think of it, inflation is back. And they said, \"Oh, Trump inflation\"—I had nothing to do with it. These people have run the country. They spent money like nobody has ever spent. They were given $9 trillion to throw out the window—$9 trillion, and they spent it on the green new scam, I call it. It's the greatest scam in the history of the country. One of them. We have a lot of them, I guess. But one of them.\nMr. Hannity.Well——\nThe President.Dollar-wise, probably——\nMr. Hannity. ——and DEI——\nThe President. ——it is.\nMr. Hannity. ——and wokeism——\nThe President.Yes, yes.\nMr. Hannity. ——and transgenderism——\nThe President.Well, that's all part of it. Yes.\nMr. Hannity. ——and LGBTQ+.\nSenior Adviser Musk.Yes.\nMr. Hannity.And by the way, not in America—other countries, not here.\nThe President.You know, the amazing thing is, when you see, like, the teaching of DEI: $9 million. How do you spend $9 million to teach no matter what it is?\nSenior Adviser Musk.Right.\nThe President.You could teach physics.\nSenior Adviser Musk.Exactly. Totally.\nThe President.You could go to MIT for a lot less.\nSenior Adviser Musk.It's like expensive. [Laughter] Expensive.\nThe President.Yes, the teaching——\nSenior Adviser Musk.Expensive BS.\nThe President. ——of DEI.\nMr. Hannity.Well, I think it would be better spent on——\nThe President.No, it's a kickback. It's got to be a kickback. Nobody is that—nobody could do that. Nobody is——\nMr. Hannity.Well, it——\nThe President.Nobody is giving—to assess the dialog of an audience coming out of a theater: $4 million.\nMr. Hannity.How much do you believe, Elon, you've identified in—in waste, fraud, abuse, corruption now? And how much——\nSenior Adviser Musk.Well——\nMr. Hannity. ——do you anticipate you will?\nSenior Adviser Musk.Sure. Well, the—I think——\nThe President.One percent. [Laughter] No, because it's so massive. It's—this is——\nSenior Adviser Musk.Yes, exactly.\nThe President.——huge money. Huge money. Look——\nGovernment Spending Reductions\nMr. Hannity.So what we've found now is 1 percent?\nSenior Adviser Musk.Well, we've just—we've just gotten started here.\nThe President.As good as they are, they're not going to find some contract that was crooked—you know, crooked as hell. And, I mean, there's going to be so much that isn't found. But what is found—I think he's going to find a trillion dollars.\nSenior Adviser Musk.Yes, I think so.\nThe President.But I think it's a very small percentage compared to what it is. I mean, he could tell you about treasuries; he could tell you about a woman that worked for Biden that became a very wealthy woman while she was working for him. Right?\nSenior Adviser Musk.Yes.\nMr. Hannity.Yes, I know who you're talking about.\nSenior Adviser Musk.I mean, there are some strange situations where people—where, you know, someone's working for the Government earning $200,000 a year, and then, suddenly, they're worth tens of millions of dollars within a few years. Where'd the money come?\nMr. Hannity.How'd they earn it?\nSenior Adviser Musk.Yes.\nMr. Hannity.They have a private company on the side?\nSenior Adviser Musk.We're just curious. Like, can you——\nThe President.While they were working.\nSenior Adviser Musk.Can you show us—because, like, in order to be worth tens of millions of dollars, you'd have to start a company, or you've got to get some kind—the compensation has got to come from somewhere. So how does a civil servant with—earning $200,000 a year suddenly, within a span of a few years, be worth tens of millions dollars?\nMr. Hannity.We——\nSenior Adviser Musk.So, I just want to connect the dots here.\nMr. Hannity.All right, so——\nSenior Adviser Musk.Maybe there's a legitimate explanation, but I don't think so. [Laughter]\nMr. Hannity.So, you know, and this gets to kind of the heart of where I am. I looked at your work, and I look at this amount of money, and I get angry. And I don't get—I'm not an angry person.\nSenior Adviser Musk.Sure.\nMr. Hannity.I don't get angry. I get annoyed sometimes, but I don't get angry.\nAnd I did live paycheck to paycheck a part of my life. And I think of, you know, the working men and women in this country that the—56 percent of which cannot afford a $1,000 emergency after 4 years of Harris and Biden.\nSenior Adviser Musk.Sure.\nMr. Hannity.Okay? That is serious, you know, financial trouble. Or they're putting bare necessities on credit cards.\nAnd I'm looking at this and I'm thinking, well, how much—when we—when all is said and done, we could have written a check or cut the taxes or fixed our schools——\nSenior Adviser Musk.Yes. Yes.\nMr. Hannity. ——or deported these illegals that we keep finding, known terrorists, cartel members, gang members.\nSenior Adviser Musk.Yes.\nMr. Hannity.And—and we're not doing it.\nThe President.Sean, the saddest thing is they don't talk about the individual lines. I could go on your show right now, I could get a list that I have on the beautiful Resolute Desk in the Oval Office, and it's got 40 points, and all they are is the heading of what this money is.\nYou don't have to go deep into it, and you see it's, you know, all different things and it's so ridiculous. I mean, normally, when you look for fraud, you're looking for one thing out of a hundred. Here, out of a hundred, 95 are going to be bad. I mean, they're—and they're so obvious just by the heading.\nBut they never mention that. They only mention: \"This is a violation of our Constitution. This is a\"—the word they give, you know, it's like a sound bite—\"constitutional crisis.\" It's a new thing, \"constitution\"—but they never mention about where the money is going.\nSenior Adviser Musk.Yes. Exactly.\nThe President.And when people hear that—I had a very smart man, John Kennedy—he's actually a very smart man. He said, \"Sir, you should just go on television and just read the name of the topic that you're giving all the money—just the topic that you're giving this money to, and don't say anything more,\" and he's right.\nSenior Adviser Musk.Yes.\nThe President.And I'll do it at some point, you know, when——\nBut they never talk about where the money is going. They just talk about, \"It's a constitutional crisis.\"\nIt's so sad. And honestly, I think they're bad people. I used to give them the benefit of the doubt, but you almost think they hate the country. I think they hate the country. They're sick people.\nMr. Hannity.Remember, what they can't—what they couldn't accomplish at the ballot box, what they can't accomplish legislatively, now they're using the courts.\nSenior Adviser Musk.Yes.\nMr. Hannity.And they can—they're trying to bury you in lawsuits.\nThe President.That's right. You know the good news, though? They've lost their confidence. They're not the same people.\nMr. Hannity.I think you're right.\nThe President.They're not the same people. This election was brutal for them. We won every swing State. We won by millions and millions of votes. We won everything. We—all 50 States went up—all 50. It's never happened.\nMr. Hannity.Popular vote.\nThe President.Every one. All 50 States went up.\nThey've lost their confidence. I see it. And they're just swirling and twirling. They don't know what the hell is happening. They're much different. They're just as mean, but they're not getting to the point.\nNews Media/Entitlement Programs/Education\nMr. Hannity.Why do you invite them into the Oval Office nearly every day? [Laughter]\nThe President.Well, the media—you're talking about the media.\nMr. Hannity.Yes, your friends in the media.\nThe President.The media—no, they're—you know, the anger that—they ask questions so angry—a question—a normal question. I give them an answer. They—but they—I say, \"Why are you so angry when you ask a question?\" Just a standard question. And, I don't know, there's something——\nMr. Hannity.They haven't had a—they haven't been allowed in that office for the last 4 years, and here you're giving them access.\nLet me go to an area that I think is key, and—and you talked about this in recent interviews, and that is: We don't need a Department of Education. Okay. And what some people are trying to do is stoke fears that, \"Oh, my gosh, my kid is not going to get the money for education.\" [Laughter]\nThe President.Yes.\nMr. Hannity.Or \"grandma's Social Security and Medicare.\" This was a big promise of yours on the campaign trail.\nThe President.Yes. Yes.\nMr. Hannity.So I really want to give you both an opportunity to assure the American people you will keep—that money will be allocated for students, but with higher standards. For example, I would assume associated with monies given or vouchers.\nThe President.I just—[inaudible]—so much and—and then Elon goes. But look, Social Security won't be touched——\nMr. Hannity.Won't be touched.\nThe President.——other than if there's fraud or something—we're going to find it; it's going to be strengthened—but won't be touched. Medicare, Medicaid, none of that stuff is going to be touched. It's just——\nMr. Hannity.Nothing. I want you to——\nThe President.[Inaudible]—don't have to.\nNow, if there are illegal migrants in the system, we're going to get them out of the system, and all of that fraud. But it's not going to be touched.\nSchool—I want to bring school back to the States, so that Iowa, Indiana—all these places—Idaho, New Hampshire—there's so many places, the States. I figure 35 really run well.\nAnd right now, it's Norway, Sweden, Denmark, Finland, China—China, can you imagine?—has top schools. We're last.\nSo they have a list of 40 countries. We're number 40. Usually we're 38, 39, but last time, we were number 40. And what I say is you've got to give it back. So it doesn't work.\nI'll tell you what we're number one in: cost per pupil. We spend more money than any other country by far—it's not even close—per pupil. Okay? So, we know it doesn't work.\nSo we spend the most and we have the worst—right?—the worst result. When we give that—when we give that back to Indiana, when we give that back to Iowa and back to a lot of the States that run well—they run well, a lot of them—35, 37, 38—now, you're going to have 10 laggards, but you're going to have 5 real laggards, but that's going to be okay.\nTake New York—you give it to Westchester County, you give it to Suffolk County, you give it to Upstate New York, and you give it to Manhattan—but you give it to four or five subsections. Same thing in California. Los Angeles is going to be a problem, but you're going to give it to places that run well. We can change education\nNow, school choice is important, but that will get care—taken care of automatically.\nWe want to bring education back to the States. You will spend half the number.\nEducation/Health Care\nMr. Hannity.So you're leaning more towards grants not vouchers——\nThe President.And I'm not even doing this——\nMr. Hannity.—like to parents?\nThe President.I'm not even—I'm not even doing this to save, but you will save. It will cost you much less money. You get a much better education.\nIf you go to some of these States, you'll be the equivalent of Norway, Sweden, Denmark—places that really have a good school system. You'll have—those places will be the equivalent, and your overall numbers will get so much better.\nMr. Hannity.Do you want standards associated with the money?\nThe President.The only thing I want to do from Washington, DC, is make sure they're teaching English, reading, writing——\nMr. Hannity.Math and science.\nThe President.——and arithmetic. Okay?\nMr. Hannity.Science? Science might help.\nThe President.Okay. A little science. You know——\nMr. Hannity.Computers.\nThe President.——you're not going to have much of a problem with that, but that's it.\nDo you know, we have half the buildings—I mean, you look at Department of Education——\nSenior Adviser Musk.It's empty.\nThe President.Look at the real estate and the——\nSenior Adviser Musk.Yes.\nThe President.——the level. For what? To—I mean, for—what do they do?\nWe have really bad education—the teachers—I love teachers. I respect teachers. And, by the way, there's no reason why teachers can't form a union. They can do whatever they want to do, if it's back in the States. So we're not looking to hurt the teacher—I'm going to help the teachers. I think the teachers should be incentivized, because a good teacher is like a good scientist, is like a great doctor.\nSenior Adviser Musk.Sure.\nThe President.It's a valuable commodity.\nSenior Adviser Musk.Yes.\nThe President.I think they should be incentivized.\nSenior Adviser Musk.Yes.\nThe President.So I'm totally for the teachers.\nSenior Adviser Musk.Absolutely.\nMr. Hannity.I interview a guy a lot on radio. He's from Wichita, Kansas. And he started——\nThe President.Right.\nMr. Hannity. ——as a medical doctor. Started Atlas MD, and he's now—he's rolled it out nationwide. Concierge care, $50 a month, 24-hour access to a doctor.\nThe President.Right.\nMr. Hannity.You know, they use a lot of telemedicine now as part of it—very innovative. He negotiates directly with pharmaceutical companies. People—if they have high blood pressure, they walk out with their medicine. They have high cholesterol, they walk out with their medicine. And they pay pennies on the dollar.\nYou mentioned——\nThe President.By the way, forms of that could be done.\nMr. Hannity.Forms of that?\nThe President.Forms of that could be done.\nMr. Hannity.Innovation.\nThe President.We got hurt when we didn't get the vote on Obamacare. I made Obamacare—I had a choice: I could let it rot and win a point, or I could do the best you could do with it. And that's what I did. We did a great job with it, and we made it sort of work, but it's lousy. We could do so much better.\nAnd when you say—you go to certain areas, they have doctors round the clock. They have great medical care for a fraction of what we're paying right now.\nThere are things we could do. But look, just overall, this man has been so valuable. I hate to see the way they go after him. They go after him. It's so unfair. He doesn't need this. He wants to do this.\nFirst of all, this is bigger than anything he's ever done. He's done great companies and all, but this is much—you know, this is trillion—everything's trillions, right?\nSenior Adviser Musk.Yes. The numbers are crazy.\nMr. Hannity.To go back to my original point——\nThe President.He can save——\nSenior Adviser Musk.Yes.\nMr. Hannity.But let me—give him his $10 million back.\nSenior Adviser Musk.Well, well—I—no. So people ask me, like, \"What's—what's the—what's the—what's, like, the—what's your biggest surprise in DC?\" And I'm like, \"The sheer scale.\"\nMr. Hannity.It's massive. So you love the challenge?\nSenior Adviser Musk.Well, I mean, to——\nThe President.He'll never do anything bigger.\nSenior Adviser Musk.To the President's point——\nThe President.That's the only thing you can say, \"He'll never do anything\"——\nSenior Adviser Musk.But, I mean, you do something slightly better, and you save billions of dollars for the American taxpayer—just slightly better. Slightly. [Laughter]\nMr. Hannity.When you say \"tech support\"——\nSenior Adviser Musk.You go 1-percent better, and it's, like, you know, tens of billions of dollars saved to the American taxpayer.\nNow, if I may address the point that you—the question you asked earlier, which is, you know, how do we assure people that——\nMr. Hannity.They want to know.\nSenior Adviser Musk.Yes, how do we assure people that we're going to do the right thing, that their—that their Social Security benefits will be there, that their—the medical care will be good and—in fact, how do we make it—ensure that there's better medical care in the future? How do we improve their benefits? How do we make sure that their Social Security check goes further than it did in the past and not—it doesn't get weakened by inflation?\nSo the—if we address the—the massive deficit spending, the sort of—the waste in the Government, then—then we can actually address inflation.\nSo, provided the economy grows faster than the money supply, which means you stop the Government overspending and the waste, and the output of real useful goods and services exceeds the increase in the money supply, you have no inflation.\nMr. Hannity.Yes.\nSenior Adviser Musk.And—and you also drop the—the interest payments that people pay, because if the Government keeps——\nMr. Hannity.Way too high.\nSenior Adviser Musk.Yes. The—the reason the interest payments are so high is because the—the national debt keeps increasing. So the Government is competing for—to sell debt with—for—with the private citizens. This drives up the interest rate.\nSo, if you have a—if you have a—if you cut back on the deficit, you actually have an amazing situation for people, because you get rid of inflation and you drop the interest rates. And that means people's mortgage payments go down, their credit card payments go down, their car payments go down, their student loans go down. Everything—their life becomes more affordable and they're standard of living improves.\nMr. Hannity.How quickly? Because I think people are suffering now. We're still living under the Biden-Harris economy.\nThe President.But, Sean, you have States right now——\nMr. Hannity.Yes.\nThe President.You have some States that operate that way. They operate as well as any corporation. They really operate well.\nSenior Adviser Musk.Yes.\nMr. Hannity.Florida.\nThe President.They have surpluses. They have—they don't——\nSenior Adviser Musk.Texas is—has a surplus, for example.\nMr. Hannity.Yes.\nThe President.When they—when they look at New York and—and California and some of these places that should have an advantage—I mean, there's a big advantage—or Pritzker does such a bad job in Illinois; it's horrible how bad he is—and they don't have that advantage.\nYou know, New York has stock exchange and a lot of things. And California has the weather and the beautiful water and all the thing-—\nSenior Adviser Musk.California has—has great weather. The most expensive weather on Earth.\nThe President.Yes. [Laughter] But—but——\nMr. Hannity.I like Florida.\nSenior Adviser Musk.Yes.\nThe President.But some States operate the way he's talking about.\nMr. Hannity.Efficiently.\nThe President.When you go into some of these States, you're going to find very little. You're going to find almost nothing. They really operate well—big surpluses, low taxes. And——\nMr. Hannity.You know, my taxes went up the first time you were President, because you took away the SALT deduction——\nThe President.I—well, I did.\nMr. Hannity. ——which, by the way, I thought was the right decision.\nThe President.It was the right decision—in fact, Reagan tried to do it—because it rewards badly run States.\nBut at the same time, it's a tough—it was—it's tough for the States. I mean, it really is tough for the States. The sad part is, it rewards really badly run States.\nMr. Hannity.Yes.\nThe President.And Reagan tried to do it. He was unable to do it. I got it done.\nMr. Hannity.You got it done, and——\nThe President.And now we're going to give some back.\nMr. Hannity.A little bit.\nThe President.Because you know what? We've got to help them.\nMr. Hannity.It's only a little.\nThe President.We've got to help.\nMr. Hannity.Because otherwise—we're encouraging people to elect high taxes, spending—\nThe President.Nobody had any idea it would be that devastating. I did the right thing. I got something that Reagan couldn't do. I got it done, where everybody is—are the same. But you know what? We've got to help them out.\nMr. Hannity.Reagan had the Grace Commission, some of the best business minds in the country.\nThe President.Right.\nMr. Hannity.And they came up with recommendations. Congress adopted none of them, and none of them were implemented.\nI've got to ask this question, because the media is obsessed about it: What if there is a conflict? In other words, because you do business—it was funny, when it came out the other day, that there was going to be, I think, $400 million—billion—I don't know if it was millions or billions—a lot of money on Teslas that Joe Biden's administration—did with Tesla, and——\nSenior Adviser Musk.I'm not familiar with that.\nMr. Hannity.You're not even familiar with it? But——\nSenior Adviser Musk.I don't think—are you talking about, like, the Inflation Reduction Act stuff or——\nMr. Hannity.It was some—it was a purchase order of Tesla vehicles.\nSenior Adviser Musk.Oh. Oh, that was—that was incorrect. There was—like, there's some sort of—the media claim that there was, like, $400 million worth of Cybertrucks——\nMr. Hannity.That was it.\nSenior Adviser Musk.——being bought by the DOD.\nMr. Hannity.And that he gave it to you.\nSenior Adviser Musk.No—well, first of all, that was——\nThe President.No, actually, it was—\nSenior Adviser Musk.That—it was fake——\nThe President.It was Biden.\nMr. Hannity.It was Biden.\nThe President.And you know Biden wouldn't give him much.\nSenior Adviser Musk.But—but it wasn't even—it was fake news, 6 weeks to Sunday. Tesla is not getting $400 million for Cybertrucks. And the—and this alleged——\nMr. Hannity.That's what it was, Cybertrucks.\nSenior Adviser Musk.This—yes. This alleged award occurred in December, before the President took office. So it's fake on multiple levels. There is—Tesla isn't getting $400 million. And even if it—even if it was, which it isn't, it was awarded during the Biden administration.\nMr. Hannity.Okay, but you're—you——\nSenior Adviser Musk.It's total fake news.\nMr. Hannity.There—there is——\nSenior Adviser Musk.It's fake on, like—it's like multiple levels——\nMr. Hannity.There is some integration——\nSenior Adviser Musk.——multiple layers of fake.\nMr. Hannity.So you're—you're tasked now—and I pray to God this is successful. I really do. I wish you Godspeed.\nSenior Adviser Musk.Yes.\nMr. Hannity.You know, \"Godspeed, John Glenn.\"\nThe President.It's—it's going to be, by the way. I really believe it's going to be.\nMr. Hannity.But—but there——\nSenior Adviser Musk.Oh, yes.\nMr. Hannity.But there are legitimate areas——\nThe President.Because the country is going to do well beside this. This is cutting. We're only talking about cutting.\nWe're also going to make a lot of money. We're going—we're taking in so much money.\nGovernment Ethics/Federal Contracting\nMr. Hannity.But what about his business? What if—if there is——\nThe President.Then we won't let him do it.\nMr. Hannity. ——a contract he would otherwise get?\nThe President.We're not going to let him do it. He—if——\nMr. Hannity.You're not going to let him do it?\nThe President.If he's got a conflict—I mean, look—he——\nMr. Hannity.You—now you——\nThe President.He's in certain areas—I mean, I see this morning—I didn't—I didn't know, but I said, \"Do the right thing\"—where they're cutting way back on the electric vehicle subsidies.\nSenior Adviser Musk.Yes.\nThe President.They're cutting back.\nMr. Hannity.You're losing——\nThe President.Not only cutting back——\nMr. Hannity.It hurts you.\nSenior Adviser Musk.Correct.\nThe President.Yes.\nNow, I will tell you——\nMr. Hannity.You don't care?\nSenior Adviser Musk.Well——\nThe President.He's probably not that happy with it, but that would have been one thing he would have come to me and said: \"Listen, you've got to do me a favor. This is crazy.\" [Laughter] But this was in the tax bill. They're cutting back on the subsidies.\nI didn't—I wasn't involved in it. I said, \"Do what's right, and you get\"—and they're coming up with the tax, but it's just preliminary.\nBut I mean, if he were involved, wouldn't you think he'd probably do that? Now, maybe he does better if you cut back on the subsidies. Who knows. Because he figures—he does think differently. He thinks he has a better product, and as long as he has a level playing field, he doesn't care what you do——\nSenior Adviser Musk.Exactly.\nThe President.——which he's very—he's told me that.\nSenior Adviser Musk.Yes. I mean, I haven't asked the President for anything ever.\nThe President.It's true.\nMr. Hannity.And if it comes up, how—how will you handle it? [Inaudible]\nSenior Adviser Musk.Well——\nThe President.He won't be involved.\nSenior Adviser Musk.Yes, I'll recuse myself if it is a conflict.\nThe President.If there's a conflict, he won't be involved.\nSenior Adviser Musk.Yes.\nThe President.I mean, I wouldn't want that, and he won't want it.\nSenior Adviser Musk.Right. And also, I'm getting a—sort of a daily proctology exam here. You know, it's not like I'll be getting away from something in the dead of night.\nMr. Hannity.Welcome to DC. If you want a friend, get a dog.\nSenior Adviser Musk.Well, I do have a dog, but I also have friends. [Laughter] My dog loves me, poor little creature.\nThe President.You know the truth was——\nSenior Adviser Musk.I need to bring him to DC.\nThe President.He's—I know every businessman. I know the—the good ones, the bad ones, the smart ones, the lucky ones. I know them all. This guy is a very—he's a brilliant guy. He's a great guy. He's got tremendous imagination and scientific imagination—far beyond—you know, you keep talking about a technologist and all, but you're much more than a technologist. You are that. But he's also a good person. He's a very good person, and he wants to see the country do well.\nAnd I know a lot of great businesspeople, really great businesspeople, but, you know, they're not really, in some cases, very good people. And I know people that would try and take advantage of the situation.\nThis guy is somebody that really cares for the country, and I saw that very early on. I saw it, really, a long time ago when I got to know him. He's a very different kind of a character.\nThat's why—you know who loves him: young people that are very smart and that love the country. He's got, like, a tremendous following, because that's what he's—he's a good person.\nAnd he doesn't need this. He didn't need this, and he's doing this to help the country. If I didn't win this election, this country was—I don't think it could have made it. I don't—I mean, we're allowing criminals—millions of criminals into our country, where everything is transgender, it's men playing in women's sports.\nI mean, none of this stuff—you could go—I could give you a hundred things. It's almost like they're trying to destroy the fabric of the country, of the world, because the world was following us. Now the world is following us out of this pit.\nWe've done a lot. I'll tell you what, in 3 weeks, we've done more—I think we've done more—in terms of meaningful, not just dollars—than maybe any President ever. And a lot of people are saying that.\nMr. Hannity.Shock—it's been shock and awe.\nThe President.I mean, if we can keep it going at this level, this country is going to be at a level that it's never seen before.\nTariffs/U.S. Trade Policy\nMr. Hannity.You know one of the things you did that I really thought was pretty clever and smart and fair, and that was reciprocal tariffs.\nThe President.Yes, reciprocal.\nMr. Hannity.Tariffs—I didn't know India charged so much. I didn't know the European Union to charge them.\nSenior Adviser Musk.Yes, totally.\nMr. Hannity.I didn't know Canada was charging us.\nThe President.Everybody. Everybody. Everybody but us.\nMr. Hannity.Brazil, why?\nThe President.And I was doing it—you know, I charged China tariffs. I took in hundreds of billions of dollars, and I was doing that. But when we got—we had the greatest economy in history. But then we got hit with COVID, and we had to solve that problem, because I was doing it—and now I said, I want to come back and do the reciprocal—because every country in the world almost—we have a deficit with almost every country—not every one, but just about, pretty close.\nAnd—but every country in the world takes advantage of us, and they do it with tariffs. They makes—make it—it's impossible for him to sell a car, practically, in, as an example, India. I don't know if that's true or not, but I think——\nSenior Adviser Musk.The tariffs are like 100-percent import duty.\nThe President.The tariffs are so high——\nSenior Adviser Musk.Yes.\nThe President.——they don't want to—now, if he built the factory in India, that's okay, but that's unfair to us. It's very unfair.\nAnd I said, \"You know what we do?\" I told Prime Minister Modi yesterday—he was here. I said: \"Here's what you do. We're going to do—be very fair with you.\" They charge the highest tariffs in the world, just about.\nMr. Hannity.Thirty-six percent?\nThe President.Oh, much—much higher.\nSenior Adviser Musk.It's 100 percent on—auto imports are 100 percent.\nThe President.Yes, that's peanuts. So much higher. And others too. I said: \"Here's what we're going to do: reciprocal. Whatever you charge, I'm charging.\" He goes, \"No, no, I don't like that.\" \"No, no, whatever you charge, I'm going to charge.\" I'm doing that with every country.\nSenior Adviser Musk.It seems fair.\nMr. Hannity.Don't you——\nThe President.[Laughter] It does.\nSenior Adviser Musk.It's, like, fair is fair.\nThe President.Nobody can argue with me. You know, the media can't argue—I said—they said, \"Tariffs—you're going to charge tariffs?\" You know, if I said, like, 25 percent they'd say, \"Oh, that's terrible.\" I don't say that anymore——\nMr. Hannity.Can I—[inaudible]——\nThe President.——because I say, \"Whatever they charge, we'll charge.\" And you know what?\nMr. Hannity.They stop.\nThe President.They—then they say, \"Oh, that sounds fair.\"\nSenior Adviser Musk.All the President is saying is that——\nMr. Hannity.[Inaudible]\nSenior Adviser Musk.——it needs to be at a level playing field and—and fair and square.\nMr. Hannity.Yes. And how does—how——\nThe President.And we're going to make a lot of money, and a lot of businesses are going to come pouring in.\nSenior Adviser Musk.How can you argue with a fair-and-square situation?\nMr. Hannity.Don't—don't you think most of them will look at the—for example, without America, China's economy will tank. They need our business.\nThe President.They do. Everybody needs us.\nMr. Hannity.Everybody needs it.\nThe President.And you know what?\nMr. Hannity.Don't you think they'll stop?\nThe President.We only have so long left where we're in this position. We're the bank, and the bank is getting smaller and smaller and smaller. We're the bank. We got to do this now. We can't wait another 10 years and have a shell of a country left, because that's what was going to happen.\nMr. Hannity.Mr. President——\nThe President.This country—if I didn't win this election and have people like this man right here that really do care, because that's the other word—if you don't care, you could be the smartest guy in the world, it's not going to matter. But if we didn't win this election, I'm telling you, we would not have had a country for very long.\nMr. Hannity.How quickly——\nSenior Adviser Musk.May I say——\nFederal Deficit and National Debt\nMr. Hannity. ——do you balance the budget and—and when do we start paying down that debt?\nThe President.Well, potentially, very quickly, between what he's doing and with income coming in from tariffs and other things. I mean, I hope we can—I don't want to give a date, because then these people are going to say, \"Oh, well, he didn't make the date.\" But I think we can do it very quickly.\nWe would have never done it if this didn't happen. Never. It would have never been—it would only get worse and worse, and ultimately, it would have exploded.\nThis country was headed down a very bad track. And the whole DEI thing, that was a trap. That was a sick trap.\nMr. Hannity.[Inaudible]\nSenior Adviser Musk.[Inaudible]\nThe President.And you know, we've destroyed that. That's gone—that's pretty much gone.\nMr. Hannity.I agree.\nSenior Adviser Musk.[Inaudible]\nMr. Hannity.We're not—we're not funding it.\nSenior Adviser Musk.If—I really want to—I really want to emphasize to people that—this is a very important point—if we don't solve the deficit, there won't be money for medical care. There won't be money——\nThe President.Right.\nSenior Adviser Musk.——for Social Security. We either solve the deficit or all we'll be doing is paying debt.\nMr. Hannity.Nobody——\nSenior Adviser Musk.It's—it's got to be solved, or there's no medical care, there's no Social Security, there's no nothing. That's got to be solved. It's not optional. America will go bankrupt if this is not done. That's why I'm here.\nMr. Hannity.The President's——\nThe President.Europe takes advantage of us.\nSenior Adviser Musk.And I'd like to also just send a message—like, because, as the President said, like, this—there's a lot of rich people out there. They should be caring more about the country because—the reason they should be caring about—more about country is: America falls, what do you think is going to happen to your business? What do—what do you think—do you think you're be going to be okay if—if the ship of America sinks? Of course not.\nLike, what—what I'm doing here, what the President is doing is it's just long-term thinking. The ship of America must be strong. The ship of America cannot sink. If it sinks, we all sink with it.\nThe President.Sean, you're a——\nMr. Hannity.This is what—this is what drives you?\nSenior Adviser Musk.Yes.\nMr. Hannity.This is important. It says, \"Tech Support.\" So you're not trying to be President, as the media suggests. You are really here because your heart and your passion is this. And the President described you as being—this is the biggest thing you ever done. Now you trying to bring sight to——\nThe President.There could be nothing bigger. There's nothing——\nMr. Hannity.You're sending ships up to Mars—you know, spaceships up in the sky all the time—\nThe President.That's peanuts.\nMr. Hannity. ——and saving astronauts. That's pretty big.\nThe President.That's peanuts compared to what we're talking about.\nMr. Hannity.It's peanuts?\nThe President.Yes.\nMr. Hannity.Do you agree with that?\nSenior Adviser Musk.Well, it's essential that America be healthy, that America's economy be strong. And if that—if—basically, like, my concern is like, if America is the central pillar holding up Western civilization. That pillar must be strong. If that pillar falls, the whole roof comes crashing down.\nThe President.Including his ships.\nSenior Adviser Musk.There's no place to hide.\nThe President.Including his ships going up.\nSenior Adviser Musk.There's no place to run.\nThe President.Nothing. There's nothing left.\nMr. Hannity.Why, if this is your goal, your motivation, you're losing money in the process, you're offering—you do all these nice things for people for free; you're trying to solve, you know, blindness; you're going to rescue astronauts; you help the people in North Carolina, California; you're cutting money that was sent abroad that's not helping the American people, then why the rage——\nSenior Adviser Musk.Actually, I think it was like——\nMr. Hannity.But why this rage?\nSenior Adviser Musk.——it was not helping the American people and hurting people overseas, to be clear.\nMr. Hannity.Why this rage against you now? First, they hated him. Now they hate both of you.\nSenior Adviser Musk.Well, I think we're seeing an antibody reaction from—from those who are receiving the—the wasteful and fraudulent money.\nMr. Hannity.They're being exposed.\nSenior Adviser Musk.Yes.\nMr. Hannity.Nobody wants to be exposed when you're corrupt.\nSenior Adviser Musk.I'll tell you a lesson I learned at PayPal. You know who complained the loudest—the quickest and the loudest and with the most amount of righteous indignation? The fraudsters. That's who complained first, loudest, and—and they would generally have this immense overreaction. That's how we knew there were the fraudsters. That's how we knew. There's a tell.\nMr. Hannity.What did—I've never—I've never met you before today.\nSenior Adviser Musk.Yes.\nMr. Hannity.And it's nice to meet you, by the way. Thank—thank you for doing this.\nYou guys are really friends. I could—you guys—I could see you kicking up your shoes.\nThe President.Well, he doesn't do this kind of thing. And the way I figured that you'd get to know him is if I did it with him. I said, \"Come on, let's do it together.\" He doesn't do this.\nI think he's smarter not doing it, overall. Because, you know, I mean, he's done very well without doing it. But he doesn't feel it's really worthwhile. He wants the product to speak for itself, or whatever he does speak for itself. But he views it as—you know, does it matter?\nAnd I'm doing this with you today because I wanted to have people understand him. And I think it's very important—I disagree with him. I think it's very important that they do understand him.\nHe doesn't need this. He doesn't need it. Now, I happen to think it's made him very popular. I think it—he's more popular now because there are so many people—you know, you're talking about the radical left—they have the lowest ratings. MSNBC is dying. CNN is dying. They're all dying. The New York Times is doing lousy. The Washington Post is doing horribly. They're all doing badly because people don't buy it anymore.\nBut I think it was important that he do this one interview. You've been a very fair guy. I think you were the right guy to do it. If we could get some radical left guy—and he'd do just as well, frankly, because it's all about common sense.\nMr. Hannity.They would attack him——\nThe President.But this—Sean——\nMr. Hannity. ——as being unconstitutional, not a Fascist.\nThe President.——to me this was a—it was important for people to understand, he's doing a big job. He's doing a very thankless job. He's doing a thankless job, but he's helping us to save our country.\nOur country was in serious trouble, and I had to get the best guy, somebody with credibility, because if he were just a regular, good—very good, solid businessman, he wouldn't have the credibility. He's got the best credibility for this.\nAnd people also know he's an honest guy. He's an honest guy. He's just a very, very smart guy who's done amazing things. And this will be the biggest thing he's ever done, because, you know, his companies are all great. But if this country goes bad—I guess where he is a little selfish is this. He knows one thing and probably doesn't think—but if his—if this country goes bad, his stuff is not going to be worth very much, I can tell you.\nSenior Adviser Musk.Well, I'd say, if the—if the ship of America sinks, we're all go- —going down with it. You know, this idea that people can escape to New Zealand or some other place is false. If the central pillar of Western civilization that is America falls, the whole roof comes crashing down and there is no escape.\nU.S. Foreign Policy\nMr. Hannity.It's amazing, since you've been elected, to watch Canada, Mexico, Venezuela, Colombia—I was shocked at the statements that Vladimir Putin made about you. I—I was shocked at the hostage release. I was shocked that Venezuela had done it—had done it. Zelenskyy wants a deal. Putin wants a deal.\nThe President.All good statements.\nMr. Hannity.King Abdullah was interested.\nThe President.You mean by that all good statements. Look, they respect the President of this country. They respect—they did not respect the last President. They laughed at him, and they laughed at our country, and he's done great damage to our country.\nMr. Hannity.Have foreign leaders told you what they thought of Biden?\nThe President.Yes, they have, but I'd rather not say. They have. It's not—it—look—\nMr. Hannity.It's the obvious.\nThe President.He was not George Washington, let's put it that way.\nSenior Adviser Musk.[Inaudible]\nThe President.Not the greatest.\nMr. Hannity.Sorry, if that's—[inaudible].\nThe President.He's done a tremendous disservice.\nMr. Hannity.Will you be here——\nThe President.And by the way, the Democrats have done a great disservice, and they ought to get their act together and use a little judgment, and they ought to work with us on straightening out this mess that——\nMr. Hannity.Who? John Fetterman?\nThe President.——a lot of people have——\nMr. Hannity.Maybe? Who—what Democrat is not radicalized?\nThe President.Actually, you mention John.\nMr. Hannity.John Fetterman.\nThe President.He's become the best voice in the Democrat party. You know, I had lunch with him, and I thought he was terrific, but he's a much different man than he was before he had this difficulty. He used to be radical left, and I think he became much smarter, actually. He's really—he's really a voice of reason.\nBut the Democrats have to get together. They have to get their act together, because the stuff they—they talk about makes no sense. It makes—none whatsoever. And they must know it. They must know.\nSenior Adviser Musk.Yes. I mean, like, the country has spoken very clearly and rejected the core tenets of the Democratic Party. The country voted to—for—I mean, the country made the—America has made its vote clear. The President won the popular vote decisively. The Republicans won the House. Republicans won the Senate. What more do you need?\nThe Democratic Party needs to take a hard look in the mirror and change their ways.\nMr. Hannity.I think they went from shock, denial, into the depression stage of grief, and now they're in the rage stage, where I anticipate they'll stay for 4 years, and if they get the chance, they'll want to impeach him 10 times. Do you anticipate you'll be here in 4 years? My last question.\nSenior Adviser Musk.I'll be as helpful as long as I can be helpful.\nThe President.That's a good question. I mean, I was thinking about that just now. I said, \"I wonder how long he's going to be doing it.\" You can't get somebody like this. He cares, and he's brilliant, and he's got energy.\nYou need energy, also, in addition to those other things.\nYou know, I have a lot of guys that are very smart, but they have no energy. They want to sleep all day long. You need a lot of energy. He's got a lot of energy. He's doing a great job.\nIf there's any conflict, he will stop it. But if he didn't, I'd stop it. I'd see if there's a conflict. I mean, we're talking about big stuff.\nBut he's under a pretty big microscope.\nSenior Adviser Musk.Yes, seriously.\nThe President.I mean, everybody is watching him. If there's a conflict, you're going to be reading about it within about 2 minutes after the conflict.\nSenior Adviser Musk.Exactly. There—there's—the possibility of me getting away with something is 0 percent—0.0. I'm scrutinized to a ridiculous degree.\nAnd the other thing is that we—you know, what—what's—you know what's better than saying \"trust—trust me\" is just full transparency. So what we're doing with the DOGE—DOGE dot—just go to DOGE.gov. You can see every single action that's being taken.\nAnd now—and I want to be clear, we are going to make some mistakes. We're not going to be perfect. Nobody bats a thousand. But we're going to fix the mistakes very quickly. That's what matters: not that you don't make mistakes, but that you fix the mistakes very fast.\nThe President.And you're going to ask the other side, when they talk about, \"This is a constitutional crisis,\" you've got to a—what are they paying for? Where are those tax—because when you read off the list of things, it's a big con job. See, when they talk Constitution——\nSenior Adviser Musk.Totally.\nThe President.——it's a total con job.\nSenior Adviser Musk.Yes.\nThe President.They never talk—and I watch some of the shows——\nSenior Adviser Musk.It's specifics—they avoid specifics.\nThe President.Yes, when you start talking about how did—how come they spent money on transgender here and transgender there——\nSenior Adviser Musk.Yes, totally.\nThe President.——and all the stuff in some country that nobody ever heard of, they don't want to talk about it. They just talk about, \"This is a constitutional crisis.\"\nMr. Hannity.It shocks the conscious.\nThe President.The money is being squandered purposely—tremendous theft, tremendous kickbacks, everything—and we're straightening it out. And thank goodness. I look up, and I say, \"Thank you,\" because I think if it went on for 4 more years, it would not be salvageable. You wouldn't be able——\nSenior Adviser Musk.Absolutely.\nThe President.You wouldn't be able to save it.\nMr. Hannity.You believe, too, that when you were in Butler, came within a millimeter being assassinated——\nThe President.Yes.\nMr. Hannity.The day you endorsed him, that was that day.\nSenior Adviser Musk.Yes.\nMr. Hannity.But you had been planning on it?\nSenior Adviser Musk.Yes.\nMr. Hannity.Pretty—I think everybody will never forget that iconic blood on your face. \"Fight, fight, fight.\" I actually was afraid—watching it and thought you might drop again. You know, I didn't know if it had hit you. You can sometimes get up and then the blood starts to accumulate. It was scary—pretty scary.\nSenior Adviser Musk.Well, I mean, this is how you know someone's true character, because everyone can say they're brave, but the President was actually shot. Okay? Courage under fire. \"Fight, fight, fight,\" blood streaming down the face. That's true courage. You can't fake that.\nMr. Hannity.Yes. Thank you both.\nMr. President, thank you, sir.\nThe President.Thank you very much.\nMr. Hannity.Appreciate it. Elon, thank you for your time. Really nice to meet you.", "Link": "https://www.presidency.ucsb.edu/documents/interview-with-sean-hannity-the-fox-news-channels-sean-hannity-show"}
{"Title": "Interview With Jamie Little of Fox Sports at the Daytona 500 NASCAR Cup Series Motor Race in Daytona Beach, Florida", "Date": "2025-02-16", "Text": "Ms. Little.Well, I'm joined now by the President of the United States. Mr. President, 5 years ago, we were standing in this very spot.\nThe President.That's right.\nDaytona 500 NASCAR Cup Series Motor Race\nMs. Little.What brings you back to the \"Great American Race\"?\nThe President.Well, I think it's fantastic. It's great for the country. Our country is doing well again. And we have spirit—all over the world, there's spirit again. We brought it back, and it's been less than 4 weeks. So you'll see what we do in a little period of time; it's going to only get better. But this is very exciting.\nMs. Little.You brought your granddaughter.\nThe President.That's right. Carolina.\nThe President's Visit to the Daytona International Speedway\nMs. Little.I know some of your other family members are here. You get to take a ride around in the Beast.\nThe President.I'm going to do that.\nMs. Little.What is that like?\nThe President.Well, I'll let you know in about 2 minutes, because it's going to be—they're going to be going quite quickly, I understand.\nMs. Little.And you just got to meet some of the drivers.\nThe President.I did.\nThe President's Message to the Competitors\nMs. Little.Are you going to get on the radio again and talk to them before the start of this?\nThe President.I'm going to talk to them. And I say they have a lot of courage doing this. I see it, and I've been here, and they have a lot of guts, as they would say.\nMs. Little.Mr. President, enjoy your time.\nThe President.Thank you very much. Great.\nMs. Little.Bye.", "Link": "https://www.presidency.ucsb.edu/documents/interview-with-jamie-little-fox-sports-the-daytona-500-nascar-cup-series-motor-race"}
{"Title": "The President's News Conference With President Emmanuel Macron of France", "Date": "2025-02-24", "Text": "President Trump.Well, thank you very much, everyone. Great honor to be here with my friend.\nI'm delighted to welcome President Macron back to the White House. We've been together quite often, but not that often in the White House. We honored the President, First Lady of France not so long ago. That was a beautiful evening, and we will not soon forget it. That was a beautiful day and evening and many fond memories.\nI also want to thank Emmanuel for hosting me in Paris last December after a historic election win to witness the reopening of the spectacular Notre Dame Cathedral, where you did an outstanding job in bringing it back together. That was a sad day, watching that burn. And 5 years later, you had it up, and it was, they say, more beautiful than it was before. So I think that's a great achievement. That was not easy.\nFrance is America's oldest ally. Our cherished partnership has been a force for freedom, prosperity, and peace from the very beginning. We're now working on some very interesting developments—one, in particular, as you know, the war between Russia and Ukraine.\nIn the American Revolution, French support helped us to seize our destiny as an independent nation. In the first and second World Wars, our citizens shed blood together on the battlefields of Europe. And I'll never forget joining President Macron 6 years ago on the 75th anniversary of D-Day. That was some day.\nThe purpose of our meeting today is to end another battle, a really horrible one—a war, something that we haven't seen since the Second World War—that is ravaging European soil. The deadliest and most destructive conflict that one can imagine. I've seen the pictures. I've seen the satellite photos and—and lots of other photos, and it's a horrible thing that's happening. Thousands of people are dying a week.\nThis very day is the third anniversary of the invasion of Ukraine, which would never have happened if I was President. That was not going to happen. The horrors of this gruesome and bloody war can scarcely be overestimated. Hundreds of thousands of people—Russians and Ukrainians, in particular—have needlessly died. An entire generation of Ukrainians and Russian men has been decimated. One-thousand-year-old cities have been turned into rubble. Those beautiful spires that you used to see there—they were the most beautiful in the world, they say—are lying in heaps of rubble, blasted to smithereens.\nAnd it's time to end this bloodletting and restore peace, and I think we're going to do it. We've had some great conversations, including with Russia. Since my return to the White House, we've made more progress toward that goal in 1 month than occurred in the past 3 years.\nAnd I've spoken with both President Putin and President Zelenskyy. And, again, a lot of—a lot of good things toward peace are happening, moving it, I think, pretty quickly.\nLast week, Secretary of State Marco Rubio, National Security Adviser Michael Waltz, and Special Envoy Steve Witkoff conducted successful talks in Saudi Arabia with the delegation from Russia, and I'd like to thank the Kingdom of Saudi Arabia and the King and Muhammad. Great people. They're really working hard to get this done.\nOur focus is on achieving a cease-fire as soon as possible and ultimately a permanent peace. My meeting with President Macron today was another important step forward in that—well, that sphere, because he's been very much involved, right from the beginning, on trying to get it over with, and we're going to get it done.\nI believe that Emmanuel agrees with me on many of the most important issues. Chief among them is, this is the right time. It may be the only time.\nYou know, that's a very interesting and horrible situation, and that could evolve into a third world war. We're not going to let that happen. It should have never started, but it did, and what a mess. What a horrible, bloody mess.\nI'm also pleased that President Macron agrees that the cost and burden of securing the peace must be borne by the nations of Europe, not alone by the United States. And Europe must take that central role in assuring long-term security of Ukraine, which they want to do. And that's not a very big step. A big step is what's going to happen over the next few weeks.\nThe United States has put up far more aid for Ukraine than any other nation, hundreds of billions of dollars. We've spent more than $300 billion, and Europe has spent about $100 billion. That's a big difference. And at some point, we should equalize. But hopefully, won't—won't have to worry about that. We have other things happening that maybe take that out of the realm of necessity.\nAnd while we've given vast amounts of military aid and money in form of grants, much of Europe's contribution has been economic relief structured as loans, for which they'll be repaid. Like the Europeans, I believe that taxpayers and the United States also deserve to recoup the colossal amounts of money that we've sent. The previous administration never even thought of that. They didn't think of a lot of things, like why did they let it start in the first place.\nThat is why we must have an agreement with Ukraine on critical minerals and rare earths and various other things as security. And I think that that's happening. I think we've made a lot of progress. I had a report just given to me before walking in that we've made, Emmanuel, a great deal of progress toward getting that.\nI've been elected by the American people to restore common sense to Washington and, indeed, to the world. And I believe strongly that it's in the best interest of the United States, the best interest in Europe, the best interest of Ukraine, and indeed, the best interest of Russia to stop the killing now and bring the world to peace.\nMy administration is making a decisive break with the foreign policy failures of the past administration and, frankly, the past. I ran against a very foolish foreign policy establishment, and their recklessness has led to the death of many, many people.\nUnder our administration, we're forging a new path that promotes peace around the world. And when I left office for the first administration—first term, we had no wars. We had no problems. We didn't have October 7 with Israel. We didn't have Russia and Ukraine going at it. We didn't have the problems in other parts of the Middle East. We didn't have inflation. It was a whole different world.\nAnd you know what else we didn't have? Millions of people pouring through our borders, many of them criminals released from other nations and put right into our land: murderers and drug dealers, gangs. We didn't have any of that. It's a different time.\nBut now we have it, and we're fixing it. We'll fix it all up. We'll get it done as quickly as possible.\nAnd we've made a great deal of progress. People are saying it was the best month for a President in our country's history. I hope that's right, but—I feel it's right. We've—we've done a lot of things in a very short period of time, 4 weeks.\nAs I've said before, it's my hope that my greatest legacy, however, will be as a peacemaker and a unifier. I want to bring peace, not war.\nI thank President Macron for joining us today in this urgent work we're doing. And we have some wonderful people up front right here that have worked so hard. Steve Witkoff, thank you very much. Michael Waltz, thank you. Scott, thank you very much. And, J.D., thank you. They've really done a—they've really done a job. They worked very hard. It's like—it's a real passion to get this war ended.\nAnd I'd like to now invite Emmanuel to say a few words, and then we'll take questions. And, again, Emmanuel, it's a great honor to have you with us at the White House. Thank you very much. Please.\nPresident Macron.Thank you.\nThank you, Mr. President. Thank you, dear Donald. Ministers, ladies and gentlemen,mesdamesandmessieurs.\n[At this point,President Macron spoke in French, and his remarks were translated by an interpreter as follows.]\nLadies and gentlemen, I'll be saying a few words in French.\nThank you very much, Mr. President, dear Donald, for your hospitality and for this visit. As you mentioned, we have had the opportunity to meet over the past few years. Since your first term, we've been able to discuss matters in Paris and also here at the White House, and it has always been a great joy to do that.\nAnd I would like to commend you, and thank you, Mr. President, for extending this friendship to France and taking part in the ceremony at Notre Dame that you mentioned before. It was a great honor for the French people to reopen the cathedral to the rest of the world, and your presence was a testament to that friendship.\nAs the President said, this friendship dates back to the Revolutionary War, since the beginning of the United States. And whenever we've needed to, we've been able to come together and be on the right side. We've been able to be united to defend peace and sovereignty, namely, in the two World Wars that marked the 20th century, from Lafayette to Pershing and to the many Americans who landed on Omaha Beach.\nAnd we spoke earlier before, and you mentioned that one of those gentlemen was able to visit you here, one of the veterans. This is part of history which puts us in the world that we are in today. And as the President just said, there are many challenges in this world. And over the past few days, we have one main objective, which is the geopolitical situation.\nMr. President, I really wish to thank you for making changes to your schedule to meet with us so quickly. I think we've made very substantive steps forward during our discussions, and this is a major step in what we're experiencing today.\nWe had a video conference with all of the G-7 leaders, which was an opportunity for us to discuss this matter 3 days [years; White House correction] after the Russian war in Ukraine, and to express our support for President Zelenskyy, to the Ukrainian people, but also to speak and share about our desire for a lasting peace. This is what we have spoken about very forcibly over the past few weeks.\nWe thought that this war was only going to last a few weeks when it broke out in 2022. We admire greatly the courage of the Ukrainian people.\nAnd, Mr. President, I wish to thank you for this. You mentioned that there are responsibilities on Europe's side, and, indeed, we have invested $128 billion in aid to Ukraine and the Ukrainians. Ukraine has been able to hold the front of our collective security. It's fought over these past few years for its independence and for its sovereignty, but also for our collective security, because I think that no one in this room wants to live in a world where it's the law of the strongest and international borders can be violated from one day to the next by anyone.\nOver the past few hours—and as you mentioned this, Mr. President—we've been able to see a few things take shape. First of all, allow me to commend you on your decision to work with President Zelenskyy and to conclude this agreement that's so important for the U.S. and Ukraine on rare earths, critical minerals, but also having substantive conversations with President Zelenskyy during this key phase of achieving this deal, which is a major commitment to Ukraine's sovereignty. And I think that's very commendable.\nWe also have a shared desire to build peace. We will have this responsibility. This is 10 years after the war started in Crimea, and then we saw the events in Donbas—in the Donbas region and along the northern part of the country. We want to save lives. We want to bring prisoners back and bring back families and children because there is also humanitarian tragedy affecting the Ukrainian people.\nWe had lengthy discussions with the President, and we spoke about our desire to bring an end to conflicts; to have a truce that is measurable, verifiable, and that enables negotiation of a lasting peace, where we will discuss not only Ukraine's reconstruction, its territories, but also the security guarantees, meaning maintaining peace over the long term.\nAs I said to the President, we have experienced peace accords that were only cease-fires without ensuring security guarantees, Minsk I and II. And we want to make sure this doesn't happen again. And I know that the President has expressed the desire to be a player for peace in the region.\nI've spoken with some 30 European leaders and allies in recent days. We want to bring together these—alleys—allies, rather, and share the same vision. This peace must not mean a surrender of Ukraine. It must not mean a ceasefire without guarantees. This peace must allow for Ukrainian sovereignty and allow Ukraine to negotiate with other stakeholders regarding the issues it affects—that affects it, rather. But it is also a country in which we need to shoulder our responsibility so that we ensure security and stability for Ukraine and for the entire region. And for us Europeans, this is an existential issue.\nWe also spoke about these issues at length with the President. We've worked with President Zelenskyy and gotten to some of the details of the various phases of the negotiation, and we've also been able to speak about some of this work with our British partners to talk about deployments of peace forces on Ukrainian soil, which are part of these security guarantees. Other countries are ready to join in this effort.\nSolidarity and support from the U.S. will be crucial to this. And I thank you, Mr. President, for beginning to work with us on this issue. And the agreement that you are preparing to sign with Ukraine and with all these discussions we've had are very solid guarantees that we are understood and that we have the same wish: peace as soon as possible; lasting, solid peace for everyone; and the renewal of an international situation where we are all able to shoulder our responsibilities—Europeans shouldering their responsibilities, alongside their American allies, who will shoulder their own responsibilities.\nI also wanted to be very clear, Mr. President, about Europe's commitment. We have committed to building a lasting peace. As Europeans, we have committed to being stakeholders in these security guarantees, and we are also well aware that Europeans need to do more for security in Europe, for defense in Europe, and to more fairly share the security burden that your country has been carrying for so many years.\nMr. President, you know how much friendship I show towards you and I have towards you since your first term. Europe is very clear eyed about this. We know what we need to do as Europeans, given the threats surrounding us and the responsibilities that we must shoulder.\nWe spoke about the Versailles agenda, which allowed the Europeans to take a historic step and increase their investments. Europeans are ready to do even more and to go even farther. And several leaders said that to me before I came here to meet you.\nMr. President, dear Donald, you spoke about this peace through strength. We fully share that, because we must recognize the sacrifices made by the Ukrainian people and what we owe to them.\nThe President and I also spoke about economic matters and our desire to see more prosperity in the United States and in Europe. We had discussions which will be carried on by our teams, our ministers and secretaries, to flesh out some of those ideas. But the idea is to have fair competition and no bias within competition between our industries.\nNow, the American and European economies are extremely intertwined—some $1.5 billion in trade—trillion, rather, in goods and services. And I know you've spoken about wanting to look at the balance of payments. We also have a trade deficit, and I know that we need to look not only at goods, but also digital items and goods which you export. And we want to make a sincere commitment towards fair competition, where we have smooth trade and more investments.\nYou already invest a great deal in France. And France is the fifth most—the fifth largest investor in the United States. And I would like to recognize here all of the American investors who announced investments—some $120 billion that were announced at the AI summit.\nThis is our wish. We want to have more prosperity on both sides of the Atlantic. We have a shared agenda in that regard.\nWe also spoke about the Middle East, among other subjects. And here, again, we have the same desire. We don't want to see Iran obtain nuclear weapons. We don't want—or, rather, we want an approach with partners in the region that we can trust. Given Iran's nuclear activities, we want to limit its ballistic capabilities and avoid any type of regional destabilization.\nWith respect to Syria and Iraq, we also share the same desire. We don't want to see Islamic terrorist groups resume any of their activities, because, for some time, our armies have very bravely been engaged in the Gulf, as you have led, and contributions have been significant and helped stability in the region.\nAnd I say this with great sincerity: France was affected by a terrorist attack in 2015, which was linked to the terrorist activity in Syria, and we are in that region, at your side, to work for more security.\nLadies and gentlemen, we had extremely productive discussions this morning during the conference, and we spoke with our ministers and councilors and advisors. And I wish to say, after speaking with President Trump, I am—fully believe that there is a path forward. We share the same beliefs. We know what work needs to be done, and, in the weeks to come, we will work on that. Our teams will come together in various formats to make sure that we have this solid, lasting peace with great strength.\nMr. President, thank you so much for welcoming me here today. Thank you so much for these productive discussions and for your commitment. Thank you, dear Donald.\nPresident Trump.Thank you very much. Thank you, Emmanuel. Thank you very much.\n[President Macron spoke briefly in English as follows.]\nPresident Macron.Thank you.\nPresident Trump.Great job.\nPresident Macron.Thank you, Donald.\nPresident Trump.Okay. Thank you very much.\nBrian [Brian Glenn, America's Real Voice], would you like to ask a question? Go ahead.\nPresident Trump's Poll Numbers\nQ.Yes. Thank you, Mr. President. Welcome, President Macron.\nI just want to touch upon, real quickly, the Harvard poll that came out that had——\n[A White House aide held up a microphone.]\nThank you very much.\nThe Harvard poll that came out——\nPresident Trump.Yes.\nQ. ——had you up nine-plus points. And all of your agenda that you ran on, you're accomplishing that. You got the support of the American people, including stopping the war in Ukraine. If you can comment on the latest Harvard poll, I'd appreciate that.\nPresident Trump.Well, I was honored by it. It was a big poll, and it's usually a poll that leans on the other side of things, the other side of the world, so to speak. But the Harvard poll is a respected poll, and it has us not only leading, but leading by a lot and leading on every single issue that we've talked about.\nAnd as I said, we've become the party of common sense, and I think that's a very important element now—common sense—because what's happening in the world and even in this country, some of the things that took place, many of them are now canceled, and the rest are being canceled as we speak. But we've moved very rapidly and, I think, very effectively.\nSo I was honored by that poll. Thank you very much. Appreciate it.\nQ.Mr. President——\nQ.Mr. President, here.\nPresident Trump.Go ahead. Please go ahead.\nRussia/Ukraine/U.S. Diplomatic Efforts in Saudi Arabia\nQ.Thank you. Mr. President, you said before that you would like to see Russia——\nPresident Trump.Yes.\nQ. ——rejoining the G-7.\nPresident Trump.Go ahead.\nQ.Are there any conditions that you want Russia to meet before they can rejoin? And your meeting in Saudi Arabia with—your meeting in Saudi Arabia with President Putin, will that happen, regardless of any progress on the Ukrainian—[inaudible]?\nPresident Trump.Yes, I think the meeting in Saudi Arabia was a fantastic one. We met with the Crown Prince, who is just a fantastic young guy. He's young, but with great imagination and tremendously respected all over the world. And he goes right to the King, and the King is incredible. I've gotten to be friends with both of them very much. And they want to see this ended, and they're going all out to make sure that it is ended.\nI think Russia, likewise—I've spoken to President Putin, and my people are dealing with him constantly and his people, in particular. And they want to do something. I mean, that's what I do. I do deals. My whole life is deals. That's all I know is deals. And I know when somebody wants to make it and when somebody doesn't.\nI will say this. Before I came here, there was no communication with Russia whatsoever, and Russia wasn't answering calls. They were not talking to anybody. They wouldn't talk to anybody. And people sort of accepted that as being that they want to go forward and just keep going without stop. But when I got here, one of the first calls I made was to President Putin, and we were treated with great respect.\nAnd they want to end this war. So that's a big thing, because I didn't know if I could say that, but it's a big thing. They want to do it. And the group in the front row that I introduced, they are very—all very active in it. And we're working on deals right now, transactions right now.\nAnd, in particular, the big one is to get the—the war stopped, whether it's ceasefire or direct to an agreement. I'd like to go directly to an agreement, but cease-fire will always happen a little bit quicker. And every day, you're saving thousands or at least hundreds—but thousands, in some cases—lives, so we want to see if we can get that done very quickly.\n[Several reporters began asking questions at once.]\nQ.\"The Art of the Deal,\" sir.\nQ.On the—on the G-7, sir.\nPresident Trump.Yes, for the President, please.\nRussia/Ukraine\nQ.Thank you. Sylvie Corbet. I'm AP correspondent based in Paris. Question for both of you, actually. Mr. Macron, you were one of the last Western leaders to speak to Putin before Ukraine's invasion. What advice, what recommendation could you make to President Trump to make sure that, this time, you can get strong enough guarantee, sorry, from Putin to get a peace deal that lasts this time?\nAnd, Mr. President Trump, what makes you think you can trust Putin in those negotiations? Thank you.\n[President Macron spoke in English as follows.]\nPresident Macron.Look, I will never give any advice to President Trump. We have friendly and trustful discussion.\nBut my experience with President Putin is the following. Number one, I always think it's good to have discussion with other leaders and especially when you—when—when you disagree. I stopped my discussion with President Putin after Bucha and the war crimes because I considered that—I mean, we had nothing to get from him in the time.\nNow this is a chance—there is a big change, because there is a new U.S. administration, so this is a new context. So there is good reason for President Trump to reengage with President Putin.\nBut my experience is the following, and I shared it with President Trump and the team. In 2014, our predecessors negotiated peace with President Putin, but because of the lack of guarantees and especially security guarantees, President Putin violated this peace. And I had several discussion, especially beginning of 2022, several times—7 hours with President Putin—15 days before launching of the—the attack. He denied everything, but we didn't have security guarantees.\nSo this is why being strong and having deterrence capacities is the only way to be sure it will be respected. And I insisted on that, and this is why I believe that the U.S. has the capacity to do so. And this is why I think we should never say, \"I will never send any boots on the ground,\" because you give a blank check to violate any type of a commitment.\nSo I think it's good to have discussion. I think it's useful to have negotiation. I think it's super important to go to the peace. But my strong point was to say, let's try to get something first which is—which can be assessed, checked, and verified, and let's be sure that we build sufficient guarantees on the short run. And this is where we are ready to be engaged, as for France. A lot of my European colleagues are ready to be engaged.\nBut we no—do need this American backup, because this is part of the credibility of the security guarantees, and this is our collective deterrence capacity. And I have the feeling that the President has this capacity.\nQ.Sir——\nPresident Trump.Yes. I think it's very much to the benefit of Russia to make a deal, and I feel that we'll do that. It is what it is.\nAgain, it's a war that should have never been started. It's a war that would not have been started if I were President, but it did start, and it's at a terrible level, where cities are burned down and shot down to the ground. It looks like demolition sites, a whole big pile of demolition sites. And we got to get it stopped. Too many people, too much agony. The whole culture is destroyed, when you rip down some of those ancient—really ancient or near-ancient buildings. It's so sad to see.\nBut I think it's very much to the benefit of—there's tremendous distrust on both sides. That's why it's good that I'm coming in now. But I think it's to the very much benefit of Russia to make a deal and to go on with—go on with leading Russia in a very positive way. That's what you have to do.\nBut I really believe that he wants to make a deal. May be wrong, but I believe he wants to make a deal.\n[Several reporters began asking questions at once.]\nYes. Go ahead, please.\nQ.Mr. President——\nU.S. Trade Policy/U.S. DOGE Service\nQ.Hi, Mr. President. Next week, there's a key deadline for your Canada and Mexico tariffs. Do you expect those will go back on, or do you believe those countries have done enough on the border to stop those from going—taking effect?\nAnd for President Macron, I'm wondering if you believe that this critical minerals deal with Ukraine represents a de facto security guarantee by the United States, since the U.S. would have an interest in protecting those reserves in Ukraine? Thank you.\nPresident Trump.We're on time with the tariffs, and it seems like that's moving along very rapidly. We've been mistreated very badly by many countries, not just Canada and Mexico. We've been taken advantage of. We were led by, in some cases, fools, because anybody that would sign documents like they signed, where they were able to take advantage of the American people, like has happened over the last long period of time, except for a little 4-year period that took place 4 years ago—but anybody that would agree to allow this to happen to our country should be ashamed of themselves.\nNo, the tariffs are going forward on time, on schedule. This is an abuse that took place for many, many years. And I'm not even blaming the other countries that did this. I blame our leadership for allowing it to happen. I mean, you know, who can blame them if they made these great deals with the United States, took advantage of the United States on manufacturing, on just about everything? Every aspect that you can imagine, they took advantage of. I look at some of these agreements, I'd read them at night, and I'd say, \"Who would ever sign a thing like this?\"\nSo the tariffs will go forward, yes. And we're going to make up a lot of territory. We're going to—all we want is reciprocal. We want reciprocity. We want to have the same. So, if somebody charges us, we charge them. It's very simple. But it will be very good for our country. Our country will be extremely liquid and rich again.\nPlus, we're doing other things, as you know. We're finding tremendous waste, fraud, and abuse at levels that nobody thought possible. You're seeing what's going on.\nAnd that was also part of the Harvard poll: Do you agree with what President Trump is doing with Elon and others that are looking for the waste, fraud, and abuse? And the numbers were staggering. It was, like, 70 percent to 2 percent. Everybody wants to find out. They don't like it.\nAnd you know, the radical left or whoever it may be starts screaming about the Constitution, but it has nothing to do with the Constitution. It has to do with fairness to this country. It has to do with being ripped off. And when you read the things that all of these billions and—and I mean many billions, hundreds of billions of dollars—has—have been spent on, that's all you have to do is stand up here and read them. I could stand up all day and read the kind of things where we're spending all of this money.\nThe good news is that when you think of how rich a nation we can be when we get rid of this. You know, sometimes you'll buy a company, and you'll see it was really well run. It's—they accounted for every penny. Well, not much you can do there. You've got yourself a bad deal. This one is the exact opposite. Tremendous fraud, tremendous waste. And—when you think of what it is—you know, Elon uses an expression, \"caring.\" If we had people that cared, just cared a little bit when they did contracts, when they negotiated with outside vendors for—on behalf of the United States.\nThat's what I'm doing now. I'm negotiating for the people of the United States. So, we're doing a great job of it, I will say. We've found—it will be hundreds of billions of dollars of—of waste and fraud and abuse.\nThank you. Please.\n[President Macron spoke in English as follows.]\nPresident Macron.Look, I think this discussion is a very important one, first, because it's important for the U.S., and it will be a good occasion for a first very important meeting between President Trump and President Zelenskyy. Second, I think it's—there is a lot of economic upside for—on both sides. And third, de facto, there is a recognition of Ukrainian sovereignty, a recognition of the Ukrainian interests. And this is, de facto, a very important alignment of interests.\nNow, the security guarantees will be negotiated in due time in a full-fledged package of peace security. But this peace, as it is now written and negotiated and as this meeting is scheduled, is an important step toward full-fledged peace agreement.\nQ.Mr. President——\nPresident Trump.Okay. Please. Go ahead. To the President, please.\nUkraine/U.S. Security Assistance/Notre Dame Cathedral in Paris, France\nQ.President Trump, President Macron, first of all, you said, \"I would like to make a deal with Putin.\" So, when you do a deal, it's a win-win deal, what are you giving to him, and what is he going to give you, to America?\nAnd I was impressed by the way you referred to Notre Dame, and that you were impressed by the reconstruction of Notre Dame. A lot of American have sent money to Paris to participate to the reconstruction of Notre Dame. As a President of the United States, are you going to contribute to the reconstruction of Ukraine?\n[The reporter then spoke in French, and his remarks were translated by an interpreter as follows.]\nPresident Macron, what, for you, is the main area of progress in your meeting with President Trump? Can you confirm that there is an agreement to send European peacekeeping troops? Will France participate in that? How many troops? What would they be doing? Would this represent a great danger to send French and European troops to Ukraine?\nPresident Trump.Well, I guess it's a little strange question, because you ask whether or not we're going to, on behalf of the United States, contribute to Ukraine. I mean, we're in there for about $350 billion. I think that's a pretty big contribution.\nI do appreciate the first part of your question, however, because I think they've done an incredible job with the Cathedral of Notre Dame. I think the President has done—I know he headed it up, and I know he—how hard he worked, and it took a period of time but really not a long period of time, considering what that was. So delicate, so beautiful.\nAnd I was there, and I saw the work. And I'm very good at construction. I know good construction, and I know bad construction. They did a beautiful job, and this man has to be given a lot of credit for that. It's an incredible cathedral. Most people thought it couldn't be saved, and, if it was, it would have to be built in a different form. And we didn't want to see a different form. We wanted to see the same form that you built.\nSo I just want to congratulate you. That was an amazing job. I don't think you've gotten enough credit for it. Someday you will. Someday you will.\nPresident Macron.Thank you, Donald.\n[President Macron spoke in French, and his remarks were translated by an interpreter as follows.]\nThank you very much.\nTo go back to your question, today's discussion showed several areas of progress. First, we have been working a great deal with President Zelenskyy to have a proposal that's acceptable to Ukraine. President Trump has confirmed that he will be meeting with President Zelenskyy very soon to finalize the agreement on critical minerals and rare earths and to speak together about that matter. That's a very important step forward.\nThe second thing is that, during our discussions, we were able to go into some of the details about the proposal that we have just made to have a truce, a peace, and be able to measure that and then structure our discussions on that basis. France and several other European countries, along with Ukraine, are hard at work to build this lasting peace with very specific points, including security guarantees. The territories that belong to Ukraine, the issue of reconstruction, the economy, and critical minerals—we've been able to go into the details of those proposals.\nThe third area of progress, which really mark a turning point, is the fact that we were able to talk about the details of the security guarantees. And the President has shown this over the past few days, and he said so a moment ago: We want peace. He wants peace. We want peace swiftly, but we don't want an agreement that is weak.\nThe fact that there are Europeans that are ready to engage to provide for these security guarantees and now there's a clear American message that the U.S., as an ally, is ready to provide that solidarity for that approach, that's a turning point, in my view, and that is one of the great areas of progress that we've made during this trip and during this discussion.\nWhen it comes to troops, in the past—a year ago, specifically—we saw a reason to talk about sending troops to—for strategic regions. Today, when we talk about troops, we're talking about sending them in after we've negotiated a lasting peace. And once we have that solid, lasting peace that's part of an agreement signed by Ukraine, signed by Russia, and for which we will provide the guarantees—then, at that point—and recently, France has worked with the U.K. to provide its contributions. We've worked on plans. We've worked with our militaries—not to go to the front lines, not to go into occupied territories, but as a show of support to show that we have a negotiated peace signed by both sides, and that is a peace we will preserve.\nSo these would be peaceful deployments of troops, not for combat. These would be deployments of an assurance force. They would be limited, but they show solidarity.\nI have also spoken with all of our allies, and they are European and non-European allies who are ready and willing to take part in that effort. Countries have helped Ukraine maintain its military capabilities in terms of the number of soldiers it has, equipment, whereas others have provided logistical support on the ground. The question is whether or in what form the U.S. will contribute.\nAnd during our discussions and during the discussions with Russia, we've understood that this would be acceptable to Russia. And that's a very important area of progress, and that means that, in this context, the Europeans will shoulder their part of the burden, their share of the burden. We have a strong alliance that we have built over the decades, we have our solidarity, and we have deterrence capacities.\nWhat does it mean? Would it be dangerous? If there is an agreement signed by Ukraine and Russia, thanks to the efforts of President Trump, and if we provide the guarantees and Russia violates the agreement, then it would be in conflict with everyone who is engaged in the peace process. And that is a change. That was something we did not see in the past. That's not what we saw in 2014, so that is the real change that we're marking.\nWe have this deterrence capacity on the American side. We have the capacity for engagement on the European side, and that's something we're going to continue working on together. It's not dangerous, but it's credible. It's less dangerous than things that could happen in the long term. And I think this is what we need to do to ensure security.\nAnd I say this very clearly, we're also talking about security for Europeans. I've been saying this for weeks now. If we do not guarantee the security of this territory within Europe, then how can we guarantee our own security for one and all? We live just 1,500 kilometers from Ukraine, and the Germans and Polish are even closer. So our collective security is important. We need to answer this call for Europeans to be more engaged, and Americans will be there still in solidarity.\nEuropeans are working for their collective security, but I really think this was a turning point today in our discussions.\n[Several reporters spoke at once.]\nPresident Trump.Emmanuel, thank you very much. Great job. And it's been wonderful being with you.\nSay hello to your beautiful wife, and we will see you again soon. We'll be speaking often, and we'll get this thing worked out. We're going to get it done. So important. And great job.\nPresident Macron.Thank you.\n[Several reporters spoke at once.]\nPresident Trump.Thank you. Thank you very much.\n[Several reporters spoke at once.]\nThank you. Thank you.", "Link": "https://www.presidency.ucsb.edu/documents/the-presidents-news-conference-with-president-emmanuel-macron-france-1"}
{"Title": "The President's News Conference With Prime Minister Keir Starmer of the United Kingdom", "Date": "2025-02-27", "Text": "President Trump.Thank you very much. Thank you very much. Great honor.\nToday, it's my privilege to welcome the Prime Minister of a very special place, the United Kingdom, to the White House. Prime Minister Starmer, you've been terrific in our discussions. You're a very tough negotiator, however. [Laughter] I'm not sure I like that, but that's okay. [Laughter] Very, very special person.\nThe Prime Minister and I have gotten off to an outstanding start. The U.S. and U.K. have a special relationship—very special; really, like no other—passed down through the centuries, and we're going to keep it that way. We're going to keep it very strong, as it is.\nVery importantly, I was just notified by letter from King Charles that he's extended, through the Prime Minister, a historic second state visit to the United Kingdom, and that's a great honor because it's never happened before. One person has never been extended that honor, and I really do call it an honor. But it's not for me. It's for our country. It's respect for our country. So I just want to thank you, and I want to thank King Charles. Thank you very much.\nAnd we accept. [Laughter] I don't know if the media is going to follow us. I have a feeling they might. Okay? Thank you very much. Appreciate it.\nI'm pleased to say that the bust of one of the Prime Minister's greatest predecessors, Winston Churchill, is now back in the rightful place in the Oval Office, and we're very proud of it.\nOur meeting today and the various breakout sessions we had were tremendously productive. Most importantly, I provided the Prime Minister with an update on our efforts to end the bloody and horrible war in Ukraine with Russia, which would never have happened if I were President— that was not going to happen. I promise you that.\nAfter 3 years of hellacious conflict, approximately 1 million Ukrainians and Russians have been senselessly killed. But the number, I believe, is much higher than that. Countless schools, hospitals, towns, and beautiful ancient churches have been absolutely obliterated.\nTo begin the process of ending this spiral of death, I had historic back-to-back calls with President Putin—very successful calls, I might add—and President Zelenskyy, and my team also spoke with the Secretary General of NATO on numerous occasions, and we're working very hard to get that war brought to an end. I think we've made a lot of progress, and I think it's moving along pretty rapidly.\nAnd I want to thank all of the people that are here that have been working on it, and we'll let you know what's—what happens. It will either be fairly soon, or it won't be at all.\nIn addition, this week, I met with President Macron of France, as you know, and held talks with members of the G-7.\nTomorrow the progress toward peace will continue when President Zelenskyy visits the White House. He'll be here tomorrow in the early part of the day, and we'll be signing a historic agreement that will make the United States a major partner in developing Ukraine's minerals and rare earths and oil and gasses. And we have a great understanding. I think it's going to be great for Ukraine.\nAnd we're going to be at the site, and we'll be digging. We'll be dig, dig, digging. Dig, we must. A big utility in New York, Con Edison, they used to have a saying, \"Dig we must.\" And we will be digging.\nBut much of the European aid to Ukraine has been sent in the form of loans, for which they expect to be paid back, and we didn't have that honor under the Biden administration. He sent money—would just send it, money after money after money—and never had any knowledge of ever seeing it back: maybe 300 to 350 billion dollars.\nBut under the breakthrough agreement, very unusual, which everyone said was difficult to get—but it's really very good for Ukraine and very good for us—the American taxpayers will now effectively be reimbursed for the money and hundreds of billions of dollars poured into helping Ukraine defend itself, which, by and of itself, is a very worthy thing to do.\nWe've paid far more than any other country, and with most of our support, it's been paid in military—the finest weapons anywhere in the world. This includes vast amounts of military hardware, ammunition, and various other things that we now have to start rebuilding our own stockpiles.\nAdditionally, the minerals agreement will provide the basis for a more sustainable future relationship between the United States and Ukraine and thus stimulate the long-term prosperity that will help the Ukrainians rebuild their country. It's been demolished, and the ruined infrastructure—the infrastructure, as you know, is in very bad shape.\nIn just over 1 month, our administration has already achieved more progress toward peace than years in the other administration, where they did nothing toward peace. They didn't understand what was happening.\nOur approach is basically common sense. As I said, so many of the things that we do are based on common sense. If you want peace, you have to talk—both sides.\nAs I discussed with Prime Minister Starmer, the next step we're making is toward a very achievable cease-fire. We hope that that can happen quickly, because thousands of young people—in this case, they—we're not talking about Americans; we're talking about Ukrainians and Russians—are being killed every week. Thousands.\nAnd it's a rough battlefield. It's a flat piece of land, and the bullet only stops when it hits somebody.\nAnd this week, I saw the reports, and it's—I don't even want to say what they are, but thousands of people—young people—young, vibrant people died. And we want to stop that senseless—should have never happened.\nThis will lay the groundwork for a long-term peace agreement that will return stability to Eastern Europe and, hopefully, ensure that such a terrible war will never happen on European soil or, for that matter, anywhere again. It's a horrible thing that's going on.\nThe disaster in Ukraine shows exactly why it's so important for the United Kingdom and other NATO partners to make large investments in their defense capabilities. In many cases, 4 percent or 5 percent of GDP would be appropriate. I know that they're raising it. I just read an article, a great article about the work you're doing in the U.K., as to the military. You're raising it quite a bit, which is a great thing to do for your country.\nPrime Minister Starmer.Yes.\nPresident Trump.It's great thing to do. It's sad that we need that, but probably need that. So, congratulations on that. I know you got it through.\nAfter years of chronic underfunding, there's an urgent need to catch up for some countries. And I want to thank the Prime Minister once again for traveling here today. Working together, I believe that we'll once again demonstrate the power of our countries' unique friendship. This is indeed a unique friendship. It's been many years, and I think it's only gotten stronger, and we will make sure that it stays that way.\nWe're going to have a great trade agreement. One way or the other, we're going to end up with a very good trade agreement for both countries, and we're working on that as we speak. I think we'll have the confines—I think we'll have something maybe even in terms of possibilities agreed to very shortly. J.D. is working on it, our Vice President, and Scott. And I'm just looking at this whole—Mike, you're going to work on it. Everyone's going to work on it. We'll see if we can do something pretty quickly.\nBut we're going to make some great trade agreements with the U.K. and with the Prime Minister, and it'll happen very quickly.\nSo I just want to thank you again. And please thank King Charles for the invite, and I look forward to you giving our acceptance on behalf of the United States of America. Thank you very much, sir.\nThank you very much.\nPrime Minister Starmer.Thank you.\n[At this point, President Trump and Prime Minister Starmer shook hands.]\nPresident Trump.Great. Great to see you.\nThank you.\nPrime Minister Starmer.Well, thank you very much, Mr. President. Thank you for your hospitality. Thank you for your leadership. This has been a very good and very productive visit.\nAnd with your family roots in Scotland and your close bond with His Majesty the King, it's good to know that the United Kingdom has a true friend in the Oval Office. And it was so good to see the bust of Winston Churchill back in its rightful place——\nPresident Trump.That's right.\nPrime Minister Starmer.——just a moment ago.\nBut look, in a moment of real danger around the world, the relationship, this relationship matters more than ever. We remain each other's first partner in defense, ready to come to the other's aid to counter threats wherever and whenever they may arise. No two militaries are more intertwined than ours. No two countries have done more together to keep people safe.\nAnd in a few weeks, we mark VE Day, the 80th anniversary of Victory in Europe. Britain and America fought side by side to make that happen, one of the greatest moments in our history.\nWe stand side by side still today, and we're focused now on bringing an enduring end to the barbaric war in Ukraine. Mr. President, I welcome your deep and personal commitment to bring peace and to stop the killing. You've created a moment of tremendous opportunity to reach a historic peace deal, a deal that I think would be celebrated in Ukraine and around the world. That is the prize. But we have to get it right.\nThere's a famous slogan in the United Kingdom from after the Second World War. That is that we have to \"win the peace,\" and that's what we must do now, because it can't be peace that rewards the aggressor or that gives encouragement to regimes like Iran. We agree history must be on the side of the peacemaker, not the invader.\nSo the stakes, they couldn't be higher, and we're determined to work together to deliver a good deal.\nWe discussed a plan today to reach a peace that is tough and fair, that Ukraine will help shape, that is backed by strength to stop Putin coming back for more.\nAnd I am working closely with other European leaders on this, and I am clear that the UK is ready to put boots on the ground and planes in the air to support a deal, working together with our allies, because that is the only way that peace will last.\nMr. President, in this new era, you are also right that Europe must step up. And let me tell you now, I see the growing threats we face, and so the U.K. is all in. This year, we'll be giving more military aid to Ukraine than ever, and just this week, I've set out how we're shouldering more of the security burden. We're already one of the biggest spenders in NATO, and now we're going much further, delivering Britain's biggest sustained increase in defense spending since the cold war.\nThis isn't just talk; it's action: rebalancing the transatlantic alliance, making us all stronger and standing up for our shared values and shared security, as Britain always has.\nAnd, Mr. President, it's no secret we're from different political traditions, but there's a lot that we have in common. And we believe it's not taking part that counts. What counts is winning. If you don't win, you don't deliver. And we're determined to deliver for the working people of Britain and America who want and deserve to see their lives improve.\nSo we're both in a hurry to get things done, and that's what the U.K. and U.S. do when we work together: We win, and we get things done. So we'll do what it takes to keep our people safe.\nWe'll also work together to deliver some big economic wins that can benefit us both. We have a $1.5 trillion invested in each other's economies, creating over 2.5 million jobs across both economies. Our trading relationship is not just strong; it's fair, balanced, and reciprocal. We're leaders together in so many areas: ranked one and two in the world as investment destinations; one and two for universities; one and two for Nobel Prizes; one and two in golf, as well, by the way; and we're the only two Western countries with trillion-dollar tech sectors, leaders in AI.\nAnd look, we take a similar approach on this issue. Instead of overregulating these new technologies, we're seizing the opportunities that they offer.\nSo we've decided today to go further, to begin work on a new economic deal with advanced technology at its core.\nLook, our two nations together shaped the great technological innovations of the last century. We have a chance now to do the same for the 21st century. I mean, artificial intelligence could cure cancer. That could be a moonshot for our age. And that's how we'll keep delivering for our people—there are so many opportunities—keep our nations strong, and fulfill the promise of greatness that has always defined this relationship.\nFinally, to undermine—to underline the importance of this bond, it was my privilege and honor to bring a letter with me today from His Majesty the King, not only sending his best wishes but also inviting the President and the First Lady to make a state visit to the United Kingdom, an unprecedented second state visit. This has never happened before. It's so incredible. It will be historic.\nAnd I'm delighted that I can go back to His Majesty the King and tell him that President Trump has accepted the invitation. So thank you. Our teams will now work together to set a date, and we look forward to welcoming you in the United Kingdom.\nThank you, once again.\nPresident Trump.Thank you very much. What a beautiful accent. [Laughter] I would have been President 20 years ago if I had that accent. [Laughter]\nThank you. Very good to see you.\nPrime Minister Starmer.Yes. Good to—[inaudible].\n[President Trump and Prime Minister Starmer shook hands.]\nPresident Trump.We'll take a couple of questions.\nOkay. Let's see here. Go ahead, please.\nTariffs/China-U.S. Trade\nQ.Thank you. Thank you, Mr. President. Earlier today you told me that you believe that foreign countries pay tariffs, but Americans who are concerned about higher prices believe, as most people do, that they're paid by consumers and importers when they import things into this country. Can you explain how you came to this belief that foreign governments are paying tariffs?\nAnd for the Prime Minister, did you discuss with President Trump his repeated statements of desire to annex Canada? And has the King expressed any concern over the President's apparent desire to remove one of his realms from his control?\nPresident Trump.So I'll go ahead—the first part. The tariffs are necessary because we've been treated very unfairly by many, many countries, including our friends—friend and foe. But we've been treated very unfairly in trade at levels that nobody has really ever seen before. And especially under the Biden administration, they really took advantage of the United States.\nI put massive tariffs on China during my 4 years. We had the best economy in the history of our country. One—probably the best economy—maybe the best economy in the history of the world. And I had—I used tariffs to even things up. And in particular, with China, we took in hundreds of billions of dollars. And we had no inflation.\nAnd it's a myth. It's a myth that's put out there by foreign countries that really don't like paying tariffs and—especially to even up. So we've been treated badly by a lot. We're using tariffs.\nAnd I find—and you just have to look at the numbers, but I find that it's not about inflation; it's about fairness. And the inflation, for us, has not existed, and I don't think it's going to exist.\nWe're going to bring our car industry back. We're going to bring our chips back. We're going to bring so many things back to our country, including pharmaceuticals and drugs.\nAnd the thing that's going to get us there is tariffs. And I say often it's my favorite word in the dictionary, but I always preface that by saying now—because I got into a lot of trouble with the fake news where they say, \"That's not good.\" So I say, God, love, family, wife, they're all my favorite words—[laughter]—but tariff is about number four or five on the list. [Laughter]\nBut I will tell you, it's going to make our country rich, and it's going to stop us from being a laughing stock all over the world, because we have been taken advantage of like no country has ever been taken advantage of.\nThank you very much. And—[inaudible]—answer.\nPrime Minister Starmer.Look, we had a really good discussion, a productive discussion, a good discussion, as a result of which our teams are now going to be working together on an economic deal. Our teams are going to be working together on security in Ukraine.\nYou mentioned Canada. I think you're trying to find a divide between us that doesn't exist. We're the closest of nations, and we've had very good discussions——\nQ.No, I'm just asking if you discussed——\nPrime Minister Starmer.——today. But we didn't discuss Canada.\nQ.——it, sir.\nPresident Trump.That's enough. Thank you.\nPlease. Go ahead. Go ahead. Yes. Thank you.\nUnited Kingdom\nQ.Hi. Natasha Clark——\nPresident Trump.Hi.\nQ.——from LBC. Mr. President, you said you're working on a new trade deal with Britain, which we, of course, welcome. President Obama once said Britain was at \"the back of the queue\" for that trade deal. Where are we now? When do you think we'll—we're going to see that?\nAnd, Prime Minister, the BBC has today admitted serious flaws over the recent Gaza coverage, suggestions of payments made to people linked to Hamas. Does the BBC still have your trust? Thank you.\nPresident Trump.Well, they didn't do well with President Obama. He never got a lot of things done, and he didn't get a trade deal done that was of any importance or magnitude. We have—we've had great discussions on trade, and I think we're going to have a deal done rather quickly—as quickly as it can be done. We'll—we're going to have something, I think, rather quickly. We expect to do that. Okay?\nPlease.\nPrime Minister Starmer.On the BBC. Look, I've been concerned about the program in question. The Secretary of State had a meeting with the BBC—I think it was yesterday, could have been the day before.\nThank you.\nPresident Trump.Jeff [Jeff Mason, Reuters], go ahead.\nQ.Thank you, sir.\n[The reporter cleared his throat.]\nPardon me.\nNorth Atlantic Treaty Organization\nMr. President, do you support article 5 of the NATO treaty? And are you concerned that it might be triggered if European peacekeeping forces end up in Ukraine?\nPresident Trump.I support it. I don't think we're going to have any reason for it. I think we're going to have a very successful peace, and I think it's going to be a long-lasting peace. And I think it's going to happen, hopefully, quickly. It—if it doesn't happen quickly, it may not happen at all.\nAnd we want it for two reasons. Number one, I want to see—on a humane basis, I want to see soldiers stop getting shot, because, largely, it's soldiers now. Towns have been obliterated. But it's largely that.\nAnd I don't want to pay billions and billions and billions of dollars, nor does the Prime Minister or anybody else, on a senseless war that should have never happened. And we're going to get it taken care of. But I think it's going to be a peace that's going to be long-lasting.\nDo you have a question for the Prime Minister?\nUkraine/Critical Minerals Supply\nQ.Thank you. Mr. Prime Minister, you were asking the President today about a backstop for Europe if the peacekeeping force ends up in Ukraine. Did you feel like you got a satisfying answer for yourself and for Europe?\nAnd, Mr. President, if you want to comment on that as well, please do.\nPrime Minister Starmer.I thought we had a very productive discussion. Obviously, as the President says, the deal has to come first. But yes, our teams are going to be talking about how we make sure that deal sticks, is lasting, and enforced. So our teams will be talking about that.\nPresident Trump.Okay. Please, blue.\nQ.Mr. President, some experts think it could take more than a decade to mine the precious minerals from Ukraine. How much should the U.S. expect to receive? And when do you expect to see that come to fruition?\nPresident Trump.Well, we're never going to know that answer but by our being in Ukraine and doing the exploration and also the digging and taking the rare earth, which we need in our country very badly. We'll be doing a substantial amount of work, probably about—at least what we have in there, and we hope to be able to do that.\nYou never know when it comes to that. You know, you dig, and maybe things aren't there like you think they're there. But we'll be spending a lot of time there. It will be great for Ukraine. It's like a huge economic development project. So it will be good for both countries. Okay?\nPlease.\nUkraine/Russia\nQ.Prime Minister——\n[The reporter cleared his throat.]\nExcuse me. Prime Minister, you've talked about putting British soldiers' boots on the ground in Ukraine in the event that President Trump succeeds with his peace deal. But can you do that without a firm assurance that America will have our back in the form of some kind of security guarantee were Putin to breach that agreement?\nAnd, Mr. President, tomorrow you're seeing President Zelenskyy to sign this deal on minerals and energy that could be hugely important to the United States. Will you take the opportunity to apologize to him for calling him a dictator, while praising Vladimir Putin, who is a dictator?\nPrime Minister Starmer.Well, Robert, let me start by saying I've been really clear today and previously that I think that European countries, including the United Kingdom, need to step up in our own defense and security. We've been doing that in recent days. You saw the announcement we made on spending just the other day.\nIn addition to that, I've made it clear that the United Kingdom will play its full part in ensuring that, if there's a deal—and that we hope there is a deal in Ukraine—that that is a lasting deal that sticks. And we're obviously working with other European countries on that—France and NATO, in particular. But we—I've got—I think I'm hosting 18 countries on Sunday to further our discussions.\nYou heard from the President this morning that, you know, as historically has always been the case, we have each other's backs.\nAnd today we've been talking about the deal, how that will be a lasting deal. And coming out of this, our teams will now be talking in detail about that.\nPresident Trump.And I think we're going to have a very good meeting tomorrow—11 o'clock. And I think we're going to have a very good meeting tomorrow morning. We're going to get along really well. Okay? We have a lot of respect. I have a lot of respect for him.\nWe've given them a lot of equipment and a lot of money, but they have fought very bravely, no matter how you figure. They have really fought. Somebody has to use that equipment, and they have been very brave in that sense.\nYes, please. Go ahead.\nCease-Fire and Hostage-Release Deal Between Israel and Hamas\nQ.Thank you, sir. So, the Gaza cease-fire deal is nearing an end this Saturday, and there's been some worry that phase two might never get there. Do you believe that phase two of the cease-fire in Gaza will come to fruition, and have you spoken to Netanyahu about it?\nAnd for the Prime Minister, this peacekeeping deal has been pushed forward by the U.K. and France as well. Have you been in discussions with any other European countries to join this — this initiative, and are you expecting Commonwealth countries to also join the efforts?\nThank you.\nPresident Trump.So we're working very hard on the Middle East and Gaza and all of the problems, and it's been going on for years and years and centuries and centuries. It's a— tough neighborhood, but it could be a very beautiful neighborhood, and I think we're going to come up with some pretty good solutions.\nBut phase one is almost complete. We've had some people that have been very seriously injured, very seriously hurt—both physically and mentally. They've come out of there very, very—and some of them in very, very bad shape. It's shocking—many young people. Young people aren't in bad shape. Young people are strong, healthy. They don't die. People have come out dead—young people and old people.\nIt's a rough situation, but I think we're going to make it much better. And I think that we've had a huge impact on that since we've been in just the 4 weeks. I think we've had a huge impact on Gaza, the Middle East, and we have some pretty good talks going on, concerning lots of other people that are going to make it better.\nSo we'll see what happens. Nobody really knows, but we'll see what happens. But I think we've had a very positive impact.\nPrime Minister.\nPrime Minister Starmer.Yes. On the question of the European countries. Yes, I've spoken to a number of countries, particularly in the last few weeks. We had a meeting in Paris last week. I've got a meeting on Sunday with 18 countries to further our discussions.\nObviously, we've been talking quite intensely to our French colleagues and to NATO but to other countries as well, because, as I say, I think it's important for European countries, including the United Kingdom, to step up and do more in the defense and security of Europe and our continent and the United Kingdom, and we'll do so.\nQ.Will you meet with him also?\nPrime Minister Starmer.Well, we're talking to a number of other countries.\nPresident Trump.Thank you. Yes, in the red, please.\nQ.Mr. President——\nPresident Trump.Pink-red. Flaming red.\nQ.Is it me or her?\nPresident Trump.Go ahead.\nUkraine/Russia/Hostages Held in Gaza, Palestinian Territories\nQ.Okay. Thank you, Mr. President. A question on Ukraine. Number one is, if you're not considering the security guarantees, are you open to other forms of, for example, intelligence cooperation with Ukraine?\nAnd, Mr. Prime Minister, President Trump has proposed a plan for Gaza. Does this fit into the two-state solution that the U.K. held for a long time? Do you see it fit into your general Middle Eastern strategy?\nThank you so much.\nPresident Trump.Yes, thank you very much. We're open to many things, but before I even think about that—that's almost pleasant to think about, because that would mean that peace has been arrived at. We have to arrive at that peace.\nAnd you know, you went 3½ years with an administration that never even really had a meeting—they didn't have a meeting on peace, and there was no prospect of peace.\nI think, frankly, Russia wanted to go through the whole long deal. I don't think they do anymore. I don't think they do. We had a very big impact on that whole situation.\nBut I don't like talking about phase two until I get phase one. Phase one is, I have to make peace. And we have to get Russia to agree. We have to get Ukraine to agree. And I think we will. I think we've come a long way. I believe we're going to get it done. I wouldn't say that if I didn't think so. And I think it will be very important, very historic, and we're going to save a lot of lives.\nPrime Minister Starmer.On the question of Gaza. The—the last few weeks of the ceasefire have been very impactful. And for me, there are two images that I remember more than any other. The first is Emily Damari, who is British, being reunited with her mother. You may remember she had her fingers missing after what she endured. That was an incredible moment. I had spent a lot of time with her mother while she was held captive, and her mother went through absolute torture.\nThe other image was thousands of Palestinians marching through rubble, trying to return to their communities and their homes.\nSo we have to do everything we can to ensure that the cease-fire continues so that more hostages can be returned, so that aid can be brought in that's desperately needed. And we—we need to allow Palestinians to return and to rebuild their lives, and we must all support them in doing that.\nAnd yes, I believe that the two-state solution is ultimately the only way for a lasting peace in the region.\nPresident Trump.And think of that, she came home with her fingers and part of her hand blown off.\nPrime Minister Starmer.That's terrible.\nPresident Trump.Yes. How bad does it get? And we had others that came home in much, much worse shape than that.\nPrime Minister Starmer.Yes.\nPresident Trump.It's a terrible situation.\nPlease. Yes.\nTariffs/United Kingdom\nQ.Thank you. Mr. President, did our Prime Minister persuade you not to put tariffs on the U.K.?\nAnd if I may, Prime Minister, do you think that Vladimir Putin is a man who is—will keep his word?\nThanks.\nPresident Trump.He tried. [Laughter] He was working hard, I'll tell you that. [Laughter] He earned whatever the hell they pay him over there. [Laughter] But he tried.\nWe—I think there's a very good chance that in the case of these two great, friendly countries, I think we could very well end up with a real trade deal where the tariffs wouldn't be necessary. We'll see.\nBut he's—he earned whatever they—whatever they pay him, he earned today. He was working hard at lunch. [Laughter] And I'm very receptive to it.\nI think we—in all fairness, in all seriousness, I think we have a very good chance at arriving in a very good deal. J.D. and—Scott and Howard—all the people are working on it, and I think we have a good chance at arriving at a deal that could be terrific—really terrific for both countries.\nOkay? Thank you.\nPrime Minister Starmer.On the second part of the question, I think my views on Putin are pretty well rehearsed and pretty well known. And my concern is that if there's a deal, and I hope there is a deal, that it must be a lasting deal, that it's not a temporary measure. And that is why I think it's really important that Putin knows that this deal, a historic deal, which I very much hope comes about, is there and it's a lasting deal and that we're able to deal with any inclination he has to go again or go further.\nPresident Trump.I think we'll have two deals. I think we'll have a deal on ending the war, and I think we're going to end up with a great trade deal with you.\nAnd it's an honor to be with you.\nAnd I want to thank everybody very much. Thank you very much.\nQ.Mr. President, on measles—[inaudible]?\nPrime Minister Starmer.Thank you. Appreciate it.\nPresident Trump.Thank you very much. Thank you.", "Link": "https://www.presidency.ucsb.edu/documents/the-presidents-news-conference-with-prime-minister-keir-starmer-the-united-kingdom"}
